-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-05-20 15:14:19
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `baseball`
--

-- --------------------------------------------------------

--
-- 資料表結構 `join_team`
--

CREATE TABLE `join_team` (
  `id` int(5) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL,
  `total_member` int(4) NOT NULL,
  `activity_date` datetime NOT NULL,
  `deadline_date` datetime NOT NULL,
  `city_name` varchar(10) NOT NULL,
  `district_name` varchar(10) NOT NULL,
  `place_name` varchar(50) NOT NULL,
  `description` varchar(5000) NOT NULL,
  `image` varchar(100) NOT NULL,
  `created_at` datetime NOT NULL,
  `valid` tinyint(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `join_team`
--

INSERT INTO `join_team` (`id`, `name`, `total_member`, `activity_date`, `deadline_date`, `city_name`, `district_name`, `place_name`, `description`, `image`, `created_at`, `valid`) VALUES
(1, '台北假日投接球練習', 2, '2024-06-02 17:00:00', '2024-06-01 17:00:00', '臺北市', '萬華區', '萬華區雙園河濱公園', '北漂上來工作，大部分的球友都在南部，想找位可以一起練習投接球的人!\n有興趣的話也可以再約其他天', 'joinDefaultImg.jpg', '2024-05-16 15:45:48', 1),
(2, '來一起玩五人制棒球 ! ', 5, '2024-05-24 13:00:00', '2024-05-23 13:00:00', '臺北市', '士林區', '臺北市天母棒球場', '歡迎大家來參加 ~ 沒有捕手也不需要球棒 (球是用手掌或拳頭擊出) ，簡單好上手。主揪這邊也有提供專門的球具', '1715845992155_join.jpg', '2024-05-16 15:53:13', 1),
(3, '新手壘球團，輕鬆打快樂玩', 9, '2024-05-26 10:00:00', '2024-05-25 10:00:00', '臺北市', '中山區', '臺北市中山區迎風河濱運動公園', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715846390791_join.jpeg', '2024-05-16 15:59:52', 1),
(4, '信義區棒壘球打擊練習', 4, '2024-05-30 08:30:00', '2024-05-29 08:30:00', '臺北市', '信義區', '臺北醫學大學田徑場', '單純打擊練習 ! 已借到場地，球棒基本上自備，但如果有想嘗試看看的朋友，這邊也有多一支球棒可借，詳細可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715847846864_join.jpeg', '2024-05-16 16:24:08', 1),
(5, '新北的朋友看過來 !', 9, '2024-05-25 15:00:00', '2024-05-24 15:00:00', '新北市', '板橋區', '新北市板橋區大漢橋北面棒球場(大漢溪右岸自行車道1.95KM處)', '想要找幾個人一起打棒球，新手老手都歡迎~ 身為老玩家，這邊也可以提供一些手套、球、球棒，初次接觸棒球的人也可以借來使用，大家一起體驗一起玩 !', '1715848284271_join.jpg', '2024-05-16 16:32:22', 1),
(6, '瑞芳棒球團', 18, '2024-05-28 10:00:00', '2024-05-27 10:00:00', '新北市', '瑞芳區', '瑞芳棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', 'joinDefaultImg.jpg', '2024-05-16 16:35:49', 1),
(7, '揪團揪起來 - 基隆團', 5, '2024-05-25 10:30:00', '2024-05-24 10:30:00', '基隆市', '', '基隆市立棒球場', '無論是初學者還是資深玩家，都歡迎加入 ! 一起打打球活動筋骨，投接球或是打擊練習都 OK ! 人數夠多的話也能打場簡易比賽 ~ \n', '1715857492322_join.jpeg', '2024-05-16 19:04:53', 1),
(8, '有基隆暖暖的夥伴要一起打球嗎', 5, '2024-05-23 11:30:00', '2024-05-22 11:30:00', '基隆市', '暖暖區', '基隆市暖暖運動公園', '周圍都沒有認識喜歡打壘球的同好QQ 所以來揪揪看有沒有剛好在暖暖區附近的，假日方便的話能就近約一下，之後也還能再約 !  Line 有創匿名社群，有興趣的話也可以一起討論棒壘球相關 : https://line.me/ti/g2/TuvCleo852dswER?utM_source=invitation&utm=default', '1715860622059_join.jpeg', '2024-05-16 19:57:02', 1),
(9, '永和場次開團了 !  一起來玩 !', 10, '2024-05-22 20:00:00', '2024-05-21 20:00:00', '新北市', '永和區', '新北市永和區綠寶石公園棒球場(新店溪左岸自行車道5.9KM)', '想找志同道合的夥伴一起組團打壘球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是能和大家輕鬆打個棒球~ 不需要太拘束 !\n如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715861604659_join.jpg', '2024-05-16 20:14:56', 1),
(10, '板橋人一起來揪打 ~', 8, '2024-05-31 19:00:00', '2024-05-30 19:00:00', '新北市', '板橋區', '浮洲橋棒球場', '本身對棒壘球有極大熱忱，假日也都會定期參與學校球隊練習，21日想另約就近一起打球，如果之後有興趣可以再約。Line 匿名社群，有興趣的話也可以一起討論棒壘球相關 : https://line.me/ti/g2/TuvCleo852dswER?utM_source=invitation&utm=default', '1715862307439_join.jpg', '2024-05-16 20:25:08', 1),
(11, '想找一位朋友輕鬆練個壘球打擊', 2, '2024-05-19 11:00:00', '2024-05-18 11:00:00', '宜蘭縣', '', '三星鄉綜合運動場', '週日剛好有時間，太久沒有練習覺得手感有點生疏，想找個朋友來互相練打。大部分的週日都有時間，歡迎喜歡棒球的朋友一起定期來約。', '1715863492534_join.webp', '2024-05-16 20:44:55', 1),
(12, '台北新手歡樂團', 6, '2024-05-23 12:50:00', '2024-05-22 12:50:00', '臺北市', '', '青年公園棒球場', '剛踏入壘球這個坑，剛好有機會就來揪揪看，快樂輕鬆打就好~ 除了一般傳接球，也可以練練打擊，歡迎一起來打球!', '1715878381615_join.jpeg', '2024-05-17 00:53:10', 1),
(13, '公園棒球揪起來', 5, '2024-05-26 08:30:00', '2024-05-25 08:30:00', '臺北市', '中正區', '中正河濱公園', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715847846864_join.jpeg', '2024-05-17 02:26:27', 1),
(14, '新竹女子壘球', 2, '2024-05-23 11:00:00', '2024-05-22 11:00:00', '新竹縣', '竹北市', '頭前溪隆恩堰段高灘地右岸河濱休閒場地(簡易壘球場)', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', 'joinDefaultImg.jpg', '2024-05-17 02:27:18', 1),
(15, '短期揪個壘球團，練習一下', 2, '2024-05-28 11:00:00', '2024-05-27 11:00:00', '新竹縣', '', '竹東河濱公園棒壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715846390791_join.jpeg', '2024-05-17 02:28:12', 1),
(16, '有沒有苗栗的朋友想打棒球', 2, '2024-05-27 14:30:00', '2024-05-26 14:30:00', '苗栗縣', '', '聯合大學第二(八甲)校區壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', 'joinDefaultImg.jpg', '2024-05-17 02:28:35', 1),
(17, '平日晚上練球團', 2, '2024-05-22 20:00:00', '2024-05-21 20:00:00', '新北市', '', '中和區錦和運動公園-壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884171001_join.webp', '2024-05-17 02:29:32', 1),
(18, '大學生棒球團', 2, '2024-05-31 14:30:00', '2024-05-30 14:30:00', '桃園市', '', '體育大學棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884224693_join.jpg', '2024-05-17 02:30:25', 1),
(19, '楊梅打球好地方', 2, '2024-06-04 16:30:00', '2024-06-03 16:30:00', '桃園市', '', '桃園市楊梅區棒壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884282235_join.jpeg', '2024-05-17 02:31:22', 1),
(20, '開心打球美好時光', 2, '2024-05-28 14:30:00', '2024-05-27 14:30:00', '桃園市', '', '楊梅區富岡運動公園', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884348105_join.jpeg', '2024-05-17 02:32:28', 1),
(21, '休閒放鬆打打球', 2, '2024-06-10 13:30:00', '2024-06-09 13:30:00', '桃園市', '', '桃園市立平鎮棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884415780_join.jpeg', '2024-05-17 02:33:36', 1),
(22, '想長期組團練習，以縣市比賽為目標', 9, '2024-05-25 11:00:00', '2024-05-24 11:00:00', '高雄市', '', '中山大學棒球場', '邀請有興趣參加比賽的棒球同好一起練習 ! 之後也會再約定期的時間組團來打(以假日為主)', '1715886686821_join.jpeg', '2024-05-17 03:11:31', 1),
(23, '已借到學校場地的打擊練習場 ~', 4, '2024-06-15 13:00:00', '2024-06-14 13:00:00', '臺北市', '', '東園國小棒球打擊場', '比起自己一個人練習，想多找幾位有興趣的夥伴組團練打擊，曾經也是場地學校的校友，也有加入棒球隊，歡迎一起加入 ! 互相交流分享棒球 ~ ', '1715847846864_join.jpeg', '2024-05-18 03:04:32', 1),
(24, '天母團++ 棒球組團還缺2人', 3, '2024-05-22 15:00:00', '2024-05-21 15:00:00', '臺北市', '', '臺北市天母棒球場', '原本已經有約好團了，但其中兩位球友臨時有事，所以來平台找找看有沒有想組團一起練習的人，目前還缺兩位，地點在天母棒球場', '1715848284271_join.jpg', '2024-05-18 03:09:57', 1),
(25, '歡迎 ! 快來加入我們 ! ', 6, '2024-05-22 18:30:00', '2024-05-21 18:30:00', '臺北市', '', '士商壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715973604050_join.jpg', '2024-05-18 03:20:16', 1),
(26, '台北的壘球同好來揪一下 ~', 4, '2024-05-23 16:00:00', '2024-05-22 16:00:00', '臺北市', '', '中正河濱公園', '可以一起組團參加比賽 ! 團內已有7位隊員，需要再找3位成團~ 目前28號這場暫定在中正河濱公園，往後的練習可能會再改地方，如果有想再細部了解，也可以加我的Line聯絡 (ID搜尋 baseball2024) ', '1715974136728_join.jpg', '2024-05-18 03:28:57', 1),
(27, '士林球友聚，下午來練一下打擊', 6, '2024-05-18 14:30:00', '2024-05-17 14:30:00', '臺北市', '', '士林區百齡河濱公園', '中午剛好士林這邊的棒球同好會有舉辦研習，研習結束後想要約個一群來去百齡河濱公園那邊練打擊，球棒和球我這邊可以準備，如果自己本身有習慣的球棒也可自備，手套的話因為慣用手是右手，如果是使用左手手套的同好可能也需自備。', '1715975211405_join.jpg', '2024-05-18 03:51:52', 1),
(28, '新北週五晚上練習團', 2, '2024-05-24 17:00:00', '2024-05-23 17:00:00', '新北市', '', '新北市新莊區17號越堤道圓環南面棒球場(大漢溪左岸自行車道6.5KM處)', '投接球練習，年齡與性別不拘，只要對棒球有興趣都歡迎加入 ! 之後也還能再約，時間上的話盡量以周五下午以後', '1715976141752_join.jpg', '2024-05-18 04:02:22', 1),
(29, '校友棒球隊約起來 ! 9月校友盃要開打', 9, '2024-06-08 08:00:00', '2024-06-07 08:00:00', '臺北市', '', '臺北市立建國高級中學棒球場', '9月中剛好有場校友盃，想看能不能湊成一隊參加，6/8 當天先集合一起練習，後續練習日期會盡量以週六上午為主，詳細活動辦法和報名相關連結 : https://baseball.com.tw ，或是可以加入discord群組 : https://discord.com/invite/QWER12', '1715977231482_join.jpg', '2024-05-18 04:20:32', 1),
(30, '台北 - 徵1位球友一起練習', 2, '2024-06-02 15:30:00', '2024-06-01 15:30:00', '臺北市', '', '大理高中棒壘球打擊練習場', '單純打擊練習 ! 已借到場地，球棒基本上自備，但如果有想嘗試看看的朋友，這邊也有舊球棒可借，可加 Line聯繫 : qwe123 (搜尋ID)', '1715977453787_join.jpg', '2024-05-18 04:24:31', 1),
(31, '桃園輕鬆揪團打(國際棒球場)', 7, '2024-05-22 18:30:00', '2024-05-21 18:30:00', '桃園市', '', '桃園國際棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715978045986_join.jpg', '2024-05-18 04:34:06', 1),
(32, '桃園龜山非正式比賽揪團', 5, '2024-05-24 08:30:00', '2024-05-23 08:30:00', '桃園市', '', '龜山鄉棒球場', '輕鬆打 ! 無論是初學者還是資深玩家，都歡迎加入 ! 一起打打球活動筋骨~', 'joinDefaultImg.jpg', '2024-05-18 04:43:10', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `join_team`
--
ALTER TABLE `join_team`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `join_team`
--
ALTER TABLE `join_team`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
