-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-05-20 22:16:14
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `baseball`
--

-- --------------------------------------------------------

--
-- 資料表結構 `article`
--

CREATE TABLE `article` (
  `id` int(11) UNSIGNED NOT NULL,
  `subtitle` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` varchar(8000) NOT NULL,
  `photo` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  `type` varchar(50) NOT NULL,
  `type_id` varchar(10) NOT NULL,
  `valid` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `article`
--

INSERT INTO `article` (`id`, `subtitle`, `title`, `description`, `photo`, `created_at`, `type`, `type_id`, `valid`) VALUES
(1, '【棒球D教室】', '跑一壘規則介紹｜2023新手必懂的基本規則1 ', '<p>前言<br>跑一壘，屬於棒球跑壘的一部分，也有著專屬的跑壘規定。<br>那你知道一壘與其他壘包之間，有什麼差別嗎？為何跑者可以跑過一壘，而不會被觸殺出局呢？<br>本篇文章將依中華職棒棒球規則，整理有關於跑一壘的資訊及案例。</p><p><br>跑一壘規則基本介紹 -&nbsp;<br>跑一壘的出局方式有哪些？<br>封殺及觸殺。<br>一壘封殺，與強迫進壘出局的方式，原理上是相同的。只要守備方持球，先一步碰到壘包，跑者都算是出局。<br>至於觸殺的部分，適用於跑者在所有壘包間的攻防戰。</p><p><br>跑一壘與其他壘包有何不同？<br>與其他壘包的跑壘規則相比，明顯不同之處，就屬下面這兩項：<br>• 棒球場上，有畫出明確的壘線及三呎線。<br>• 打者跑過一壘壘包時，當下不會因離壘，而被觸殺出局。<br>本壘到一壘的距離有多長？<br>九十英呎（27.431 公尺）。在棒球場上，每個壘包之間的距離，都是相同的。</p><p>本壘到一壘的速度能多快？<br>依據 2021 年新聞報導當中，提到美國職棒大聯盟（MLB）左打者，平均跑上一壘的時間，需要 4.2 秒。<br>而在 2021 年當中，亞特蘭大勇士隊的 Ronald Acuna Jr. 跑出 2.9 秒的驚人速度。<br>另外，大家耳熟能詳的日本球星鈴木一朗，跑壘速度落在平均 3.7 秒。<br>至於，在中華職棒的部分，樂天桃猿的野手陳晨威，過去曾測出跑一壘的速度，最快可來到 3.7 秒。</p>', '2-1.jpg', '2022-10-26 11:29:02', '知識', '5', 1),
(2, '【棒球D教室】', '跑一壘規則介紹｜2023新手必懂的基本規則2', '<p>為何跑過一壘不會被觸殺呢？<br>這屬於跑一壘時的特殊規則。<br>可想像成，為了讓打者擊完球之後，往一壘全力衝刺，所出現的跑壘規則。<br>但，只要跑者出現，企圖往二壘跑的情形，跑者就會變成負險進壘狀態。<br>跑一壘時，為何要滑壘或撲壘呢？<br>跑者跑一壘時，選擇撲壘或滑壘的原因，主要為下面兩項：<br>• 球員對於上壘的渴望（展現拚勁）。<br>• 守備方若出現守備瑕疵（傳球偏差），跑者就可藉由滑（撲）壘，閃避守備方的觸殺。<br>以下影片中，中華隊打者彭政閔，準備跑上一壘時，使用撲壘的方式，閃躲一壘手的觸殺。<br>跑一壘哪些行為會妨礙守備呢？<br>棒球場上，較常見的兩種妨礙跑壘狀況如下：<br>• 跑在壘線內或三呎線以外的區域。<br>• 裁判認定跑者刻意阻擋，或影響守備方傳球及接球的跑壘行為。<br>有關跑一壘的三呎線規則？<br>依中華職棒的棒球規則，下面幾項是較為常使用的規範：<br>• 跑者跑向一壘時，進入中後段三呎線區域，必須跑在壘線與三呎線之間。<br>• 跑者跑在壘線上，是符合規定的。<br>• 跑者最後一步，準備踩一壘時，另一隻腳允許踩在壘線之內。<br>以下影片為，樂天桃猿打者廖健富，跑向一壘時，雙腳都是跑在壘線上。<br>只有最後一步，準備要踩一壘壘包時，左腳才跨進壘線之內，所以符合棒球規則，並無妨礙守備。<br>跑一壘規則之參考資料<br>• &nbsp;一壘間三呎線（Threefoot first base lines）<br>• 棒球規則：5.09<br>• 棒球補述：3.07、4.15<br>跑一壘有哪些相關案例呢？<br>案例一、閃躲野手觸殺，跑離三呎線<br>場上狀況：無人在壘、兩出局<br>影片中，富邦悍將打者王勝偉，與投手王維中的投打對決，使用突襲短打的方式進攻，把球點向一壘壘包。<br>一壘手林智勝接球後，因離一壘壘包太遠，而選擇直接用觸殺的方式，來讓打者王勝偉出局。<br>王勝偉試圖往右邊閃躲一壘手的觸殺，但已跨出三呎線的範圍，被一壘裁判直接判定出局。<br>案例二、跑者跑在壘線內，造成妨礙守備<br>場上狀況：一三壘有人、一出局<br>影片中，統一7-ELEVEn獅打者林靖凱，與投手米蘭達的投打對決，使用突襲短打的方式進攻，把球點向一壘壘包。<br>投手米蘭達下投手丘處理球，卻把球傳向一壘時，傳到了林靖凱的腳上。<br>主審裁判認定，林靖凱在跑壘過程中，跑在壘線的內側，而造成守備方的傳球失誤，故判定為妨礙守備。<br>• 跑一壘可以滑壘嗎？<br>可以。<br>但實際比賽中，這樣的跑壘不常見，除了跑壘速度變慢之外，也增加了受傷的風險。<br>• 為何跑過一壘不會被觸殺呢？<br>這屬於棒球跑壘規則的一部份。打者擊完球後，往一壘進行直線衝刺時，是允許跑過一壘的。<br>但，只要跑者出現，往二壘前進的企圖時，就不適用這項規定。<br>結論<br>對於跑一壘有什麼問題或想法，歡迎在下方留言，或許你所提供的資訊，也能幫助到其他人，解決他所遇到的問題。<br>有關其他棒球術語、規則、名詞及用語，可利用首頁右上角放大鏡的搜尋功能，相信會找到你所需要的問題答案。</p>', '2-3.png', '2024-01-22 10:01:00', '知識', '5', 1),
(3, '【棒球D教室】', '棒球比賽模式規則介紹｜2023新手必懂的基本規則1', '<p>中華職棒比賽模式基本介紹<br>中華職棒自辦熱身賽<br>何謂自辦熱身賽？<br>由中職球隊自行規畫及協調，與其他球隊所舉辦的比賽。基本上安排於球隊春訓的後半段，透過比賽方式，來實際了解投手及打者當下的狀況。<br>比賽過程中，為了讓更多球員有上場空間，包含著二軍選手們，會適時替換球員上場比賽。<br>打者的部分，約進行 2-3 個打席之後，就換板凳球員上場，並接替守備的任務。<br>投手的部分，教練團則會設定用球數及投球局數，藉此讓更多投手上場投球，並觀察整體的狀況。<br>至於比賽場地的使用，以中南部為主。部分賽事會安排於二軍平時比賽的球場，故住在附近的球迷，也可把握難得的機會，行地利之便進場看球。<br>下列為中華職棒自辦熱身賽簡易介紹：<br>•&nbsp;&nbsp;&nbsp; 比賽目的：測試及調整為主（所有球員都有機會上場比賽）<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽場地：中部以南的球場為主（北部較容易受雨勢影響）<br>•&nbsp; &nbsp;&nbsp;比賽時間：每年 2-3 月<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽球隊：隊內賽、中華職棒各球隊<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽規則：中華職棒棒球規則，並視比賽需求做些微調整，以達到熱身賽的目的為主<br>中華職棒官辦熱身賽<br>何謂官辦熱身賽？<br>由中華職棒官方所舉辦的比賽，基本上銜接於各球隊自辦熱身賽的後面。<br>整體比賽的目的及規範，與自辦熱身賽相去不遠，唯一明顯不同的地方，大概就屬開放球迷進場（收門票）。<br>畢竟現場工作人員，中職官方有經費支出的需求，但整體票價與例行賽相比，已便宜許多。<br>另外，中職裁判透過熱身賽的過程，實際運用並熟悉關於棒球規則，有新增或修訂的地方。<br>下列為中華職棒官辦熱身賽簡易介紹：<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽目的：測試及調整為主（所有球員都有機會上場比賽）<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽場地：中部以南的球場為主（北部較容易受雨勢影響）<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽時間：2-3 月（在球隊自辦熱身賽之後）<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽球隊：中華職棒各球隊<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽規則：以中華職棒棒球規則為主，但不會有延長賽<br>上述兩種熱身賽，均已調整、測試球員為目的，故球員成績就僅供參考。<br>但這類型的熱身賽，對於二軍球員的ˋ意義，又與一軍的球員不太相同。<br>除了調整、測試之外，部分二軍球員會透過熱身賽，力求場上的表現，進而讓教練團看見，增加賽季開打後，進入一軍 26 人名單陣容的機會。<br>中華職棒例行賽<br>何謂中職例行賽？<br>由中華職棒所舉辦的正式比賽，參考 2022 年的賽季規劃，每支球隊各安排 120 場比賽，分別在上、下半季進行。<br>為何要區分為上、下半季呢？主要考量中職球隊整體數量偏少，藉此方式，來增加比賽張力及可看性。<br>而每場比賽的勝負，除了影響上、下半季當時的勝率之外，也會統計全年度的勝率。<br>下列為中華職棒例行賽簡易介紹：<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽場數：每支球隊進行 120 場<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽模式：區分為上、下半季，各 60 場比賽<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽球隊：符合中華職棒一軍出賽資格的球隊<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽目的：正式比賽。各球隊以總冠軍為目標（爭奪季冠軍、提升全年勝率）<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽規則：中華職棒棒球規則。延長賽最多至 12 局<br>中華職棒季後挑戰賽<br>何謂季後挑戰賽？<br>於中華職棒例行賽結束之後，依照季冠軍球隊、全年度球隊勝率，來決定參加季後挑戰賽的隊伍，勝出者即可進入台灣大賽（總冠軍賽）。<br>下列為中華職棒季後挑戰賽簡易介紹：<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽場數：3-5 場<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽模式：五戰三勝制度<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽球隊：符合季後挑戰賽之兩球隊 （下方補充）<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽目的：決定進入台灣大賽的球隊<br>•&nbsp;&nbsp;&nbsp;比賽規則：中華職棒棒球規則<br>上、下半季的季冠軍不同球隊 – 案例說明<br>•&nbsp;&nbsp;&nbsp;&nbsp;A 球隊為上半季冠軍、全年勝率第二<br>•&nbsp;&nbsp;&nbsp;B 球隊為下半季冠軍、全年勝率第一<br>•&nbsp;&nbsp;&nbsp;&nbsp;C 球隊為全年度勝率第三<br>B 球隊直接晉級台灣大賽（總冠軍賽），並保有主場優勢（1、2、5、6、7）。<br>A 球隊與 C 球隊需進行季後挑戰賽，勝出者進到台灣大賽，爭奪年度總冠軍。<br>A 球隊與 C 球隊的季後挑戰賽，因 A 球隊為季冠軍，故保有 1 勝的對戰優勢，再加上主場優勢（1、2、4）。<br>上、下半季的季冠軍相同球隊 – 案例說明<br>•&nbsp;&nbsp;&nbsp;&nbsp;A 球隊為上下半季冠軍<br>•&nbsp;&nbsp;&nbsp;&nbsp;B 球隊為全年勝率第二<br>•&nbsp;&nbsp;&nbsp;&nbsp;C 球隊為全年勝率第三<br>A 球隊直接晉級台灣大賽（總冠軍賽），並保有一勝的優勢，以及主場優勢（1、2、5、6）。<br>B 球隊與 C 球隊需進行季後挑戰賽，勝出者進到台灣大賽，爭奪總冠軍。<br>B 球隊與 C 球隊的季後挑戰賽，雙方均無季冠軍，但因 B 球隊全年勝率較高，所以享有主場優勢（1、2、5）。<br>中華職棒台灣大賽（總冠軍賽）<br>何謂台灣大賽？<br>每年中華職棒最重要的賽事之一，由戰績最佳的球隊，以及季後挑戰賽脫穎而出的球隊，進行比賽，勝出者將為年度總冠軍球隊。<br>下列為中華職棒台灣大賽簡易介紹：<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽場數：3-7 場<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽模式：七戰四勝制度<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽球隊：符合總冠軍賽之兩球隊<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽目的：爭取年度成績最佳之球隊榮耀<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽規則：中華職棒棒球規則。另，總冠軍賽有部分特殊規則，如：延長賽無限制、增加左右線審等等。<br>中華職棒明星對抗賽<br>何謂中職明星對抗賽？<br>中華職棒年度重要賽事之一，由球迷及專業人員（媒體）投票選出，入選比賽之選手，將組成兩支球隊，進行對抗賽。<br>這類型的賽事，能跳出原先球隊框架的限制，也不受勝負拘束，讓整體比賽更加精采及具話題性。<br>下列為中華職棒明星對抗賽簡易介紹：<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽場數：2 場<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽時間：中職例行賽上、下半季之交接處（7月）<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽模式：對抗賽、趣味競賽<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽球員：球迷及媒體票選產生<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽球隊：明星隊、中華隊<br>•&nbsp;&nbsp;&nbsp;&nbsp;比賽目的：無對戰壓力下比賽，與球迷同樂<br>• &nbsp;&nbsp;&nbsp;比賽規則：中華職棒棒球規則。無延長賽</p>', '4-1.jpg', '2022-10-15 12:20:00', '知識', '5', 1),
(4, '【棒球D教室】', '棒球比賽模式規則介紹｜2023新手必懂的基本規則2', '<p>中華職棒比賽模式基本介紹<br>中華職棒自辦熱身賽<br>何謂自辦熱身賽？<br>由中職球隊自行規畫及協調，與其他球隊所舉辦的比賽。基本上安排於球隊春訓的後半段，透過比賽方式，來實際了解投手及打者當下的狀況。<br>比賽過程中，為了讓更多球員有上場空間，包含著二軍選手們，會適時替換球員上場比賽。<br>打者的部分，約進行 2-3 個打席之後，就換板凳球員上場，並接替守備的任務。<br>投手的部分，教練團則會設定用球數及投球局數，藉此讓更多投手上場投球，並觀察整體的狀況。<br>至於比賽場地的使用，以中南部為主。部分賽事會安排於二軍平時比賽的球場，故住在附近的球迷，也可把握難得的機會，行地利之便進場看球。<br>下列為中華職棒自辦熱身賽簡易介紹：<br>比賽目的：測試及調整為主（所有球員都有機會上場比賽）<br>比賽場地：中部以南的球場為主（北部較容易受雨勢影響）<br>比賽時間：每年 2-3 月<br>比賽球隊：隊內賽、中華職棒各球隊<br>比賽規則：中華職棒棒球規則，並視比賽需求做些微調整，以達到熱身賽的目的為主<br>中華職棒官辦熱身賽<br>何謂官辦熱身賽？<br>由中華職棒官方所舉辦的比賽，基本上銜接於各球隊自辦熱身賽的後面。<br>整體比賽的目的及規範，與自辦熱身賽相去不遠，唯一明顯不同的地方，大概就屬開放球迷進場（收門票）。<br>畢竟現場工作人員，中職官方有經費支出的需求，但整體票價與例行賽相比，已便宜許多。<br>另外，中職裁判透過熱身賽的過程，實際運用並熟悉關於棒球規則，有新增或修訂的地方。<br>下列為中華職棒官辦熱身賽簡易介紹：<br>比賽目的：測試及調整為主（所有球員都有機會上場比賽）<br>比賽場地：中部以南的球場為主（北部較容易受雨勢影響）<br>比賽時間：2-3 月（在球隊自辦熱身賽之後）<br>比賽球隊：中華職棒各球隊<br>比賽規則：以中華職棒棒球規則為主，但不會有延長賽<br>上述兩種熱身賽，均已調整、測試球員為目的，故球員成績就僅供參考。<br>但這類型的熱身賽，對於二軍球員的ˋ意義，又與一軍的球員不太相同。<br>除了調整、測試之外，部分二軍球員會透過熱身賽，力求場上的表現，進而讓教練團看見，增加賽季開打後，進入一軍 26 人名單陣容的機會。<br>中華職棒例行賽<br>何謂中職例行賽？<br>由中華職棒所舉辦的正式比賽，參考 2022 年的賽季規劃，每支球隊各安排 120 場比賽，分別在上、下半季進行。<br>為何要區分為上、下半季呢？主要考量中職球隊整體數量偏少，藉此方式，來增加比賽張力及可看性。<br>而每場比賽的勝負，除了影響上、下半季當時的勝率之外，也會統計全年度的勝率。<br>下列為中華職棒例行賽簡易介紹：<br>比賽場數：每支球隊進行 120 場<br>比賽模式：區分為上、下半季，各 60 場比賽<br>比賽球隊：符合中華職棒一軍出賽資格的球隊<br>比賽目的：正式比賽。各球隊以總冠軍為目標（爭奪季冠軍、提升全年勝率）<br>比賽規則：中華職棒棒球規則。延長賽最多至 12 局<br>中華職棒季後挑戰賽<br>何謂季後挑戰賽？<br>於中華職棒例行賽結束之後，依照季冠軍球隊、全年度球隊勝率，來決定參加季後挑戰賽的隊伍，勝出者即可進入台灣大賽（總冠軍賽）。<br>下列為中華職棒季後挑戰賽簡易介紹：<br>比賽場數：3-5 場<br>比賽模式：五戰三勝制度<br>比賽球隊：符合季後挑戰賽之兩球隊 （下方補充）<br>比賽目的：決定進入台灣大賽的球隊<br>比賽規則：中華職棒棒球規則<br>上、下半季的季冠軍不同球隊 – 案例說明<br>A 球隊為上半季冠軍、全年勝率第二<br>B 球隊為下半季冠軍、全年勝率第一<br>C 球隊為全年度勝率第三<br>B 球隊直接晉級台灣大賽（總冠軍賽），並保有主場優勢（1、2、5、6、7）。<br>A 球隊與 C 球隊需進行季後挑戰賽，勝出者進到台灣大賽，爭奪年度總冠軍。<br>A 球隊與 C 球隊的季後挑戰賽，因 A 球隊為季冠軍，故保有 1 勝的對戰優勢，再加上主場優勢（1、2、4）。<br>上、下半季的季冠軍相同球隊 – 案例說明<br>A 球隊為上下半季冠軍<br>B 球隊為全年勝率第二<br>C 球隊為全年勝率第三<br>A 球隊直接晉級台灣大賽（總冠軍賽），並保有一勝的優勢，以及主場優勢（1、2、5、6）。<br>B 球隊與 C 球隊需進行季後挑戰賽，勝出者進到台灣大賽，爭奪總冠軍。<br>B 球隊與 C 球隊的季後挑戰賽，雙方均無季冠軍，但因 B 球隊全年勝率較高，所以享有主場優勢（1、2、5）。<br>中華職棒台灣大賽（總冠軍賽）<br>何謂台灣大賽？<br>每年中華職棒最重要的賽事之一，由戰績最佳的球隊，以及季後挑戰賽脫穎而出的球隊，進行比賽，勝出者將為年度總冠軍球隊。<br>下列為中華職棒台灣大賽簡易介紹：<br>比賽場數：3-7 場<br>比賽模式：七戰四勝制度<br>比賽球隊：符合總冠軍賽之兩球隊<br>比賽目的：爭取年度成績最佳之球隊榮耀<br>比賽規則：中華職棒棒球規則。另，總冠軍賽有部分特殊規則，如：延長賽無限制、增加左右線審等等。<br>中華職棒明星對抗賽<br>何謂中職明星對抗賽？<br>中華職棒年度重要賽事之一，由球迷及專業人員（媒體）投票選出，入選比賽之選手，將組成兩支球隊，進行對抗賽。<br>這類型的賽事，能跳出原先球隊框架的限制，也不受勝負拘束，讓整體比賽更加精采及具話題性。<br>下列為中華職棒明星對抗賽簡易介紹：<br>比賽場數：2 場<br>比賽時間：中職例行賽上、下半季之交接處（7月）<br>比賽模式：對抗賽、趣味競賽<br>比賽球員：球迷及媒體票選產生<br>比賽球隊：明星隊、中華隊<br>比賽目的：無對戰壓力下比賽，與球迷同樂<br>比賽規則：中華職棒棒球規則。無延長賽</p>', '4-2.jpg', '2022-10-15 10:10:10', '知識', '5', 1),
(5, '【棒球D教室】', '棒球出局規則介紹｜2023新手必懂的基本規則1', '<p>前言<br>「棒球出局數很重要嗎？」為何時常看到總教練們，對於每一個出局數，都是如此的斤斤計較呢？非得要在球場上與裁判爭得面紅耳赤的。<br>關於棒球規則中的出局數，雖看似讓這項運動變得複雜，但也正是他的迷人之處的特點之一。<br>那出局數要底有什麼重要的呢？<br>這篇文章將向你介紹，關於棒球出局規則的基本概念及個人見解。<br>棒球出局規則的基本介紹<br>出局數代表的意義<br>棒球與籃球，都屬於團體運動的一種，這兩者相同之處，在於比賽結束之前，攻下最多分數者勝出。<br>但，最大不同的點在於，職業籃球是以「時間」做為比賽結束的依據，只要在比賽時間結束之前，獲得較多分數的球隊，將拿下比賽的勝利。<br>而，對於職業棒球來說，基本上並無時間限制（其他特例），是透過比賽局數及「出局數」這兩項，做為比賽結束的依據。<br>球隊就必須思考，如何最大化這些出局數，拿下比賽最終的勝利。<br>棒球出局英文<br>棒球出局英文，OUT。<br>在棒球比賽轉播過程中，時常能聽到主播使用這個詞，來營造出臨場感。<br>出局數是如何產生的？<br>以棒球規則來看，該如何在棒球比賽中產生出局數？主要可區分為下面兩類：<br>•&nbsp;&nbsp;&nbsp;&nbsp;刺殺（Putouts） – 投手三振、野手接殺、野手觸殺、封殺等等。<br>•&nbsp;&nbsp;&nbsp;&nbsp;助殺（Assists）- 外野手長傳助殺、投手牽制跑者出局等等。<br>一局有幾個出局數呢？<br>3 個。<br>當該半局出現第三個出局數時，兩支球隊則會進行攻守交換。<br>棒球比賽打幾局？又有多少出局數呢？<br>依職業棒球的比賽制度來看，一場比賽會進行「9局」的比賽長度。<br>以這個數字換算下來，每支球隊則會有「27個」出局數可以使用。<br>為什麼出局數這麼重要呢？<br>當落後的一方，所有的出局數都使用完後，就意味著球隊輸掉了這場比賽。<br>尤其在接近比賽後段時，比數落後的球隊，會更加珍惜及運用每一個出局數。<br>在最後一個出局數出現之前，仍有機會追平比數，甚至逆轉超前，把比賽的勝利收下來。<br>為什麼球員都要踩在壘包上呢？<br>依棒球規則來看，是為了避免被野手持球觸殺出局。<br>當主審裁判喊「Play」後開始比賽，壘包上的跑者只要離開壘包，守備方都可以持球，進行觸殺的動作，讓跑者出局。<br>而，實際比賽中，跑者必需判斷當下的狀況，應留在壘包上，或是選擇適當的離壘，再進壘的機會。<br>棒球裁判的出局手勢<br>棒球裁判在場上判定出局的手勢，大致上分成兩種。一種是球員在壘包上的攻防，另一種則是投手投出三振時的手勢。<br>•&nbsp;&nbsp;&nbsp;&nbsp;壘包上的攻防 – 裁判會使用右手，向前捶一下或揮拳的動作，裁定跑者出局。<br>•&nbsp;&nbsp;&nbsp;&nbsp;三振手勢 – 每位裁判都有個自習慣的三振手勢。<br>棒球比賽有哪些出局的方式？<br>三振出局<br>棒球比賽在投打過程中，當投手投出「第三顆」好球時，只要符合下面的情境，打者都算是三振出局。<br>1.&nbsp;&nbsp;&nbsp;&nbsp;球在進壘時，打者沒有揮棒，而主審裁判判定為好球。<br>2.&nbsp;&nbsp;&nbsp;&nbsp;球在進壘時，打者揮棒沒打到球，捕手確實接捕動作，無論球的進壘點，都算是第三顆好球。<br>3.&nbsp;&nbsp;&nbsp;&nbsp;球在進壘時，打者揮棒沒打到球，捕手無法在第一時間確實接捕，必須進行觸殺或傳向一壘封殺，才算出局。<br>4.&nbsp;&nbsp;&nbsp;&nbsp;球在進壘時，打者打到球後，被捕手直接接住，形成擦棒被捕。<br>5.&nbsp;&nbsp;&nbsp;&nbsp;球在進壘時，打者使用觸擊短打，點成界外球。<br>以下影片投手所投出三振的第三顆好球，包括主審裁判判定為好球（1）以及打者揮空（2）。<br>觸殺出局（Tag out）<br>野手使用持球的手套，或徒手拿球，碰觸未在壘包上的跑者，形成觸殺出局。<br>以下舉兩個比賽中常見的情境，幫助你更容易理解實際觸殺出局的過程。<br>盜壘出局<br>一壘跑者往二壘進行盜壘時，跑者在手碰到壘包之前，守備方游擊手，先一步接到球，並以手套觸碰到跑者身體，完成觸殺出局。<br>牽制出局<br>一壘跑者在撲回一壘之前，守備方一壘手，先一步接到球，並以手套觸碰到跑者身體，完成觸殺出局。<br>封殺出局（force out）<br>野手接球或持球的狀態下，比跑者早一步先碰觸到壘包，跑者都算是封殺出局。<br>以下影片為三壘手王威晨，接到內野滾地球之後，將球傳給一壘手許基宏，許基宏完成接球的時間，比打者張進德跑過一壘壘包，還要更快，所以完成封殺出局。<br>接殺出局（put out）<br>野手面對打者所打出來的球，無論球在界內或界外，球在還沒落地之前，野手使用手套或手把球接住，都算是接殺出局。<br>而當壘包上有跑者，又處於兩出局之前，出現高飛球被接殺時，跑者就必須完成再觸壘的動作，否則可能會被封殺出局。<br>以下舉兩個常見的情境，幫助你更容易理解實際接殺出局的過程。<br>高飛犧牲打<br>高飛犧牲打，打者擊出外野的飛球，被野手接殺出局，此時壘包上的跑者，趁機跑回本壘得分。<br>高飛犧牲打必須符合下面兩個基本條件：<br>•&nbsp;&nbsp;&nbsp;&nbsp;出局數：無人出局或一人出局<br>• &nbsp;&nbsp;&nbsp;跑者位置：二壘或三壘<br>以下影片為一人出局、三壘有人的情境。打者擊出左外野的界外飛球， 遭到左外野手接殺出局後，三壘上的跑者離壘起跑，跑回本壘得分，形成高飛犧牲打。<br>回壘不及<br>跑者在壘包上，都會進行離壘動作，而出現回壘不及的狀況，大多是遇到強勁平飛球接殺、戰術下達或跑壘失誤等等。<br>以下影片為一壘有人、一出局的情境。打者王威晨擊出投手面前的平飛球，遭投手江少慶接殺後、打者王威晨出局，再傳向一壘，封殺回壘不及的一壘跑者岳政華。<br>夾殺出局<br>壘上跑者處於「非」強迫進壘的狀態，守備方透過傳接球的配合，慢慢縮小與跑者之間的距離，最終使用觸殺的動作，完成夾殺出局。<br>以下舉三個常見的情境，幫助你更容易理解實際夾殺出局的過程。<br>牽制出局<br>跑者柯育民進行盜壘嘗試時，投手陳柏豪未將球投出，而是選擇回身進行牽制，跑者最後在壘包之間，遭到野手的夾殺出局。<br>跑壘失誤（瑕疵）<br>打者邱丹打向投手正面的反彈球，被投手猛威爾接到，壘上跑者朱育賢因跑壘判斷上的問題，導致最終在壘包之間，遭到野手的夾殺出局。<br>還有哪些出局方式呢？<br>除了前面所提幾個常見的出局方式，以下則相對較為少見。<br>•&nbsp;&nbsp;&nbsp;&nbsp;跑離三呎線（Line-out）<br>•&nbsp;&nbsp;&nbsp;&nbsp;促請裁決（appeal）<br>•&nbsp;&nbsp;&nbsp;&nbsp;妨礙守備（Interference）<br>•&nbsp;&nbsp;&nbsp;&nbsp;跑壘越位<br>•&nbsp;&nbsp;&nbsp;&nbsp;內野高飛球（pop fly）- 平時較常用內野高飛必死球來稱呼</p>', '6-1.jpg', '2022-10-08 09:09:05', '知識', '5', 1),
(6, '【棒球D教室】', '棒球出局規則介紹｜2023新手必懂的基本規則2', '<p>棒球比賽局數、出局數、比分的三角關係<br>棒球比賽一局打多久？<br>以中華職棒（CPBL）的規則來看，每一局並沒有時間上的限制，都是以「第三個」出局數出現後，才算是結束。<br>實際在比賽過程中，一局內，很快出現三人出局，不用 3 分鐘就結束了。<br>若遲遲第三個出局數還沒出現，那打了 30 分鐘，恐怕也都還沒結束。<br>以下影片的投手狂威只用了三顆球，就完成一局的投球局數，總共用不到兩分鐘。<br>逆轉比賽的機會<br>棒球比賽只要最後一個出局數還沒出現，就仍有逆轉比賽的可能性，這也是棒球運動迷人的因素之一。<br>以下影片為主場球隊富邦悍將，在第九局落後三分時，打者高國麟擊出滿貫全壘打、打回四分打點，幫助球隊逆轉拿下比賽勝利。<br>總教練決定了出局數如何使用<br>總教練的執教風格，關聯著球場上每個出局數的使用，尤其當壘包上有跑者時，更能從中看出差異性。<br>這裡以 2022 年中華職棒總教練，兩位帶隊風格相對有明顯差異的，分別為中信兄弟的林威助及味全龍的葉君璋。<br>林威助總教練，過去曾是日本職棒的球員，所以不難發現，無論在場上或場下的風格，都偏向於日式球風。<br>個人對於日式球風的印象，以團隊為主，戰術使用上較為頻繁，也選擇相對較為保守的戰術。<br>葉君璋總教練，過去曾是中華職棒的球員，在退下球員身分後，曾到美國小聯盟擔任教練一職，所以也不難看出，整體帶隊風格，更趨向於美式球風。<br>球員們在場上，會有更多的發揮空間。當要使用戰術時，更傾向於具侵略性打帶跑或盜壘的戰術。<br>若身為球迷的你，會比較喜歡哪一種的比賽模式呢？青菜蘿蔔各有所好，不論是什麼樣的球風，拿下最終的勝利，才是最重要的。<br>如何讓整支球隊透過平時的訓練及配合，在實際比賽中發揮最大的價值，才是總教練們的職責所在。<br>出局數的先後順序也有影響？<br>Timing play<br>Timing play 的使用情境，主要與下面四個因素有關：<br>•&nbsp;&nbsp;&nbsp;&nbsp;「非」強迫進壘。<br>•&nbsp;&nbsp;&nbsp;&nbsp;壘包上有兩位以上的跑者。<br>•&nbsp;&nbsp;&nbsp;&nbsp;第三個出局數產生時間。<br>•&nbsp;&nbsp;&nbsp;&nbsp;本壘是否得分。<br>實際比賽過程中，最常見的莫過於雙盜壘戰術，透過一壘跑者吸引守備方的夾殺，在出局之前，讓三壘的跑者，先一步踏回本壘得分。<br>逆向雙殺<br>常見的雙殺守備，都是透過封殺狀態，來完成出局數，除了能縮短守備時間之外，也讓野手在處理球上，更加的簡單。<br>逆向雙殺相對比較少見，在完成前一位跑者封殺時，第二位跑者必需使用觸殺的方式，才能抓到跑者，也增加了守備上的困難。<br>以下影片為一壘有人、一人出局時，打者王柏融擊出一壘前的彈跳球，一壘手高國慶接球後，順勢踩一壘壘包、先封殺打者，再將球傳到二壘，讓游擊手觸殺往二壘跑的跑者林智平。<br>野手接球後掉出手套，也算是出局？<br>接殺時掉球，算不算是出局呢？這得由裁判說的算。以棒球規則來看，若裁判認定掉球的動作為「第二動作」時，則算是接殺出局。<br>什麼是第二動作？可以把野手接飛球時，拆解成兩個動作，第一個動作為接球，第二個動作為傳球。<br>只要野手將球接進手套後，裁判認定野手是因準備進行「第二動作」時而掉球，那打者仍算是出局。</p>', '7-1.jpg', '2022-10-08 08:08:08', '知識', '5', 1),
(7, '【棒球D教室】', '棒球出局規則介紹｜2023新手必懂的基本規則3', '<p>棒球比賽出局數的價值\n記錯出局數\n球員記錯出局數的狀況，偶爾會在場上發生。</p><p>一場球賽時間至少 2.5 小時起跳時，球員出現專注力不足時，或多或少也是會發生。</p><p>\n但，當球員記錯出局數時，對於球隊的傷害，就可大可小了。</p><p>\n以下分別介紹進攻方及守備方，當球員記錯出局數時，會出現哪些問題吧！\n進攻方\n當進攻方的球員記錯出局數時，大概會有以下幾種狀況：\n	將出局數免費送給對手。</p><p>\n	跑者錯失再進壘的機會。</p><p>\n以下影片為一出局、一壘有人，打者唐肇廷擊出左外野飛球，遭左外野手詹子賢接殺，而原先在一壘的跑者林祐樂，疑似記錯出局數，完全沒有要回頭的意思，最後無法完成再觸壘而出局。</p><p>\n防守方\n當防守方的球員記錯出局數時，大概會下面幾種狀況。</p><p>\n	跑者可再往下一個壘包做推進。</p><p>\n	原先的雙殺守備，變成只讓一位跑者出局。</p><p>\n	出現原先不會失掉的分數。</p><p>\n以下影片為一人出局、一二壘有人，投手賴鴻誠把打者高國慶在一壘前觸殺出局後，因記錯出局數，以為已三人出局，而把球往界外區丟，讓三壘跑者林祖傑，趁機跑回本壘得分。</p><p>\n失誤對於出局數的影響\n棒球場上最常見的失誤，莫過於跑壘失誤及守備失誤這兩項，只要出現這些狀況，對於球隊都會造成傷害。</p><p>\n跑壘失誤的損失\n常見的跑壘失誤，像是跑壘越位、跑壘判斷及跑壘瑕疵等等，這些狀況的出現，都會讓球隊的進攻受到影響。</p><p>\n以下影片為一人出局、二壘有人，二壘跑者申皓瑋，面對迎面而來的滾地球，選擇往三壘前進，最終在三壘前被三壘手梁家榮觸殺出局。</p><p>\n這次的跑壘瑕疵，讓球隊從原先兩人出局、二壘有人的得點圈進攻機會，反倒變成兩人出局、一壘有人。</p><p>\n守備失誤的損失\n常見的守備失誤，像是接球失誤、傳球失誤、守備瑕疵等等，當出現這些狀況時，球隊就必須承擔一個壘包以上的損失。</p><p>\n以下影片為捕手林辰勳，處理內野滾地球時，出現傳球上的失誤，讓打者福來喜，原先應在一壘壘包前出局，反倒跑上了二壘壘包。</p><p>\n跑壘時應有的態度及行為\n當球場上球員跑壘態度不積極時，除了球員必須承擔自己犯的錯之外，球隊也會受到傷害。</p><p>損失再進壘的機會，甚至還可能因此讓安打，變成出局數，過去就', '6-2.jpg', '2022-10-08 07:07:07', '知識', '5', 1),
(8, '【棒球D教室】', '棒球電視重播輔助判決規則介紹｜2023新手入門必懂的基本規則1', '<p>前言\n電視輔助判決（Instant Replay），在許多的職業運動當中，都有在使用的一項技術。</p><p>透過回放的方式，進行慢動作重播，來降低裁判可能出現的誤判情形。</p><p>\n像是網球的鷹眼系統（Hawk-Eye），籃球的即時重播系統（Instant Reply System），都是相同概念的重播輔助制度。</p><p>而棒球的部分，也加入一樣的比賽制度。</p><p>\n這篇文章將與你介紹，關於棒球電視重播輔助判決的規定。</p><p>\n棒球電視輔助判決的規則介紹\n電視重播輔助判決的稱呼有哪些？\n棒球比賽中，在電視輔助判決的稱呼有下面這幾項，其實都是相同的意思，這當中又以「挑戰」的使用頻率最高。</p><p>\n	即時重播輔助判決\n	電視重播輔助判決\n	電視輔助判決\n	重播輔助判決\n	挑戰\n電視重播輔助判決的畫面回放\n中華職棒自 2021 年開始，比賽過程中，只要有進行電視重播輔助判決時，就會將回放的畫面，同步在球場大螢幕上播放，讓球隊及球迷們，都可以看到整個 Play 各種拍攝的角度。</p><p>\n透過這樣的方式，讓球場上的人員，不論是教練、球員及球迷，更加了解整個過程，在判決出爐前，心中也已經有個底了。</p><p>\n電視重播輔助判決次數\n依照 2022 年中華職棒在官方所提供的聯盟規章，每支球隊在正規九局的比賽中，會有「兩次」電視重播輔助判決的權力。</p><p>\n若球隊已將挑戰次數使用完，從第八局開始，裁判則有權力視比賽當下的攻防狀況，決定是否進行電視輔助判決。</p><p>\n另外，當比賽進入延長賽時，雙方球隊無論先前挑戰的次數還有多少，都會自動變成「一次」。</p><p>\n電視重播輔助判決由誰提出？\n球隊總教練。</p><p>\n提出電視重播輔助判決時，總教練會向裁判示意，用雙手手指畫出四角形的動作（像是電視機的外型）後，並將手指指向要進行挑戰的位置。</p><p>\n電視重播輔助判決有時間限制？\n有的。</p><p>\n棒球挑戰制度中有明確訂定，總教練提出電視重播輔助判決的時間限制，分別會出現下面兩種情況。</p><p>\n	裁判判決結束後，必須在「30秒」內提出挑戰。</p><p>\n	裁判判決結束後，若遇到換局（攻守交換）時，必須在 「10秒」 內提出挑戰。</p><p>\n至於為何要有時間上的限制？是為了讓整體比賽的節奏，不會因', '9-1.jpg', '2022-10-01 06:06:06', '知識', '5', 1),
(9, '【棒球D教室】', '棒球電視重播輔助判決規則介紹｜2023新手入門必懂的基本規則2', '<p>棒球電視重播輔助判決結果誰說的算？\n電視重播輔助判決成員有哪些？\n依照中華職棒聯盟規章所訂，電視重播輔助判決是由「即時重播檢閱小組」，針對總教練提出的挑戰，進行畫面回放檢視，確認攻防之間的過程。</p><p>\n而即時重播檢閱小組這群人，更常被用「小房間」來稱呼他們。</p><p>我想，這樣的說法，主要來自於他們所待的空間，所延伸的出來。</p><p>\n即時重播檢閱小組成員，一共有下面四位：\n	聯盟現場主管\n	技術委員\n	預備裁判員\n	現場裁判員（有必要才加入）\n電視重播輔助判決結果由誰決定？\n由即時重播檢閱小組的「技術委員」，決定最終的結果，再由場上的裁判進行判決動作。</p><p>\n電視重播輔助判決結果可以抗議嗎？\n不行。</p><p>\n經裁判在場上轉達技術委員所判定的結果之後，總教練不能再進行抗議的動作。</p><p>若持續在場上質疑判決結果，裁判則有權力將總教練趕出場。</p><p>\n賽後檢討的必要性？\n追求更高標準的原則下，有制度的進行檢討改善，是必要進行的。</p><p>\n目前公開的網路平台中，雖無法看到實際的規範，但相信中華職棒聯盟，內部有相關規範及機制，來確保並提升整體判決的準確性。</p><p>\n有時可能跟「人」有關係，像是規則、人員素質、訓練方式等等。</p><p>\n有時則會是「設備」的狀況，像是攝影機的數量、角度、解析度等等。</p><p>\n在完善的制度下，相信這些問題都可以被克服，進而維持比賽的公正性。</p><p>\n電視重播輔助判決應該看多久呢？\n依 2023 年中華職棒規定修正，重播輔助判決畫面，必須在四分鐘內作出裁定。</p><p>\n裁判在電視輔助判決的角色\n裁判在電視重播輔助判決的部分，主要負責下面這幾個項目：\n	接收總教練提出的挑戰\n	確認挑戰是否符合規定內的 16 項\n	公佈挑戰的結果\n	接收球迷的建議及指教…？\n挑戰的過程中，由即時重播檢閱小組將判決結果，透過無線電設備的方式，傳達給場上的裁判（使用耳機接收），再經由裁判公佈挑戰的結果。</p><p>\n負責執行這項任務的裁判，包括主審裁判及一壘審裁判。</p><p>\n所有重播輔助判決，都以主審裁判為優先，除非當下挑戰的項目與主審有關，那將會改由一壘審進行。</p><p>\n結論\n對於棒球重播輔助判決的規則，相信讓你有更進一步的認識了。</p><p>\n當你已經有在', '10-2.jpg', '2022-10-01 05:05:05', '知識', '5', 1),
(10, '【棒球D教室】', '棒球裁判規則介紹｜2023新手必懂的基本規則1', '<p>前言\n「你知道棒球場上裁判需要負責哪些工作嗎？」\n裁判（umpire），任何職業運動賽事中，必須存在的重要角色之一，而如何讓比賽能公平的進行，這就是他們在場上最重要的任務。</p><p>\n尤其在團隊球類的競賽中，裁判時常需要跟著球員，在球場上進行移動，無論是籃球、足球，又或是這裡所要提到的棒球。</p><p>\n每一次的判決，都考驗著裁判本身的執法功力，畢竟，球員們才是場上的主角。</p><p>\n這篇文章將與你簡單介紹棒球裁判，讓你對於裁判有基本的認知。</p><p>\n你心中的棒球裁判是什麼樣子？\n棒球裁判都做些什麼呢？\n確保比賽進行中的公正性，以及整理比賽前的比賽用球。</p><p>\n在比賽開始之前，裁判們會先針對當天準備使用的比賽用球，進行擦球的動作。</p><p>將「球」表面的蠟給磨掉，好讓比賽時，投手們能夠正常投球。</p><p>\n而最重要的部分，莫過於讓比賽能夠順利進行，以及在每一次的 Play 中，做出正確的判決，避免影響到比賽的公正性。</p><p>\n棒球裁判的稱呼有哪些？\n棒球場上的裁判，總共會有六個不同的位置。</p><p>而這些裁判所擔任的職稱，都是以比賽場地當中，相對應的位置，來命名的。</p><p>\n	主審（head umpire）\n	一壘審（1st base referee）\n	二壘審（2nd base referee）\n	三壘審（3rd base referee） \n	左線審（Left field referee）\n	右線審（Right field referee）\n棒球場上一共有多少位裁判？\n正常的棒球職業比賽，通常都是安排四位的裁判，包含主審、一壘審、二壘審及三壘審。</p><p>\n不論是美國職棒（MLB）、日本職棒（NPB），在中華職棒（CPBL）也是一樣裁判的人員配置。</p><p>\n為何場上裁判的人數會不太一樣呢？\n因應棒球比賽的規模、層級、比賽重要程度，調整場上比賽的人數。</p><p>除了前面所提到的四人制裁判外，其他比較常見的裁判人數，就是「三人制」及「六人制」。</p><p>\n那在什麼狀況下，會採取這些制度呢？\n三人裁判制\n以中華職棒（CPBL）為例，在中職二軍的比賽中，從 2020 年開始採用三人裁判制，來進行裁判人員的配置。</p><p>\n據官方說法，希望透過這樣的方式，來訓練裁判的站位及跑位，而這樣', '11-1.jpg', '2022-09-23 04:04:04', '知識', '5', 1),
(11, '【棒球D教室】', '棒球裁判規則介紹｜2023新手必懂的基本規則2', '<p>棒球電視輔助判決的出現\n中華職棒在 2014 年，開始啟用電視輔助判決的機制，降低出現誤判機的可能性，讓比賽回歸到最公平的起點。</p><p>\n有關電視輔助判決更完整的介紹及相關內容，都在下面的延伸閱讀。</p><p>\n成為一位棒球裁判需要具備的能力\n裁判也需要練體能？\n是的，棒球裁判的體能，是個人需要訓練及維持的基本功。</p><p>除了需要配合球場上攻防時的跑動，也需要應付一場比賽，至少 2-3 小時起跳的時間。</p><p>\n而，裁判並不像球員們，在攻守交換期間，能夠在休息區休息。</p><p>裁判們只有五局結束之後的中場休息，短短的五分鐘休息時間。</p><p>\n其餘時間都必須在場上，也是避免比賽時間被拉長。</p><p>\n良好的心理素質\n一句諺語形容裁判的角色：「有功無賞，打破要賠」。</p><p>\n這大概在所有職業運動場上，裁判都會遇到的考驗。</p><p>除了被要求百分百的精準判決之外，更需要承擔可能出現「誤判」時，排山倒海的批評與指教。</p><p>\n所以，如何調適自己心理的狀況，是擔任裁判相當重要的課題之一。</p><p>\n對於棒球的那股熱忱\n擔任棒球裁判，不就只是一份職業嗎？還需要對棒球有熱忱？\n從過去中華職棒的裁判分享，會選擇這份職業，有很大的原因來至於對於「棒球」的熱忱。</p><p>\n如果沒有這份熱忱支撐著，或許，這條路也不知道能夠走多久。</p><p>但，相信這份對於棒球的執著，讓他們願意在球場上付出，也對自己做出更高的要求。</p><p>\n棒球裁判如何考核、徵選與訓練？\n中職裁判的徵選辦法\n關於中華職棒（CPBL）裁判徵選的部分，主要資訊可以透過中華職棒官方網站及 CPBL 中華職棒的 FB 粉絲專頁找到。</p><p>\n有關棒球裁判徵選的測試、資格、薪資及相關規定，都能夠在這些公告的訊息內看的到。</p><p>\n以下影片為中華職棒裁判徵選的介紹。</p><p>\n中職裁判的考核制度\n藉由裁判考核的制度，來提升整體裁判的素質，也從中找出自己判決上的盲點，進一步做加強的動作。</p><p>\n但，相信部分的球迷，對於裁判的考核制度，還頗感興趣的。</p><p>尤其當裁判出現比較離譜的誤判時…，一副準備興師問罪的感覺。</p><p>\n不過，這方面的資訊，並沒有對外公開。</p><p>頂多只能從報章媒體雜誌了解到，中華職棒聯盟做了那些處置。', '11-2.jpg', '2022-09-23 03:03:03', '知識', '5', 1),
(12, '【棒球D教室】', '棒球裁判規則介紹｜2023新手必懂的基本規則3', '<p>進一步了解棒球裁判的管道\n書籍\n由台灣人所撰寫的棒球書籍，過去曾有少部分的球員或棒球主播，有寫過類似的書。</p><p>至於裁判的部分，就相當來的少。</p><p>\n目前市面上有關於中職棒球裁判的書籍，包括火眼睛經與0.4秒的判斷：【中華職棒鐵面裁判蘇建文的三千站場】及 SAFE&OUT。</p><p>【與自己對決的勇氣：那些棒球教我們關於挫敗與態度的故事】，都是由中華職棒的裁判所撰寫的。</p><p>\n至於其他書籍有提到裁判的部分內容，像是【聰明看棒球：一本讓你變成棒球達人的書】，以及思維誤判：【好球為何判壞球?冠軍總教練真的就是好教練?棒球場上潛藏的行為經濟學】。</p><p>\n但，這兩本書，僅有一部分提到棒球裁判。</p><p>整體書中的內容，較適合有棒球基礎概念的人來閱讀。</p><p>\n影音平台\n隨著中華職棒逐漸成長中，不少體育媒體或自媒體的部分，如 Youtube、Podcast 也開始針對不同的棒球主題，來製作相關內容。</p><p>\n以下影片為中職裁判蘇建文，分享過去擔任裁判時的過程及想法。</p><p>\n棒球場上的激情抗議\n鄭兆行「漏」踩壘包疑雲\n中華職棒 2003 年總冠軍戰G5，兄弟象 VS 興農牛，比賽來到四局下半、鄭兆行擊出左中外野、空檔的二壘安打，眼看就要幫球隊追回一分，並延續進攻的機會，卻因裁判認定漏踩一壘壘包，不僅安打被沒收之外，也被判出局。</p><p>\n當時並沒有重播輔助判決的機制，也因攝影機沒拍到鄭兆行繞過一壘壘包的全身畫面，讓這次的事件變成懸案。</p><p>\n對於非贏不可的興農牛而言，當然無法接受這樣的判決，在總教練陳威成上場抗議，與裁判爭執的過程中，出拳打了裁判。</p><p>\n林智勝「衝」撞裁判\n中華職棒 2008 年例行賽 G32，兄弟象 VS La new 熊，比賽來到九局下半、雙方平手，熊隊只要拿下一分，就能收下比賽的勝利。</p><p>\n在這個半局中，雖然有跑者上壘，卻因為兄弟象出現雙殺守備，讓熊隊只打了三個人次，就結束這個半局。</p><p>\n剛好，出局數都出現在一壘，對於場邊熊隊的林智勝而言，認為判決都是對熊隊不利，而因此衝出休息室，直接衝撞裁判。</p><p>\n事件發生後，大師兄原本要被無限期禁賽，差一點出現沒有可打的冏境，所幸最後改成禁賽 15 場。</p><p>\n朱鴻森「助」跑式打法\n中華職棒 2', '13-1.jpg', '2022-09-23 02:02:02', '知識', '5', 1),
(13, '【棒球D教室】', '職業棒球隊組成規則介紹｜2023新手必懂的基本規則1', '<p>前言\n「你知道一支棒球隊伍中，到底有多少人嗎？」為何在場邊休息區裡，有著這麼多沒上場比賽的人呢？\n這些人當中，有替補球員、教練、工作人員等等，都是在棒球比賽當中，不可或缺的一份子。</p><p>\n為什麼會有這麼多的替補球員，這也跟棒球規則的換人制度有關，需要足夠的球員，才能夠確保比賽的順利進行。</p><p>\n本篇文章將整理有關棒球隊組成的基本資訊。</p><p>\n棒球隊人數，應該要有多少呢？\n棒球隊應該要有多少球員呢？這個沒有正確答案，畢竟需要考量到各個不同層級及國家，都有不同的規範及設置，但基本上，球員的數量，並不會相差太遠。</p><p>\n接下來有關棒球隊人數的部分，將以中華職棒規則來進行介紹。</p><p>\n先發球員有多少人？\n現今職業棒球的賽場上，發展歷史比較悠久的國家，像是美國、日本、韓國等等，在先發球員的部分，基本上都是以 10 位為主，這其中包含一位投手，以及九位的打者。</p><p>\n一軍球員的人數限制\n中華職棒的一軍球員，人數限制是多少呢？「26人」。</p><p>\n包含前面所提到的先發 10 人，再加上板凳區的 16 位選手，總共是 26 人，這其中包含著投手及野手。</p><p>\n而在球員的分配上，教練團通常會考量整體戰力的狀況，來進行人員上的配置。</p><p>下面是參考目前各球隊選手安排的情形：\n	投手：11 – 12 人\n	野手：14 – 15 人\n二軍球員\n中華職棒的制度，區分為一、二軍，除了在一軍出賽的球員們，其餘選手都會在二軍進行比賽。</p><p>\n通常在二軍的球員們，有著許多不同的身分，但，這些球員若要在一軍進行比賽，就必須由球團完成「註冊」的動作，才符合中職聯盟的相關規範。</p><p>\n而，未註冊選手的身分，通常是合約球員、自主培訓、傷兵及測試洋將…等等，待球隊有需求時，才會進行球員註冊的動作。</p><p>\n球隊的球員上限是60人嗎？\n目前所了解到的 60人名單，是球隊在球季結束前，必須從現有的球員中，最多只能選 60 人進行註冊。</p><p>\n而在這 60 人名單之外的球員，其他球團是可以進行接洽的，或是遇到新球隊成立，就可能透過擴編選秀的方式，挑選球隊需要的球員。</p><p>\n過去未被放進 60 人名單的球員，多數是表現不佳，又或是處在傷兵恢復期間，等到新的一年，在敲定新的合約。</p><p>\n另外，6', '14-1.jpg', '2022-09-12 01:01:01', '知識', '5', 1),
(14, '【棒球D教室】', '職業棒球隊組成規則介紹｜2023新手必懂的基本規則2', '<p>球員上場比賽有哪些限制？\n何時可以在一軍出賽？\n以中華職棒來說，若要在一軍比賽的話，是必須登錄在球隊名單內的球員，才可以出賽。</p><p>\n而在球員調整的部分，則必須依照升降制度，來進行球員的異動。</p><p>這些球員異動的紀錄，中職官方都會進行公告，並註記異動原因。</p><p>\n中華職棒球員升降制度規定：\n	本土球員：下二軍須滿 10 天，才可再升到一軍\n	外籍球員：下二軍須滿 15 天，才可再升到一軍\n僅能在二軍出賽的球員\n在中華職棒二軍出賽的選手，除了有完成註冊的球員之外，其他也包含像是合約所屬、自主培訓、測試洋將等等的選手。</p><p>\n而在二軍比賽的球員，大多為具有潛力的新秀，透過二軍的比賽，來增強個人能力及觀念。</p><p>\n另外，少部分的資深球員或傷兵，則會在二軍的比賽中，進行個人調整或復健的動作，最終都是以能到一軍比賽為目標。</p><p>\n註冊註銷\n註冊，每位球員在單一球季中，僅能進行一次的註冊，註冊後才能夠獲得在一軍出賽的機會。</p><p>若進行「註冊註銷」的動作後，這個球季接下來的比賽，就只能在二軍度過了。</p><p>\n大多數球員，球隊都會在球季開始前就完成註冊，僅有少部分的球員，才會視例行賽的球隊戰力，視情況註冊使用。</p><p>而相關資訊，也能夠到中華職棒官方，查到相關到球員訊息。</p><p>\n中華職棒洋將的影響力？\n對於亞洲區域的棒球運動來說，外籍洋將的存在，不論在平時的例行賽，又或是在準備爭冠的總冠軍賽，都是球隊相當重要的戰力。</p><p>所以各個球隊在洋將的能力要求，也相對比較高。</p><p>\n有關更多洋將制度的介紹，可以參考下面的延伸閱讀。</p><p>\n棒球隊的源頭\n支撐起球隊的一切\n「你覺得要經營一支球隊，最重要的是甚麼呢？」除了這項運動要有市場之外，我想，最重要的莫過於出錢的球團了。</p><p>\n球團不僅是出錢的那一方，若以商業的角度來看，無疑是希望對於企業本身有加分的效果，當然，也包含著賺錢的部分。</p><p>（雖然經營中華職棒的球團，基本上都是在燒錢…）\n中華職棒從 1990 年開始，經歷過風光期，也走過黑暗期，如今，開始有點撥雲見日的感覺。</p><p>\n尤其在中華職棒的各個球隊，慢慢地由不同的大企業接手經營，相信在更多的資源下，以及不一樣的經營思維，有助於整體台灣的棒球發展。</p>', '14-2.jpg', '2022-09-12 11:01:01', '知識', '5', 1),
(15, '【棒球D教室】', '中華職棒年度個人獎項｜2023新手必懂的基本規則1', '<p>前言\n任何競技運動的賽場上，選手們不僅為了最終的優勝在努力，也為了讓自己在這個舞台上，展現出更佳的表現，而必須嘗試突破，取得更理想的成績。</p><p>\n在棒球運動中，設置了許多關於球員個人成績的獎項，藉此肯定球員們的表現，也記錄下這些應該被記住的光榮時刻。</p><p>\n本篇文章將整理有關中華職棒年度獎項的規定。</p><p>\n中華職棒的年度個人獎項有哪些呢？\n中職有哪些年度獎項呢？\n中華職棒大聯盟（CPBL）所有的年度獎項中，有區分打者、投手各自的獎項，也有投手與打者一同競爭的獎項，目前總共有 17 種不同類型的年度獎項。</p><p>\n年度獎項代表的意義？\n絕大部分的獎項，都能夠透過可量化的數據，來決定表現最為優異的球員，也意味著選手們球場上的努力，是容易被看見的。</p><p>\n而有少部分的獎項，則必須由採訪媒體，來進行投票選出，雖然難免會有各自喜好的差別，但能夠入圍這些獎項，也是間接肯定這些球員在這個球季，有著不錯的表現內容。</p><p>\n多久頒獎一次呢？\n每年。</p><p>在球季結束之後，中職聯盟會另外安排年度獎項的頒獎典禮。</p><p>基本上各個年度獎項，都會有得獎者，除了出現比較特殊的情況，獎項才會出現空缺的情形。</p><p>\n未來有機會出現其他獎項嗎？\n以中華職棒的歷史及發展來看，未來是有機會出現其他的獎項。</p><p>或許可以參考棒球歷史較為悠久的美國大聯盟（MLB）及日本職棒（NPB），部分年度獎項，是針對過去偉大的球星，所特別設置的。</p><p>\n中華職棒年度個人打者獎項\n打者獎項 – 安打王\n安打王，在單一球季中，打出最多安打的球員。</p><p>如出現兩位以上球員在安打數相同時，會先比較「打數較少」的部分，若再相同，最後才會看「壘打數較多」，來決定當年度的安打王。</p><p>\n過往比賽當中，具有這樣安打能力的選手，多半會被安排在球隊的開路先鋒或是中心打者。</p><p>\n中華職棒安打王基本介紹：\n	安打王獎項設立時間：1994 年\n	安打王獎金：8 萬元\n打者獎項 – 打擊王\n打擊王，在單一球季中，打擊率最高的球員。</p><p>如出現兩位以上球員在打擊率相同時，會先比較「打數較少」的部分，若再相同，最後才會看「打點較多」，來決定當年度的打擊王。</p><p>\n過去比賽當中，打擊能力較佳的球員，基本上會優先放在中心', '16-1.jpg', '2022-09-09 12:12:12', '知識', '5', 1),
(16, '【棒球D教室】', '中華職棒年度個人獎項｜2023新手必懂的基本規則2', '<p>中華職棒年度個人投手獎項\n投手獎項 – 勝投王\n勝投王，在單一球季當中，勝場數最多的球員。</p><p>如出現兩位以上球員在勝場數相同時，會先比較「防禦率較低」的部分，若再相同，最後才會看「勝率較高」，來決定當年度的勝投王。</p><p>\n能夠拿下最多勝的投手，不僅自身要有不錯的投球能力，還需要靠著隊友的情義相挺，才有機會一場接著一場、拿下勝投。</p><p>\n中華職棒勝投王基本介紹：\n	勝投王獎項設立時間：1990 年\n	勝投王獎金：10 萬元\n投手獎項 – 奪三振王\n奪三振王，單一球季當中，投出最多三振的球員。</p><p>如出現兩位以上球員在奪三振數相同時，會先比較「投球局數較少」的部分，若再相同，最後才會看「面對打席數較少」，來決定當年度的奪三振王。</p><p>\n投手能否成功三振掉打者？主要還是要看投手本身的能力及投球特性，來決定最終能否三振打者的關鍵因素。</p><p>\n中華職棒奪三振王基本介紹：\n	三振王獎項設立時間：1994 年\n	三振王獎金：8 萬元\n投手獎項 – 防禦率王\n防禦率王，在當一球季當中，防禦率最低的球員。</p><p>如出現兩位以上球員在防禦率相同時，會先比較「勝場數較多」的部分，若再相同，最後才會看「勝率較高」，來決定當年度的防禦率王。</p><p>\n投手個人防禦率的高低，主要還是取決於個人的投球能力，不過在團隊守備能力，多少也是會影響著這項數值。</p><p>\n中華職棒防禦率王基本介紹：\n	防禦率王獎項設立時間：1990 年\n	防禦率王獎金：10 萬元\n	防禦率王投球局數：投球局數 ≧ 球隊出賽數\n投手獎項 – 救援王\n救援王，在單一球季當中，救援成功次數最多的球員。</p><p>如出現兩位以上球員在救援成功次數相同時，會先比較「防禦率較低」的部分，若再相同，最後才會看「勝率較高」，來決定當年度的救援王。</p><p>\n救援成功次數的多寡，不僅投手本身要在關鍵時刻，替球隊守下有限的分數領先，也倚賴著球隊整體戰力，能否創造出這些救援成功的機會。</p><p>\n中華職棒救援王基本介紹：\n	救援王獎項設立時間：1990 年\n	救援王獎金：10 萬元\n投手獎項 – 中繼王\n中繼王，在單一球季當中，中繼成功次數最多的球員。</p><p>如出現兩位以上球員在救援成功次數相同時，會先比較「防禦率較低」的部分，若再相同，最', '16-2.jpg', '2022-09-09 13:13:13', '知識', '5', 1),
(17, '【棒球D教室】', '棒球投手規則介紹｜2023新手必懂的基本規則1', '<p>前言<br>「你知道棒球比賽當中，哪位球員對於比賽的勝負，影響力是最大的呢？」<br>這個問題沒有標準答案，當場比賽結束後，總會有一位獲選單場 MVP 的球員，凸顯他對這場比賽的貢獻。<br>但，過去有不少的球員及球評都曾說過，「投手佔了一場比賽勝負的七成」。<br>尤其是在先發投手的位置，若能有精彩的投球表現，球隊贏球的機會將會大增。<br>不過，投手要把一場比賽投好，真的有這麼容易嗎？想把球投到哪個位置，球就乖乖進到捕手的手套呢？<br>真的有看過棒球比賽後，或許你就會有不同想法了。<br>本篇文章將用淺顯易懂的方式，來說明棒球投手在場上的投球狀況。</p><p><br>棒球投手有哪些是你該懂得規則呢？<br>投手（Pitcher），球隊在擔任守備方最核心的球員之一，必須負責棒球比賽當中，重要的「投球」任務。<br>投手在投球的過程中，必須要有個守備員來幫忙接球，那個人就是「捕手」。除了接球之外，在投球位置及球種的選擇上，也要協助投手給予建議。<br>不論怎麼投手怎麼投，最終的目的，就是讓打擊區上的打者，在安全踏上一壘壘包前，讓他出局。</p><p><br>投球是什麼？<br>棒球比賽的過程中，擔任守備方的投手，必須站在投手丘上，把手中的球朝向捕手的方向丟，這就稱之為「投球」。而進攻方的打者，就必須去判斷當下的球，適不適合進攻。<br>而每位投手也都有各自擅長的球種及能力，下面有幾個常用來形容投手的投球能力。<br>•&nbsp;&nbsp;&nbsp;&nbsp;投球控球 – 投手把球丟到想丟的位置，對於投手來說，是必須具備的投球能力之一。<br>•&nbsp;&nbsp;&nbsp;&nbsp;投球球速 – 投手的投球速度越快，代表打者反應的時間越短，容易出現揮空棒的情形。<br>•&nbsp;&nbsp;&nbsp;&nbsp;投球威力 – 投手投出的球，變化軌跡讓打者不容易打到球的甜蜜點。</p><p><br>內野區的小山丘<br>投手丘（Pitcher’s mound），提供投手在進行投球時，所站的地方，設置在內野四個壘包的正中間。<br>看似不起眼的投手丘，其實也會對投手的投手表現，有所影響。過去就曾聽過投手反應，投手丘踩起來有比較鬆軟的情形。另外若因場地下雨時，也可能出現打滑的狀況。</p><p><br>投手丘的中心點<br>投手板（Pitcher’s plate），設置在投手丘上一塊長方形的白色平板，用來規範投手在投球時，所要站的位置。<br>當投手腳踩在投手板時，就必須依照棒球規則，進行投球的相關動作，否則是有可能會被抓投手犯規的喔。<br>投手熱身的 VIP 空間<br>投手在上場比賽前，都會現在專屬的區域，進行上場前的投球熱身。而這個空間，通常會以「牛棚」的方式來稱呼。<br>牛棚（Bull pen），除了用來形容投手熱身的場地之外，也會用來稱呼後援投手的這群人為「牛棚投手」。</p><p><br>牛棚長得不太一樣<br>台灣各個球場的牛棚設置，其實都不太一樣，隨著球場整體規劃變動，部分的牛棚位置，也陸續做調整。<br>像是有室內牛棚、室外牛棚、甚至有些球場的空間有限，只能運用棒球場上的界外區場地，規劃出投手熱身的區域。<br>以下影片為投手在室內牛棚練投。</p><p><br>你的慣用手是哪隻呢？<br>右手，還是大多數人的慣用手，這對於棒球場上的球員們，也是一樣的情形。但為了在棒球場上，獲得更多的個人優勢，部分球員會選擇訓練左手，變成投球或打擊時的慣用手。</p><p><br>投手與打者的正面對決<br>棒球比賽中，進攻及防守的雙方，可以簡單區分為安全上壘及出局，兩個結果。對於守備方來說，就必須盡可能地抓到出局數，來降低失分的狀況。<br>這裡舉幾個比賽中，能夠安全上壘及出局的常見例子。<br>•&nbsp;&nbsp;&nbsp;&nbsp;上壘 – 安打、保送、守備失誤、野手選擇。<br>•&nbsp;&nbsp;&nbsp;&nbsp;出局 – 三振、飛球接殺、滾地球刺殺。</p><p><br>好壞球的判定依據？<br>好壞球的判定，是由本壘板延伸出來的一個 3D 立體空間，只要投手的球有碰出到，都應該判定為好球。<br>而這個空間，其實是看不到的。但現今在棒球比賽轉播時，捕手正前方就會顯示出一個白色的長方形框框，可以讓收視球賽的球迷們，作為好壞球判定的參考。<br>好球與壞球的差別，不論是對於投手或是打者，都有著不小的影響。棒球規則上，是有規範好球帶的空間，但畢竟好壞球是由主審裁判來做判定，所以還是會有些個人喜好及誤判出現。<br><br>投手犯規會被驅逐出場嗎？<br>一般投手所出現的投手犯規，基本上只會讓壘上的跑者，直接往下一個壘包做前進，並不會有驅逐出場的問題。<br>投手犯規（BALK），當投手踩在投手板時，就準備進入到投球的階段，所有動作就必須符合棒球規則，只要違反，就會被裁判判定為投手犯規。<br>而投手犯規的部分，需要先符合下面兩個最基本的條件，才會有後續出現的投手犯規可能。<br>•&nbsp;&nbsp;&nbsp;&nbsp;壘包上有跑者。<br>•&nbsp;&nbsp;&nbsp;&nbsp;投手已踩在投手板上。</p><p><br>球場上的白色粉末<br>為何投手在準備投球前，都會拿著一包白色粉袋，正手拍完、反手拍，拍出一堆粉末呢？<br>這個是松香粉袋，在棒球場上比較常用「止滑粉」來稱呼。主要提供投手投球時，避免手汗過多的情形，影響到投球的狀態，所以這些白色粉末，是用來止滑用的。<br>而使用上也是有相關規範，像是只能使用在手上，不能塗抹在其他的部位。至於塗抹的量就沒有明文規定，主要比較偏向裁判的自由心證。<br><br>投手牽制的細節<br>在棒球場上，投手透過傳球的方式，看管壘包上的跑者，主要是為了縮小跑壘的離壘距離，來降低盜壘成功的機率，這就是所謂的「牽制」。</p>', '18-1.jpg', '2022-09-03 14:14:14', '投球', '2', 1),
(18, '【棒球D教室】', '棒球投手規則介紹｜2023新手必懂的基本規則2', '<p>今日該誰上場投球？\n早期，各球隊幾乎都會有自己的王牌投手，而他在球隊的地位，是無比的重要。</p><p>不僅能夠擔任先發投手的角色，把整場比賽投完，還能在球隊需要他時，在其他比賽的中後段，上場投球。</p><p>\n但隨著時代的演變，目前幾乎已看不到這樣使用投手的方式。</p><p>最主要考量投手過度使用及休息恢復時間不足，容易出現受傷的狀況。</p><p>\n所以現今的投球趨勢，已經把每位投手的投球任務細分，除了讓投手在場上有更好的發揮之外，也能降低過勞所產生的後遺症。</p><p>\n先發投手（tarting Pitcher）\n先發投手，在投手群之中，扮演著最重要的投球角色任務。</p><p>擔任球隊打頭陣的投手，不僅要負責比較多的投球局數，自然而然在投球的數量及個人體力上，也會有更高的需求。</p><p>\n因應各個職棒聯盟的比賽頻率及次數不同，各有各的投手使用參考基準。</p><p>分享 Degio 過去曾看過的資訊：\n	美國職棒（MLB）：投一場比賽，休息四天，投球數 100 球\n	日本職棒（NPB）：投一場比賽，休息六天，投球數 120 球\n在這樣用球數控制的前提下，進一步來保護先發投手的身體，避免過勞產生其他問題。</p><p>\n以下影片為先發投手，主投 8 局的投球局數，用球數 99 球後退場休息。</p><p>\n後援投手（Relief Pitcher）\n後援投手，也有人稱之為「牛棚投手」。</p><p>棒球場上，除了先發投手以外，其他投手都被歸類在後援投手的部分。</p><p>\n而這些牛棚投手，出賽頻率就會比先發投手要來的多，也因為隨時都有可能需要上場投球，相對在用球數及投球局數，則會比較少一些。</p><p>\n以下影片為後援投手上場投球的狀況。</p><p>\n中繼投手（Middle relief pitcher）\n中繼投手，除了先發投手及終結者以外的投手群，都會被歸類在中繼投手，與後援投手的意思有些雷同。</p><p>\n佈局投手（Setup Man）\n佈局投手，用來稱呼後援投手的一種方式。</p><p>最主要球隊在分數領先時，第八局上場的投手，本身的投球能力，僅次於第九局上場的終結者。</p><p>\n救援投手（Closer）\n救援投手，較常用「終結者」或「守護神」來稱呼，是所有後援投手當中，投球能力最強的一位投手。</p><p>\n終結者的上場時', '18-2.jpg', '2022-09-03 15:15:15', '投球', '2', 1),
(19, '【棒球D教室】', '棒球投手規則介紹｜2023新手必懂的基本規則3', '<p>投手的基礎數據\n棒球場上有許多不同的數據，從投手的每一顆球、打者的每一次揮棒，到守備方每一次的守備，都記錄著場上的相關數據。</p><p>\n而對於投手的每一項數據，都代表著不同的意義，藉此來衡量投手的投球能力。</p><p>\n投球局數（innings pitched）\n投球局數，簡稱 IP。</p><p>棒球場上出現的每一個出局數，都會算是投手的投球局數，也是用來衡量投手對於球隊貢獻的數據之一。</p><p>\n對於不同位置的投手，所要求的投球局數也會有所不同。</p><p>而這些主要是用來參考的基準，實際上還是需要依場上的狀況，來進行投手的調度使用。</p><p>\n	先發投手 – 以六局為基準。</p><p>\n	後援投手 – 以一局為基準。</p><p>\n總投球數（Number of Pitches Thrown）\n總投球數，簡稱為 NP。</p><p>平時主要以「用球數」來稱呼，當投手的用球數來到相對高點時，投手教練就差不多就會讓場上的投手，準備下場休息。</p><p>\n紀錄投手的用球數有什麼用處呢？主要讓教練團了解投手的投球狀況，以及用球數的情形，進一步來調整並規劃接下來比賽，上場的時間。</p><p>\n至於投手在一局內的理想用球數是多少呢？過去曾看比賽播報時，賽評提到一局的用球數，盡量控制在 15 顆以內，會比較理想一些。</p><p>\n而這樣的用球數，對於不同位置的投手來說，其實也是有著不同的含意。</p><p>\n	先發投手 – 每局用球數減少的情形下，相對能增加投球的局數，進而減少牛棚投手的負擔。</p><p>\n	救援投手 – 在有限的用球數內，能夠投出高品質的球。</p><p>\n好球（Strike）\n如何投出一顆好球，對於一位投手來說，大概是擔任投手時，最重要的課題之一。</p><p>不論是把球投進好球帶，或是投出引誘球讓打者出棒揮空，都考驗著投手本身的投球能力。</p><p>\n過去在看比賽時，也常聽到球評針對好球率的看法做說明。</p><p>好壞球的比率來到 2：1，會是比較理想的。</p><p>\n三振（strike out）\n三振，常用英文字母「K」來形容。</p><p>投手對打者投出第三顆好球，就會直接讓打者站在原地出局，連跑壘的機會都沒有。</p><p>\n投手要三振打者的前提，必須是在「兩好球」的情形下。</p><p>在比賽過程中，', '18-1.jpg', '2022-09-03 16:16:16', '投球', '2', 1),
(20, '【棒球D教室】', '棒球打者規則介紹｜2023新手必懂的棒球規則1', '<p>前言<br>棒球世界裡，打者是扮演著什麼樣的角色呢？單純只要打到球就可以了嗎？還是打擊時必須全力揮擊，把球打到全壘打牆之外呢？<br>過去曾多次聽「棒球人」說，對於打者來說，棒球是個高失敗率的運動，只要在 10 次的打擊當中，3 次有好表現，那就是一位稱職的打者了。<br>在棒球場上的投手與打者對決中，投手基本上掌握著主導權，能夠選擇投球的球種及節奏。<br>而打者就屬於被動的那一方，在投手手上球出手的剎那間，必須做出判斷，要進行揮棒或是不揮棒。<br>本篇文章將用淺顯易懂的方式，來說明棒球打者在場上的狀況。</p><p><br>對於棒球打者的基本認知<br>擊球員（BATTER），大多在比賽過程中，都是用「打者」來稱呼。<br>在球隊擔任進攻方，打者需要按照比賽前所排定的順序，依序上場與投手進行投打對決，想辦法將投手所投出的球，進行有效的打擊。<br>目標是讓對方守備員，無法在第一時間有效地進行守備的傳接球，創造出安全站上壘包的機會，讓球隊能夠拿到更多分數。<br>打擊是什麼？<br>擔任進攻方的打者，站在打擊區時，需要面對投手投過來的球，進行揮棒的動作，就稱之為「打擊」。<br>每位球員都有各自不同的打擊能力、習慣及準備動作等等，這些也都會因應球員的身體素質，而會有所不同。<br>•&nbsp;&nbsp;&nbsp;&nbsp;體型及力量佳 – 打擊揮動球棒時，選擇全力揮擊，追求長打、甚至是全壘打。<br>•&nbsp;&nbsp;&nbsp;&nbsp;體型及力量小 – 打擊揮動球棒時，選擇擊中球心，以安打上壘為主。</p><p><br>打者揮棒指是指？<br>棒球揮棒的部分，是指打者雙手握住球棒，去揮擊投手所投出的球。就好像高爾夫球選手，拿著高爾夫球桿，進行揮桿的動作，又或是網球選手，拿著網球拍，進行揮拍的動作。<br>打者需要站在白色框框內<br>打者在上場進行打擊時，需要站在所謂的「打擊區」裡。打擊區是由兩個白色長方形的框框所組成，會在本壘板的左右兩側。打者可以選擇其中一邊，來進行打擊。<br>而在進行打擊時，投手與打者已經就定位後，那打者的兩腳都必須站在打擊框裡面，才符合棒球的相關規則。<br>打擊區尺寸：大小為 6 英尺（1.8 公尺）長、3 英尺（0.9 公尺）寬。<br>打擊預備區的用途？<br>球隊在進攻時，打擊區上都會有當前打擊的球員，而下一位準備上場打擊的選手，就會在打擊預備區，進行揮棒熱身的動作。<br>而打擊預備區的位置，會設置在雙方球隊休息區的前方，大多是以圓形框框來呈現。</p><p><br>打擊前要做哪些準備呢？<br>打者上場打擊前，都會先在打擊預備區揮棒熱身後，再上場進行打擊。而打擊預備區有提供哪些工具給球員呢？<br>打擊預備區，通常會放兩種類型的工具， 一個是熱身用的加重環，另一個則是止滑劑。<br>•&nbsp;&nbsp;&nbsp;&nbsp;加重環 – 打者熱身揮棒時，球員會在球棒套上加重環，來進行熱身的動作。<br>•&nbsp;&nbsp;&nbsp;&nbsp;止滑劑 – 打者在上場打擊之前，會使用止滑劑（止滑噴膠）或止滑膏，噴塗在球棒上，避免打擊時，球棒從手中滑落。<br>以下影片為防滑噴膠的介紹。<br>打擊姿勢的區別<br>打者進行打擊時，會有各自的慣用手，來區分為左手打擊，或是右手打擊。<br>也有左右手都可以進行打擊的球員，這種打擊型態被稱為「左右開弓」，但這類型打者在現今職業棒球裡，已經是相當少見了。<br>以下影片介紹過去中華職棒少數幾位左右開弓的打者。</p><p><br>左打跟右打有什麼差嗎？<br>你覺得左打跟右打有什麼差別嗎？看起來好像差不多，不就只是慣用手不同，以及站的位置不同嗎？<br>但實際在比賽場上，站在左打的打擊區及右打的打擊區，還是有差別的。<br>當打者把球打出去之後，目標都是衝向一壘時，那相對左打所站的位置，就會比右打的位置，要來的更靠近一壘。<br>舉兩個常見的例子，來凸顯左打所存在的優勢。<br>•&nbsp;&nbsp;&nbsp;&nbsp;一壘壘包距離 – 左打者相較於右打者來說，離一壘壘包的距離比較近，也有利於縮短跑壘的距離。<br>•&nbsp;&nbsp;&nbsp;&nbsp;右投的投手較多 – 右投投手的人數，普遍比左投投手要來的多。而左打在面對右投的部分球種，能夠有更好的判斷，就如滑球的軌跡。<br>以下影片的第二位打者為左打，靠著突襲短打的方式，跑出內野安打。</p><p><br>球打出去之後的結果？<br>通常打者在與投手進行投打對決，簡單區分兩種結果。一個是打者安全站上壘包，另一個則是打者出局。<br>這裡舉幾個上壘及出局的常見例子。<br>•&nbsp;&nbsp;&nbsp;&nbsp;上壘 – 安打、保送、守備失誤、野手選擇。<br>•&nbsp;&nbsp;&nbsp;&nbsp;出局 – 三振、飛球接殺、滾地球刺殺。</p><p><br>什麼樣的球算是安打？<br>打者所打出去的球，不論是在地上滾的滾地球，還是在天上飛的飛球，只要守備員無法在第一時間接殺，或是傳向一壘，讓打者出局，那應該都算是安打吧？<br>只要球先落地的狀況，基本上都會被判定安打，但必須扣除掉對方守備失誤的部分。</p><p><br>安打由誰來認定？<br>安打是由比賽中的紀錄組人員來認定，依照棒球規則及場上的實際狀況，來判斷球員最終的打擊結果。<br>若有看球一段時間，就會知道哪些球是安打、哪些球是守備失誤。當介於這兩個選擇之間時，那就很有可能會與你向的結果，有所不同。<br>而球場上實際的狀況，就可能包含天候狀況（陽光）、場地積水（下雨）等等，都會左右著紀錄組的判決。<br>以下影片為外野手準備接球時，卻因天色及燈光影響，一時之間找不到球，導致球落地變成安打。</p><p><br>好壞球的影響？<br>棒球比賽中，好壞球都是由主審來判定。對於投手或打者來說，每一顆好壞球的判定，都會影響接下來投手的配球選擇，以及打者的打擊選擇。<br>不就只是好壞球的差別，真的有這麼大的差別嗎？其實在一來一往之下，會出現不小的影響。<br>舉個常見的比賽情境。球數在一好兩壞的情形，下一球是好球或壞球，對於打者或投手有甚麼差別呢？<br>•&nbsp;&nbsp;&nbsp;&nbsp;好球（兩好兩壞）– 投手略佔上風。打者必須在兩好球後，適時放大自己的好球帶，避免在好球帶邊緣的球，被主審判定為好球而三振出局。<br>•&nbsp;&nbsp;&nbsp;&nbsp;打者在好球帶放大的情形下，就有可能被投手的引誘球給騙到，而選擇進行揮棒。<br>•&nbsp;&nbsp;&nbsp;&nbsp;壞球（一好三壞）– 打者略佔上風。投手若投壞球，就有可能會變成四壞球保送，所以打者在這樣的球數下，縮小自己的好球帶，或是設定球種進行攻擊，來增加安打的機率。<br>•&nbsp;&nbsp;&nbsp;&nbsp;投手為了避免保送的出現，那就可能選擇控制力比較佳的球種，像是直球。</p><p><br>捕手手套碰到球棒了！<br>棒球比賽中，投手在投出球的瞬間，打者必須判斷是否該揮棒，而捕手則是進行接球的動作。<br>那如果打者揮棒時，卻打到捕手伸出來接球的手套，那該怎麼算呢？通常這種時候，就會適用於棒球規則裡的「妨礙打擊」，打者是保送的狀態，可以直接站上一壘壘包。<br>所以捕手在接球時，手套伸出來的位置，必須做好控制，也不能超過本壘板上方，否則影響到打者揮棒時，會被判定為妨礙打擊。<br>以下影片為打者在揮棒過程中，因捕手手套伸太出來，而影響到打者打擊，直接保送一壘。</p><p><br>打擊順序的安排<br>棒球比賽當中，先發球員一共 10 人，有 9 位打者、加上 1 位的投手，除了投手不用上場打擊之外，其餘的球員都需要擔任打者的任務，依排定的順序、上場打擊。<br>假設第一局的進攻，若打到第三棒結束，那第二局輪到進攻時，就是由第四棒為第二局的首名打者，以此類推…。<br>而球隊中的每位打者，各有不同的打擊能力及特色，教練團會依據這些資訊，來排定球員擔任的打擊棒次。<br>為何他不用上場守備？<br>棒球場上，不需要進行守備任務，只需要上場打擊的打者，稱之為指定打擊（Designated hitter），通常會用 DH 來做簡稱。<br>通常會被安排在指定打擊的位置，都是打擊能力較佳的選手，而在守備方面，就會相對來的弱一些。比較常見到球隊陣中的資深，又具有一定打擊實力的球員，來擔任指定打擊的角色。<br>以下影片為球隊中，具有較佳打擊能力選手，擔任指定打擊的角色。</p><p><br>第一棒該由誰來打呢？<br>球隊在第一棒球員的安排上，大多會選擇上壘機率高，以及跑壘速度快的選手，擔任球隊在進攻時，開啟攻勢的重要角色。<br>主要是希望靠著高上壘率，站上壘包之後，能夠靠著跑壘速度，盜上二壘。或是靠著接下來打者所打出的安打，提升再往下一個壘包前進的機會。<br>「開路先鋒」常用來稱呼第一棒打者。平常會從比賽轉播當中，或是文章報導等，看到這樣的用詞，來形容第一棒的打者。<br>以下影片為過去中華職棒四支球隊的開路先鋒，各個球員的能力分析。<br>打擊最強的棒次<br>你知道球隊棒次安排上，打擊能力最強的球員，會被排在第幾棒嗎？是第四棒，必須具有優異的打擊技巧之外，也需要具備長打能力，能把在壘上的隊友們，有效的送回本壘得分。<br>在第四棒前後的棒次，也相當的重要，基本上也都是僅次於第四棒的打擊能力。而這三個棒次，3、4、5 棒，平常會使用「中心打者」或中心棒次來稱呼，屬於球隊最核心的打者。</p><p><br>關鍵一擊的時刻<br>第一棒到第九棒之中，總會有些打擊能力較弱的球員，所以到了比賽中後段時，就會需要打擊能力較佳的球員，上場進行打擊，就是所謂的「代打」。<br>代打（pinch hitter），球隊的替補球員，配合教練的調度，上場進行打擊的任務。</p>', '21-1.jpg', '2022-08-26 17:17:17', '打擊', '1', 1),
(21, '【棒球D教室】', '棒球打者規則介紹｜2023新手必懂的棒球規則2', '<p>棒球打者的基礎數據\n打席（Plate Appearances）\n打者每一次走上打擊區、進行打擊，不論最終結果是上壘或是出局，都會計算一次的打席。</p><p>\n除了用來計算打者上過幾次打擊區之外，也會用來評估其他打擊獎項。</p><p>像是年度打擊王的部分，就必須符合打席數的要求，才有資格競爭這個獎項。</p><p>\n打數（at bats）\n打數跟打席看起來很像，但卻有一點點的不一樣。</p><p>而打數在計算時，必須扣除下面幾個項目。</p><p>\n	保送\n	犧牲短打\n	高飛犧牲打\n	妨礙打擊\n為何要扣掉這些項目呢？對於打者來說，這些打擊結果，對於球隊都是有幫助的，所以才必須扣掉。</p><p>另外在打者的打擊率，就會使用到打數當作分母來計算。</p><p>\n打點（run batted in）\n打者在場上完成一次的打擊，不論是靠著安打、全壘打，又或是在滿壘時獲得保送，只要把壘包上的隊友送回來得分時，就會算是打者的打點成績，一分回來算一打點，兩分回來算兩打點。</p><p>\n但出現雙殺打或守備失誤，回到本壘得分的分數，就不會算是打者的打點成績，僅會把分數加在球隊的計分板上。</p><p>\n得分（RUN OR SCORE)\n跑者必須依序跑完四個壘包，從一壘、二壘、三壘、最終安全的回到本壘，才能夠幫助球隊得到分數。</p><p>\n除了靠著全壘打能夠直接跑四個壘包回來得分，其餘得分的方式，都要透過團隊的配合，無論是安打、保送、戰術等等，打者有發揮之外，壘上跑者的跑壘技巧也相當重要。</p><p>\n以下影片為壘包上的兩位跑者，靠著隊友擊出的安打，順利跑回本壘得分。</p><p>\n安打（hits）\n安打，對於進攻方最重要的進攻方式，佔據了絕大多數得分的關鍵。</p><p>在安打的形式區分為一壘安打、二壘安打、三壘安打及全壘打。</p><p>\n各種安打的形式，也都有各自需要的打擊能力及進攻選擇。</p><p>\n	一壘安打（Single） – 打者把球打出去後，順利跑上一壘壘包，是最普遍的安打模式。</p><p>\n	二壘安打 （Double）- 打者把球打出去後，順利跑上二壘壘包。</p><p>通常球落點的位置，守備員需要花時間處理，跑者才能跑上二壘。</p><p>\n	三壘安打 （Triple）- 打者把球打出去後，順利跑上三壘壘包。</p><p>除了球的落點', '21-2.jpeg', '2022-08-26 18:18:18', '打擊', '1', 1),
(22, '【棒球D教室】', '棒球打者規則介紹｜2023新手必懂的棒球規則3', '<p>打者的打擊情境及結果\n多支安打\n打者在一場比賽當中，要有安打的表現，其實已經不容易了，若要出現兩支以上的安打，那又是更加的困難。</p><p>\n所以打者在單一比賽當中，若打出比較多的安打，球賽主播或文章報導，會用不同的方式，來形容打者的打擊表現。</p><p>\n	猛打賞 – 單場三支安打。</p><p>\n	鐵支 – 單場四支安打。</p><p>（撲克牌延伸出來的說法）\n長打（extra base hit）\n長打，用來形容打者在打擊時，所擊出二壘以上的安打，包含二壘安打、三壘安打及全壘打。</p><p>\n而擁有優異長打能力的球員，通常也都會被安排在中心打者的位置，來增加壘上有跑者時的殺傷力。</p><p>\n德州安打（Texas Leaguer）\n德州安打，有人稱之為「三不管地帶安打」，也有人用「鳥安」來稱呼。</p><p>基本上出現這種安打的球，其實是打者本身沒有打好，球棒去打到球的下緣，所出現軟弱無力的高飛球。</p><p>\n而這種球剛好落在內野手及外野手守備區域的交接處，所形成帶有運氣成分的安打。</p><p>\n下面影片為打者擊出的飛球，中外野手與游擊手中間，所形成的德州安打。</p><p>\n內野安打（infield hit）\n內野安打，打者所打出去的球，滾動相當緩慢情形下，守備員必須花更長的時間來處理球，打者就有機會先一步的跑上一壘壘包。</p><p>\n而有些球員會運用自己跑壘速度的優勢，又或是觀察守備員防守的站位，選擇使用突襲短打的方式，來跑上一壘壘包。</p><p>\n內野安打被歸類在一壘安打的其中之一。</p><p>\n場內全壘打（Inside-the-park Homerun）\n一般的全壘打，都是打者直接將球擊出全壘打牆之外，而「場內全壘打」則是球會落在場內，打者卻能夠一次跑完四個壘包，所形成的全壘打。</p><p>\n當打者把球打向外野時，外野手需要比較多的時間，才能掌握住球回傳至內野。</p><p>這也讓打者有更充裕的時間進行跑壘，從一壘壘包，一路跑回本壘得分。</p><p>\n過去有幾種比較常見的場內全壘打。</p><p>\n	賭注式防守 – 外野手嘗試用撲接或是滑接的方式，嘗試在球落地之前完成接殺，但卻沒接到球。</p><p>反而讓球滾到身後，必須起身花時間去追球。</p><p>\n	球打到全壘打牆 – 外野手在追球的過程中，因為球太靠近全壘打', '21-1.jpg', '2022-08-26 19:19:19', '打擊', '1', 1),
(23, '【棒球D教室】', '棒球守備規則介紹｜2023新手必懂的基本規則1', '<p>前言<br>棒球守備都是在做些什麼呢？不就只是球員間互相傳球、接球而已嗎？應該把大多的訓練時間，都放在進攻上吧！<br>守備在棒球運動裡，雖然不像是投手投球或是打者打擊，來的引人注目，但卻在整個運動之中，不可或缺、也是相當重要的一個環節。<br>回顧過去個人所看過的棒球比賽，確實有不少比賽的勝負，跟守備有著不小的關聯。<br>本篇文章將用淺顯易懂的方式，來說明棒球守備的基礎規則及意義。</p><p><br>棒球守備基礎介紹 -&nbsp;<br>為什麼要守備呢？<br>棒球比賽，由兩個重要的元素所組成，一個是進攻、一個是防守。關於防守的部分，必須降低球隊失分之外，最重要的就是抓出局數了。<br>那在球場上該如何拿到出局數呢？除了投手直接三振對方之外，其他就必須靠著團隊的守備配合，來讓跑者一個一個出局。</p><p><br>棒球場上有幾位守備員呢？<br>棒球場上一共有 9 位的守備員，包含 1 位投手、1 位捕手，以及 7 位的野手，各有負責的守備位置。<br>1.&nbsp;&nbsp;&nbsp;&nbsp;投手<br>2.&nbsp;&nbsp;&nbsp;&nbsp;捕手<br>3.&nbsp;&nbsp;&nbsp;&nbsp;一壘手<br>4.&nbsp;&nbsp;&nbsp;&nbsp;二壘手<br>5.&nbsp;&nbsp;&nbsp;&nbsp;三壘手<br>6.&nbsp;&nbsp;&nbsp;&nbsp;游擊手<br>7.&nbsp;&nbsp;&nbsp;&nbsp;左外野手<br>8.&nbsp;&nbsp;&nbsp;&nbsp;中外野手<br>9.&nbsp;&nbsp;&nbsp;&nbsp;右外野手</p><p><br>棒球員基本的守備動作有哪些？<br>棒球員在場上進行守備時，最基本的動作，不外乎就是接球及傳球這兩項。而比賽過程中，以這兩個基本的動作，再依不同的實際狀況，進行變化。</p><p><br>棒球員需要哪些裝備才能守備呢？<br>棒球並不像籃球、足球等等的團隊運動，球員身上不需要特定裝備，就能夠進行比賽。<br>棒球場上的 9 位守備員，除了捕手的裝備比較多之外，其餘的野手（包含投手），都只需一個手套，就能可以上場進行守備。</p><p><br>捕手的守備裝備有哪些？<br>為何捕手身上的裝備，比起其他守備位置的球員，要來的多？捕手平常除了要接投手所投的球之外，有時還可能被反彈球或是球棒給打到，所以身上穿戴的護具，一件都不能少。<br>捕手的裝備有：頭盔、面罩、護胸、護膝、護擋、手套。<br><br>鞏固場上守備的關鍵時刻<br>時常能夠在比賽的中後段，看到球隊教練，開始調度場上的球員。從板凳出發的野手，大多會針對某個特定需求被換上場，像是打擊、跑壘或守備等等。<br>在球隊領先的情況下，會選擇把守備能力較優異的球員，換上場進行守備，不僅能夠加大守備範圍，也提升抓到出局數的可能性。</p><p><br>棒球守備有很重要嗎？<br>考驗團隊默契的守備配合<br>在棒球場上，當打者把球打出去時，每個守備員都會有各自的任務，但為何球明明只在內野滾動，外野手也需要跟著移動呢？<br>簡單區分為兩個部份，一方面是守備配合，另一方面則是降低守備失誤的傷害。<br>•&nbsp;&nbsp;&nbsp;&nbsp;守備配合 – 守備員為了接球，必須往球的方向移動時，那壘包上就需要有其他隊友進行補位，才能夠在傳接球的配合上，讓跑者出局。<br>•&nbsp;&nbsp;&nbsp;&nbsp;降低守備失誤的傷害 – 守備員在守備時，出現漏球或把球傳偏所形成的守備失誤，能夠靠一開始的守備補位，避免跑者在往下一個壘包前進。<br><br>球員守備能力的區別<br>球員本身的守備能力，能夠從比賽的過程中，看出好壞的差異性。在每一顆球的處理上，若是因為守備員的關係，決定了跑者上壘或出局的結果，那一來一往之間，就更能凸顯出守備的重要性。<br>•&nbsp;&nbsp;&nbsp;&nbsp;守備好 – 守備員處理球的穩定度高，時不時還會出現難度較高的精彩守備，沒收打者的安打。<br>•&nbsp;&nbsp;&nbsp;&nbsp;守備差 – 守備員處理球的穩定度不佳，容易出現守備失誤或守備瑕疵，沒抓到出局數，卻反而讓跑者上壘。<br><br>守備好壞會影響投手投球？<br>投手要投什麼球，不是都是跟捕手在溝通嗎？跟守備員的守備能力，有什麼關係呢？<br>其實關係還真不小，試想，當球被打者打出去之後，守備員卻沒辦法有效掌握住，讓看似平凡的滾地球或是飛球，最後卻因為守備上的問題，讓跑者安全踏上壘包。<br>而這樣的守備狀況，會讓投手沒辦法在投手丘上有安定感，害怕球被打出去後，可能出現守備失誤，那倒不如靠著自己的能力，把球投在更刁鑽的位置，想辦法透過三振，直接讓打者出局。<br>但往往事與願違，當投手投球時受到越多的干擾，相對對他的投球狀況，也會造成一定的影響。尤其在出現守備失誤時，可能就是失分的開始。</p>', '24-1.jpg', '2022-08-20 20:20:20', '守備', '3', 1),
(24, '【棒球D教室】', '棒球守備規則介紹｜2023新手必懂的基本規則2', '<p>棒球守備位置及特性\n棒球守備位置該如何區分呢？\n在棒球場上的守備員，每個守備位置，都有各自的守備區域及守備代號。</p><p>而守備員的代號，主要是方便用來記錄比賽場上的狀況。</p><p>\n投手（Pitcher）\n投手，英文簡稱為 P，數字代號為 1。</p><p>投手在球場上主要負責投球的任務，偶爾也需要進行團隊守備的配合。</p><p>\n以下影片為投手向一壘壘包，進行補位的動作，最終比跑者更快一步踏到壘包。</p><p>\n捕手（Catcher）\n捕手英文簡稱為 C，數字代號為 2。</p><p>捕手在球場上的守備任務，可說是守備員當中，最為繁重的一位。</p><p>而捕手的守備任務，主要有下列幾項。</p><p>\n	接球 – 接住投手所投出來的球。</p><p>\n	配球 – 引導並協助投手，洞察打者的狀況，給予球種及球路上的建議。</p><p>\n	擋球 – 投手投出提前落地的球時，需要用身體或手套，把球擋下來，避免投手出現暴投的情形。</p><p>\n	盜壘阻殺 – 跑者進行盜壘時，捕手把球傳給壘包上守備員，在跑者碰觸到壘包之前，先行以手套觸碰到跑者，那跑者就會盜壘失敗，變成出局數。</p><p>\n	本壘攻防戰 – 捕手在接到野手或投手回傳的球後，在跑者碰觸到本壘之前，先行以手套觸碰到跑者，那跑者就會得分失敗，，變成出局數。</p><p>\n以下影片為捕手在本壘的攻防戰，順利抓到衝回本壘的跑者。</p><p>\n一壘手（First Baseman）\n一壘手，英文簡稱為 1B，數字代號為 3，屬於內野手之一。</p><p>\n一壘手的守備位置，通常會站在一壘壘包的附近，守備時以接球為重點。</p><p>\n不論是打者打出內野滾地球後，往一壘進行衝刺時，守備員將球傳到一壘，或是投手向一壘進行牽制的動作。</p><p>\n整場比賽下來，在一壘的守備位置，接球次數及頻率會是最高的。</p><p>\n有時一壘手在接球時，還必須去補救守備員在傳球，可能傳出反彈球或是傳偏的情形。</p><p>\n以下影片為一壘手補救，游擊手在守備時，把球傳偏的狀況。</p><p>\n二壘手（Second Baseman）\n二壘手，英文簡稱為 2B，數字代號為 4，屬於內野手之一。</p><p>\n二壘手屬於中線守備的一員，守備時所站的位置，通常會在一壘到二壘壘包之間的紅土區。</p><p>\n二', '25-1.jpg', '2022-08-20 21:21:21', '守備', '3', 1),
(25, '【棒球D教室】', '棒球守備規則介紹｜2023新手必懂的基本規則3', '<p>棒球球員守備能力的好壞區分\n守備率的參考依據？\n守備率（fielding percentage），用來計算球員守備的成功率，也能夠直觀球員守備能力的好壞。</p><p>\n守備率的高低，有參考的基準值嗎？基本上是沒有的，不過可以拿來與其他相同守位的球員做比較。</p><p>\n每個守備位置的守備率，要求都不太一樣，畢竟所要面對的守備狀況，也都有所不同。</p><p>而外野手的守備率，通常要比內野手的高一些。</p><p>\n實際上，要評估一位球員守備的好壞，是不能單看守備率，還有很多守備時的狀況，是這項數據所看不到的。</p><p>如：守備範圍、守備判斷等等。</p><p>\n守備率的計算 = （所有守備機會 – 守備失誤）/ 所有守備機會\n中線守備有哪些球員呢？\n棒球守備的中線球員，是球隊陣容當中，守備能力最為吃重的部分。</p><p>那中線守備的球員如何區分呢？\n由本壘板往中外野延伸出去一條隱形線，靠近這條線上的守備位置，會被歸類為中線球員，包含捕手、二壘手、游擊手及中外野手。</p><p>\n如何評估球員的守備能力？\n球員的守備能力，除了參考球員守備率之外，現在還有更多的進階數據，可以做為參考依據。</p><p>不過這裡要提的部分，相對比較簡單易懂，平常也能從比賽中，看出球員表現狀況。</p><p>\n	守備範圍 – 球員的移動速度。</p><p>\n	守備判斷 – 球員必須判斷打者擊出的飛球或滾地球，當下該前進、還是後退守備。</p><p>\n	傳球能力 – 球員傳球的速度、準度及距離。</p><p>\n棒球守備時應該站在哪裡呢？\n守備員有固定的位置嗎？\n守備方在進行守備時，場上除了投手及捕手的守備站位固定之外，其餘的守備員，基本上不會有太大的變動，會因應比賽當下的狀況，進行微調的動作。</p><p>\n最常見的就是當一壘有跑者時，一壘手會站在一壘壘包旁，來看管壘包上的跑者，隨時能夠配合投捕，進行牽制的動作。</p><p>\n以下影片為一壘有人時，一壘手守備時所站的位置。</p><p>\n特殊的守備方式\n非常時期，就該用非常手段。</p><p>這相當符合棒球場上的情形，必須因應不同的局面及戰況，來進行團隊守備站位上的調整。</p><p>\n更多有關守備戰術的部分，都在下方的延伸閱讀。</p><p>\n延伸閱讀：【棒球D教室】棒球戰術｜2022新手必懂的基本規則\n棒球守備牽制', '24-1.jpg', '2022-08-20 22:22:22', '守備', '3', 1),
(26, '【棒球D教室】', '棒球牽制規則介紹｜2023新手必懂的基本規則1', '<p>言\n「為什麼投手要一直把球丟向一壘呢？」難道這樣就可以讓跑者出局嗎？其實這是棒球比賽中的一部分，叫做「牽制」。</p><p>\n看似不起眼的牽制，卻也是屬於棒球中的一個環節，需要與隊友們的守備上互相配合，才能夠順利完成的動作。</p><p>\n本篇文章將用淺顯易懂的方式，來說明棒球牽制的基礎規則及意義。</p><p>\n關於棒球牽制的一萬個為什麼？\n為什麼要牽制呢？\n在棒球比賽中，「牽制」是屬於守備方的行為。</p><p>在壘包上有跑者的情況下，由投手或是捕手，以傳球的方式給內野手，迫使壘包上的跑者，必須先一步回到壘包，否則會有被觸殺出局的可能。</p><p>\n以投手的角色來說，牽制壘包上的跑者，主要常見的有幾個目的。</p><p>\n	縮小跑者離壘距離 – 跑者為了避免在壘包上被牽制出局，所以在離壘時，會做適當的調整。</p><p>\n	緩和投手情緒 – 投手透過牽制的動作，來緩和自身情緒，以及思考下一球要怎麼投。</p><p>\n	投手熱身不足 – 後援投手上場前熱身時間不夠，會利用壘上有跑者時，透過牽制傳球的動作，補足熱身的需求。</p><p>\n什麼時候可以牽制？\n守備方要進行牽制時，必須要符合兩個條件，壘包上有跑者，以及活球狀態這兩項。</p><p>其實跟跑者何時可以盜壘，是一樣的基本原則。</p><p>\n牽制跑者有用嗎？\n牽制壘包上的跑者，除了前面有提到的效果之外，最理想的結果，不外乎就是直接把跑者牽制出局。</p><p>\n這裡提幾個跑者較常被牽制出局的方式，以一壘有人的情境舉例。</p><p>\n	跑者離壘包太遠，來不及回壘。</p><p>\n	跑者有盜壘企圖，第一時間重心已朝著向二壘壘包，回壘速度受影響。</p><p>\n	跑者提前往下一個壘包起跑，選擇盜壘的嘗試，但投手並未投球，而是進行牽制動作。</p><p>\n	跑者專注力不佳，影響回壘速度。</p><p>\n以下影片為跑者有盜壘的企圖，在抓投手的投球節奏，但投手選擇往一壘做牽制，抓到壘包上的跑者。</p><p>\n牽制有次數限制嗎？\n棒球場上牽制跑者的部分，並沒有次數上限制，想牽制幾次都可以。</p><p>\n牽制會有甚麼風險嗎？\n牽制的風險來自於牽制時，必須將球傳給守備員，而進行傳球的這個動作，是有可能沒把球傳好的情形。</p><p>\n若守備方的野手，沒辦法把球接住或擋下來，球就有機會往其他的方向滾', '27-1.jpg', '2022-08-18 23:23:23', '守備', '3', 1),
(27, '【棒球D教室】', '棒球牽制規則介紹｜2023新手必懂的基本規則2', '<p>捕手臂力展現的時機\n牽制不是投手的專利\n在棒球場上，除了投手能夠牽制壘上的跑者，捕手也是可以進行牽制跑者的動作。</p><p>而捕手牽制的時機，通常都是接到投手投出的球後，再進行牽制的動作。</p><p>\n一不留神就被牽制出局\n捕手在球場上牽制的頻率及次數，並不像投手這麼的多，但往往捕手牽制時，都會出現不錯的效果。</p><p>\n最主要是捕手有在注意壘包上的跑者，當發現離壘過遠或回壘比較慢時，就會進行牽制的動作。</p><p>\n以下影片為捕手成功把三壘跑者牽制出局。</p><p>\n出奇制勝的牽制嘗試\n團隊守備的牽制配合（一壘）\n這樣的比賽情境，主要出現在一二壘的壘包上有跑者，一壘手通常不會 Hold 住壘包上的跑者，而選擇站在正常的守備位置，來增加守備範圍。</p><p>\n在跑者警戒心較低時，突如其來的牽制一壘，會讓一壘壘包上的跑者措手不及之下，被牽制出局。</p><p>\n團隊守備的牽制配合（二壘）\n比賽的情境，出現在一二壘壘上有跑者的情形下，進攻方想使用觸擊短打戰術，將壘包上的跑者向前推進，而守備方也因應這樣的進攻戰術，選擇趨前守備。</p><p>\n但守備方卻利用這樣的防守佈陣及跑動，來迷惑二壘壘包上的跑者，突如其來的牽制二壘，讓跑者回壘不及而出局。</p><p>\n總結\n看完了棒球牽制的基本介紹，應該有了些基礎概念了吧？\n更多場上關於牽制的細節，還是需要從比賽中去觀察，才看得出差異。</p><p>畢竟比賽局面的不同，也會影響著球隊牽制的配合及選擇。</p><p>。</p>', '27-1.jpg', '2022-08-18 20:20:10', '守備', '3', 1),
(28, '【棒球D教室】', '棒球戰術規則介紹｜2023新手必懂的基本規則1', '<p>前言\n你知道棒球戰術有哪些嗎？球場上所使用的每種戰術背後，都代表著什麼意義呢？\n為何有時看到打者在面對相當離譜的壞球時，卻還是執意去揮棒，想辦法去打到球呢？\n這其實就是棒球戰術裡，其中的一個環節。</p><p>\n今天就要來簡單說明一下，有關於棒球戰術的部分。</p><p>\n那些你該懂的棒球戰術基本規則\n棒球屬於團隊運動，跟籃球、足球一樣，都會有著團隊的配合，不論是身為進攻方，又或是防守方時，各會有著不同戰術的使用選擇。</p><p>\n球場上的戰術使用，除了由教練團下達戰術之外，球員們在場上執行的狀況，更是決定戰術能否成功的關鍵。</p><p>\n為何要使用戰術呢？\n棒球比賽不就是要追求全壘打及三振嗎？為何球場上還這麼多的戰術運用？難道不會影響整體的比賽精采度嗎？\n其實棒球戰術在當今的具有指標性的職棒聯盟當中，像是美國職棒、日本職棒等等，都是會在比賽中使用戰術的。</p><p>\n尤其追求棒球比賽能夠更精采的美國職棒，比起像是日本所謂的小球戰術，更傾向於具有侵略性的戰術使用。</p><p>\n最適合執行戰術的時機\n棒球戰術並沒有一定的使用時機，如果有的話，那我想…大概也很容易被對手破解吧？\n雖說每支球隊在使用戰術時，都會有各自不同的習慣，但若要說有共通點的部分，那倒也不是沒有。</p><p>\n最常見的不外乎就是出現投手戰，又或是來到比賽後段，要搶關鍵分的時候，那戰術使用的機會，就會來的高上許多。</p><p>\n戰術成功能帶來什麼好處？\n戰術執行成功時，能為球隊帶來什麼好處呢？\n	進攻方 – 最基本能達到推進跑者的效果，若使用更積極的戰術，打者也有機會上壘。</p><p>\n	守備方 – 抓到出局數之外，甚至能擋下關鍵的分數。</p><p>\n戰術失敗必須承擔什麼風險？\n戰術執行失敗時，球隊必須承擔什麼樣的風險？\n	進攻方 – 跑者沒辦法順利推進之外，還有可能出現雙殺的情況。</p><p>\n	守備方 – 因為守備佈陣下，打者有更高機率擊出安打。</p><p>\n以下影片是三壘壘上的跑者，想趁著投手走回投手丘時，所發動的盜本壘戰術。</p><p>\n戰術有使用次數限制嗎？\n棒球戰術，並沒有使用上次數的限制，唯一會影響戰術使用的次數，那大概會跟總教練本身帶隊的風格有關。</p><p>\n有些教練喜歡讓球員頻繁的使用戰術，而有些教練則會選擇讓球員在場上自由發揮。</p><p>各', '29-1.jpg', '2022-08-15 10:10:10', '守備', '3', 1),
(29, '【棒球D教室】', '棒球戰術規則介紹｜2023新手必懂的基本規則2', '<p>守備時有哪些戰術可以使用？\n內野手怎麼都往前站呢？\n趨前守備，守備員會因應當下比賽局面，比原先所站的守備位置，還要再往前一些。</p><p>透過這樣的守備站位，來縮短接球的時間後，來抓到壘上的重要跑者。</p><p>\n當然野手往前站，能夠縮短接球時間，但也提高了球被打穿防線的風險，畢竟這樣的守備選擇，縮短了守備員的反應時間及空間。</p><p>\n防守員趨前守備所站的地方，通常會在與壘包平行的位置，而這裡將以常見的內野守備做說明。</p><p>\n50%趨前守備\n內野的四個守備員，主要由一壘手及三壘手往前守備，而二壘手及游擊手的部分，則會站在原先守備的位置。</p><p>\n以平時常見的情境作舉例（一三壘有人、一人出局），打者擊出內野手正面的滾地球。</p><p>\n	一壘手&三壘手 – 若三壘跑者往本壘衝，守備方縮短接球距離之下，更有利於把球傳向本壘，讓捕手有較充裕的時間來觸殺跑者。</p><p>\n	二壘手&游擊手 – 守備方可以選擇策動雙殺守備，結束這個半局。</p><p>\n100%趨前守備\n內野的四個守備員，一、二、三壘手及游擊手，所有人的守備站位，都會往前守備。</p><p>\n過去比賽中，球隊會選擇這樣的趨前守備，大多是守備方要防止三壘的跑者回本壘得分。</p><p>所以在出現內野手的正面滾地球時，只要三壘有往本壘衝的意圖，那球就一定會傳往本壘。</p><p>\n以下是在二三壘有人的狀況，守備方的內野手全部趨前守備，由二壘手接到正面滾地球，順利傳本壘抓到衝回本壘的跑者。</p><p>\n這守備員的站位是否怪怪的？\n這守備員所站的位置，好像跟平常守備時不太一樣？這裡要提到的是棒球守備佈陣，守備方會針對打者的擊球習性，來調整守備時所站的位置。</p><p>\n簡單來說，打者比較常把球打到球場的右半邊，那守備方在一開始守備時，就選擇先往右半邊站一些，讓球在打出去時，有更告機率讓球掉到佈陣裡。</p><p>\n而出現比較極端的守備佈陣，大多是在美國職棒大聯盟（MLB）中，尤其是針對強拉式的打者，球幾乎都是打向同一邊，讓守備員更加容易抓到出局數。</p><p>\n但 MLB 考量到比賽整體的精采度，開始對於這樣的守備佈陣，朝著禁止使用的方向，在比賽中做調整及嘗試。</p><p>\n以下為特殊的守備佈陣，守備方針對打者的打擊習性，進而調整守備的位置，最終順利抓到打者。</p><p', '29-1.jpg', '2022-08-15 04:04:04', '守備', '3', 1),
(30, '【棒球D教室】', '棒球跑壘規則介紹｜2023新手必懂的基本規則1', '<p>前言\n你知道球員為什麼要跑壘嗎？還有打者把球打出去時，是往一壘方向跑，而不是三壘方向跑呢？\n其實這就只是棒球規則的一部份，就像路上的紅綠燈一樣，經過時就必須遵守紅燈停、綠燈行的規定。</p><p>\n但棒球規則裡，在每一次比賽的攻防之中，許多規則都是相互關聯的，會隨著當下比賽的局面，應用到不同的規則來進行解釋。</p><p>\n今天就要來講解有關棒球跑壘的基礎，來讓更多的棒球新手，更快熟悉球場上的狀況。</p><p>\n那些你該懂的棒球跑壘基本規則\n為什麼要跑壘呢？\n跑壘員（Runner），在棒球場上進行跑壘的球員，而平時較常使用跑者來稱呼。</p><p>\n跑壘，屬於棒球場上重要的一個行為，當球隊處在進攻方時，不論是出現安打、保送、得分等等，都需要經由跑者，來進行跑壘的動作。</p><p>\n除了打者擊出全壘打時，能一次跑四個壘包之外，其他球場上的進攻狀況，則需團隊的配合，才能持續讓跑者往前推進。</p><p>\n什麼時候可以跑壘？\n只要比賽進行中，跑者想怎麼跑、就怎麼跑？理論上是這樣沒錯，但還是須符合棒球規則，才可以進行跑壘的動作。</p><p>\n這裡簡單區分打者及跑者的部分\n	打者 – 將球打進球場界內區，打者就會轉換成跑者的身分，進行跑壘的動作。</p><p>\n	跑者 – 已經在壘上的跑者，只要在活球狀態下，都可以選擇再往下一個壘包前進。</p><p>\n優質跑者的理想條件\n球員是否為一位好的跑者，有兩個重要因素，一個是跑壘速度，另一個則是球場上的瞬間判斷。</p><p>決定了跑者能否為球隊在跑壘過程中，幫助球隊創造出更多的進攻優勢。</p><p>\n而這兩個條件的重點在於？\n	跑壘速度 – 跑者本身跑壘速度越快，越能夠帶給守備方守備時的壓力。</p><p>\n	判斷能力 – 跑者必須判斷場上的狀況，該往前跑、還是停留在跑壘上。</p><p>\n為什麼衝過一壘不能觸殺？\n在棒球規則中，打者把球打出去時，往一壘方向直線衝刺，是可以衝過一壘壘包的，當下守備方是不可以進行觸殺的。</p><p>\n當跑過一壘壘包時，跑者若如果出現企圖跑往二壘的舉動，那當下守備方是可以進行觸殺的動作。</p><p>\n為什麼不是往三壘跑呢？\n依照棒球規則，打者在把球打出去之後，跑壘的方向及順序是從本壘開始，依續往一壘、二壘、三壘，最後才會回到本壘得分。</p><p>\n為什麼要這樣跑呢？單純就棒', '31-1.jpg', '2022-08-12 01:01:01', '知識', '5', 1),
(31, '【棒球D教室】', '棒球跑壘規則介紹｜2023新手必懂的基本規則2', '<p>跑壘可以怎麼跑？\n跑百米的直線加速\n當跑者的目標是在搶攻眼前的壘包時，都是進行直線加速的方式，衝上壘包。</p><p>普遍看到的是跑上一壘，而其他壘包的部分，大多會搭配滑壘的方式進壘。</p><p>\n最漂亮的跑壘弧線\n當跑者的目標是兩個以上的壘包時，跑者為了縮短跑壘距離，以及在衝刺的過程中更加順暢，會選擇在經過壘包前，稍微繞出一些角度，來讓整體動力是朝向下一個壘包，有利於最後進行直線衝刺。</p><p>\n為何冒著風險離壘呢？\n跑者離開壘包，不是就會有被守備員觸殺出局的機會嗎？是這樣沒錯，不過為了縮短與下一個壘包的距離，就必須進行離壘的動作。</p><p>\n但跑者在離壘時，必須抓好離壘的距離，以及注意場上的狀況，避免被投手或是捕手牽制出局。</p><p>\n與紅土最近的距離\n撲壘，球員在擔任跑者時，不論是在面對投捕的牽制，又或是衝搶下一個壘包，都有可能會進行撲壘的動作。</p><p>\n撲壘最主要的用意在於下面兩項\n	回壘 – 跑者離壘距離加大時，為了縮短回壘的速度，會選擇用撲壘的方式。</p><p>\n	搶壘 – 跑者往下一個壘包前進時，為了有效閃躲防守員的觸殺，部分球員會選擇用撲壘的方式進壘。</p><p>\n跑者最常用的煞車方式\n滑壘（Slide），跑者在搶攻下眼前的壘包時，為了能夠順利上壘，不會出現跑過頭的狀況，透過滑壘的方式，達到進壘及煞車的作用。</p><p>\n安全上壘及出局的選擇\n零點幾秒的選擇\n棒球比賽中，許多環節都在考驗著，球員們場上的瞬間判斷。</p><p>在跑者跑壘的當下，該果斷向前、還是保守確定球落地在起跑，這就相當重要了。</p><p>\n尤其在棒球規則中，每一次場上的攻防選擇，都會遇到各種不同的狀況，進而出現不同的規則運用，球員就必須在短時間內，做出正確的判斷。</p><p>\n這也仰賴於球員平時訓練及實戰經驗，所累積出來的成果，最終反應在場上的表現。</p><p>\n跑壘失誤的影響\n球員在擔任跑者的過程中，偶爾會出現判斷上的失誤，讓自己在球場上，跑著跑著…不小心就出局了。</p><p>\n跑壘失誤的出現，基本上都會造成球隊不小的傷害，尤其是出現在關鍵比賽及關鍵分數時，那影響會更加的巨大。</p><p>\n沒踩到壘包還好吧？\n依棒球規則來看，跑者在跑過壘包時，必須確實踏到壘包後（有碰到都算），才能夠往下一個壘包前進。</p><p>\n跑壘對於球員在場', '31-2.jpg', '2022-08-12 02:02:02', '知識', '5', 1),
(32, '【棒球D教室】', '棒球盜壘規則介紹｜2023新手必懂的基本規則1', '<p>前言\n你了解棒球場上的盜壘是什麼嗎？為什麼跑者可以趁著投手投球時，偷偷的跑到下一個壘包呢…難道球員都是這麼不講武德嗎？\n當然，盜壘在棒球場上是被允許的，但每一次跑者的盜壘啟動，更是場上球員及場邊教練團鬥智的時刻。</p><p>\n而那些在壘包間穿梭自如的跑者們，需要具備哪些能力呢？難道只要跑的快，就可以輕鬆盜上壘包嗎？\n今天要來與你分享，有關於棒球場上盜壘的基本概念及知識。</p><p>\n那些你該知道的棒球盜壘基本規則\n盜壘（steal），屬於棒球中跑壘的環節，也歸類在棒球戰術的一種。</p><p>不論是在跑壘、又或是戰術的部分，都有各自須要注意的重點及細節。</p><p>\n而盜壘的意思及目的是指，在壘包上的跑者，可以趁著投手在投球時，偷偷的跑向下一個壘包，好讓自己離本壘更近，來增加球隊得分的機會。</p><p>\n盜壘有什麼好處？\n盜壘的好處在於壘包上的跑者，若成功的盜上下一個壘包，就能為球隊創造出更佳的得分機會。</p><p>\n壘包上蠢蠢欲動的跑者，要跑、不跑的情況下，也會影響著投手的專注度及投球節奏，讓打者有更好的進攻機會。</p><p>\n而有時還能靠著守備方的守備瑕疵，像是投手或捕手暴傳等等，讓跑者當下能夠兵不血刃的往下一個壘包做前進。</p><p>\n什麼時候可以盜壘？\n首先…打者必須先想辦法站上壘包，只要棒球比賽在活球的狀態下，跑者都可以進行盜壘的嘗試。</p><p>\n盜本壘有什麼特殊規則嗎？\n無論跑者要盜往哪個壘包，盜二壘、盜三壘，或是盜本壘，在棒球規則中，所有的盜壘規則，基本上都是相同的。</p><p>\n盜壘所需承擔的風險\n使用盜壘常見的風險，主要有下面兩個情形\n	出局 – 出現盜壘失敗的狀況，跑者會直接變成出局數\n	受傷 – 球員盜壘時，對身體會有一定的負擔及受傷風險。</p><p>而隨著棒球型態改變之下，漸漸的在盜壘使用上，考量層面也就越來越多。</p><p>\n	過去就有球員曾因盜壘嘗試，本身出現比較嚴重的傷勢。</p><p>\n但必須去衡量跑與不跑的差距，畢竟對於部分的球員來說，盜壘會是個人在球場上，重要的進攻武器之一。</p><p>\n不可不知的盜壘潛規則\n棒球場上，存在著許多不成文的規定，而在盜壘戰術方面，也有著相關的潛規則。</p><p>\n最常見的，莫過在球隊大幅度領先下，領先方還使用盜壘戰術，這可能就觸犯了盜壘潛規則。</p><p>接', '33-1.jpg', '2022-08-09 10:11:01', '知識', '5', 1),
(33, '【棒球D教室】', '棒球盜壘規則介紹｜2023新手必懂的基本規則2', '<p>棒球盜壘成功的關鍵因子\n投手投球型態的差異\n投手常見的投球型態，大多以高壓式投球、側投及低肩側較為普遍。</p><p>在壘上有跑者時，為了防止跑者盜壘，投手會改由固定式的投球模式，進而縮小投球動作及縮短投球時間。</p><p>\n除了高壓式投球之外，若使用側投及低肩側投的投手，投球姿勢相對較大，也會讓跑者更容易去抓住盜壘啟動的時機。</p><p>\n另外當投手為左投或右投時，對於壘上跑者的盜壘判斷，也會出現不同的影響。</p><p>\n以一壘有人的狀況下，對於左投手來說，跑者相對比較不易抓到盜壘時機，主要是左投在投球準備時，人是朝著一壘壘包的方向，再加上投球及牽制動作，會更加難以分辨。</p><p>\n投手投球節奏的快慢\n投手的投球節奏，影響著跑者在盜壘時的啟動時機，尤其在壘包上有跑者時，投手此時沒有投球時間限制下，通常會把投球節奏放的慢一些。</p><p>\n投手也為了防範壘包上的跑者盜壘，而在每一球的投球之間，變換投球出手的節奏，以及適當的牽制，來混淆壘上的跑者。</p><p>\n過去就有投球節奏太固定的投手，被跑者不停的盜壘成功。</p><p>\n配球及牽制的相互配合\n投手、捕手之間的配合，會影響著跑者盜壘的成功率，有時還能靠著牽制跑者，來抓到盜壘慾望太強的跑者。</p><p>\n	配球 – 投手投直球時，球進到捕手手套的時間較短，有助於捕手進行阻殺的動作。</p><p>\n	牽制 – 透過投手的牽制，能限縮跑者的離壘距離，增加跑者要跑上二壘的距離。</p><p>\n考驗捕手阻殺能力的時刻\n盜壘阻殺，在跑者進行盜壘嘗試時，捕手必須將球快速傳給野手，搭配野手的觸殺動作，來阻止跑者成功盜上壘包。</p><p>\n平常習慣用捕手的阻殺盜壘率，來直觀一位捕手的阻殺能力，但往往跑者能夠順利盜上壘包，絕非只有捕手的問題。</p><p>\n這其中包含著許多的因素，包含投手節奏、球種、牽制頻率、與野手的搭配及觸殺動作等等，都會影響著跑者每一次的盜壘選擇及嘗試。</p><p>\n當然，捕手本身的傳球臂力及準度，會是盜壘阻殺中，重要的一個環節，也是捕手個人能夠訓練及掌握的部份。</p><p>\n快如閃電的跑壘速度\n盜壘時，跑者要用最少的時間，衝往下一個壘包，必須比守備方的球還要更早到壘包，所以本身的跑壘速度，若能夠越快、對跑者本身越有優勢。</p><p>\n跑者如何判斷最佳的盜壘時機？\n盜壘時機，過', '33-2.jpg', '2022-08-09 05:04:03', '知識', '5', 1),
(34, '【棒球D教室】', '棒球觸擊短打規則介紹｜2023新手必懂的基本規則1', '<p>前言\n「你知道棒球場上的短打是什麼用途嗎？」為何球隊願意用寶貴的出局數，來換取壘包上跑者的推進呢？\n過去若有看過棒球比賽，或多或少都曾遇過短打戰術的運用。</p><p>無論是求穩定推進的犧牲短打，或是想上壘的突襲短打，都被歸類在短打運用。</p><p>\n看似簡單的戰術，背後卻有更深奧的技巧。</p><p>雖然短打能力，常被稱之為基本功，但如何在場上運用自如，就必須回歸到球員本身的短打技巧了。</p><p>\n本篇文章將以觀賞球賽的角度，來說明短打戰術的基礎及含意。</p><p>\n那些你該知道的棒球短打基本規則\n短打，屬於棒球比賽中，進攻戰術的一種，最主要用來推進壘包上的跑者，為球隊創造出更佳的得分機會。</p><p>\n打者在進行短打戰術，不同於正常揮擊時，雙手握在球棒尾端。</p><p>而是將球棒橫握擺出來，增加確實碰觸到球的機率，順利把球碰進球場中。</p><p>\n短打有哪些常見的說法？\n以維基百科內容的說明來看，短打最原先的用詞，應該是稱之為觸擊（BUNT），而短打本身也存在著許多不同的稱呼方式。</p><p>\n像是犧牲觸擊、犧牲短打等等，也有某台體育主播喜歡用「觸擊犧牲」的說法，但最常還是以短打來形容。</p><p>\n另外棒球比賽中，也時常會用「點」這個字，來形容打者進行短打的意思，比較屬於動詞的概念。</p><p>\n使用短打該注意哪些細節？\n短打技巧，站在球迷的視角來看，只要能將跑者，穩穩地往下個壘包推進就好了，似乎比起正常揮擊推進，要來的簡單許多。</p><p>\n但往往魔鬼藏在細節中，要把短打戰術做的好，除了基本觀念之外，扎實的訓練絕對少不了。</p><p>\n平常在觀賞球賽時，可以去注意短打的兩個部分，「力道及方向」，若球員能把這兩項都做好，就能達到相輔相成的作用，更高機率將跑者向前推進。</p><p>\n短打方向該朝哪個方向？\n短方方向，基本上都是朝著一、三壘的方向去進行短打，比較少會朝著投手的方向短打。</p><p>\n短打力道控制的重要性\n比起短打方向，短打力道拿捏恰當，更是短打成功的關鍵，必須控制得宜，否則容易出現短打失敗的狀況。</p><p>\n	力道過強，球朝著守備員而去，縮短處理球的時間，容易造成推進失敗。</p><p>\n	力道太弱，捕手只要向前跑一小段距離，就可快速將球傳給野手，封殺前一位跑者。</p><p>\n棒球戰術的其中之一\n棒球運動', '35-1.jpg', '2022-08-06 04:01:02', '打擊', '1', 1);
INSERT INTO `article` (`id`, `subtitle`, `title`, `description`, `photo`, `created_at`, `type`, `type_id`, `valid`) VALUES
(35, '【棒球D教室】', '棒球觸擊短打規則介紹｜2023新手必懂的基本規則2', '<p>棒球短打的使用時機\n壘上跑者與出局數的相對應關係\n通常使用短打的推進戰術，都是在無人出局時執行居多，也曾有在一人出局的情況下，使用犧牲短打推進跑者，但這就相當少見。</p><p>\n幾個常見使用犧牲短打推進的狀況。</p><p>\n	無人出局、一壘有人\n	無人出局、二壘有人\n	無人出局、一二壘有人\n開賽首局就先送出局數？\n比賽首局，第一棒打者上壘後，由第二棒的球員進行犧牲短打戰術，將跑者推進到二壘得點圈的位置，把得點圈進攻的機會，創造給中心棒次的打者。</p><p>\n主要希望一開始就處在領先的優勢，而這樣的開局模式，也跟球隊本身短打戰術使用頻率，有著不小的關聯。</p><p>\n搶下比賽中的關鍵分數\n關鍵分數，比賽在雙方平手局面，球隊當下非常需要分數的進帳，而這一分就足以決定比賽的勝負。</p><p>\n	投手戰 – 雙方投手表現優異，球隊得分困難的情形下，透過短打的推進，來創造出更多得點圈進攻的機會。</p><p>\n	比賽後半段或延長賽 – 雙方所剩出局數有限的情況下，若能拿下超前分，更掌握領先的優勢。</p><p>\n只求穩穩的擴大領先優勢\n擴大領先分數，在分數領先有限的情況下，希望將上壘的跑者送回來，來增加分數上的優勢，進一步讓教練團，能在球員的調度上，獲得更大的運用空間。</p><p>\n但這也需要考量到許多層面的因素，包含雙方投手戰力、打擊火力、以及球隊整體的近況，來決定當下戰術使用的選擇。</p><p>\n	投手戰力 – 投手戰力穩定，球隊領先 1-2 分，就足以鎖定勝利\n	打擊火力 – 打擊火力兇猛，有更大的空間，讓球員自由發揮\n	球隊近況 – 球隊近況理想，會選擇更具侵略性的戰術使用\n以上都是比較理想的狀況，但現況反過來時，就必需有不同思考的模式。</p><p>\n短打棒次及角色如何安排？\n棒球場上，會被頻繁要求執行短打戰術的球員，大多在個人的打擊能力，相對要來的薄弱一些，而這類型的球員，更偏向於助攻的角色，幫助球隊創造出更多的得分機會。</p><p>\n在早期的中華職棒，這類型打者，普遍會被安排在第二棒及第八棒的兩個棒次，來配合球隊整體戰術運用。</p><p>\n棒球短打的使用頻率\n亞洲職棒中的短打翹楚？\n說到亞洲職棒的短打使用，就不得不提到日本最拿手的小球戰術，他們把這些俗稱基本功的棒球技巧，練到如火純青的地步，\n才能在比賽中運用自如。</p>', '35-2.jpg', '2022-08-06 05:06:07', '打擊', '1', 1),
(36, '【棒球D教室】', '棒球比賽規則｜2023新手必懂的基本規則1', '<p>前言\n你是剛入門的棒球新手嗎？跟著朋友進場看球，卻看不懂場上的狀況嗎？那是相當正常的，畢竟新事物本來就需要時間學習，更何況棒球的複雜性還不低…。</p><p>\n但五花八門的棒球規則，該如何一點就通呢？讓我用一個喜愛棒球的球迷，簡單說明棒球場上需要了解的基本觀念。</p><p>\n比起棒球規則裡所寫的生硬文字，我想那對於棒球新手來說，幫助相當有限…這裡將以淺顯易懂的方式，帶你進入棒球世界。</p><p>\n以下所整理的內容，將會以中華職棒為主軸來說明，類似棒球規則懶人包的概念。</p><p>\n棒球入門的基本規則介紹\n棒球比賽條件\n一場正規的棒球比賽，以 9 局計算，每一局區分上、下半局，上半局若是屬於進攻方，則下半局則變成防守方，在每個半局出現第三個出局數時，進行攻守交換。</p><p>\n	進攻方：運用每個半局的三個出局數，盡量多拿些分數\n	防守方：盡快抓到第三個出局數，並且降低失分\n每一個半局的攻守交換，除了比分不會變之外，其他都會歸零重來，像是壘上原先的跑者、好壞球、出局數等等。</p><p>\n進攻方\n棒球員擔任進攻方時，會有兩個身分上的轉換，起初會先以打者的身份上場打擊，將球順利打進界內時，則會轉變為跑者身分。</p><p>\n	打者：安打上壘、戰術配合、消耗投手用球數\n	跑者：在壘包上擾亂投手的投球節奏\n防守方\n棒球員擔任防守方時，重點在於投手丘上的投手，以及團隊的守備配合，各有各自的任務。</p><p>\n	投手：三振對手或讓打者打不好\n	團隊守備：穩穩抓到出局數、降低守備失誤及瑕疵\n出局數（OUT）\n正規比賽的 9 局之中，各球隊都會有 27 個出局數可以運用，只要不出現最後一個出局數，落後的一方仍有機會逆轉比賽。</p><p>\n如何活用這 27 個出局數，來讓球隊獲得最大的效益，全看比賽中的球員個人表現、團隊配合，以及教練的調度做決定。</p><p>\n棒球員在場上，需要時時刻刻專注在球場上，以免做出錯誤的判斷，像是跑壘失誤、守備失誤等等…，而這些偶爾也是會在職棒場上發生。</p><p>\n出局數產生的方式，主要由守備方進行守備時，像是投手三振、野手接殺、觸殺、助殺等等。</p><p>\n更完整有關於棒球出局規則，請參考下面延伸閱讀。</p><p>\n打擊順序（batting order）\n棒球比賽中，各球隊都會有 1 – 9 棒、九位打者，從第一棒開', '37-1.jpeg', '2022-07-29 05:02:04', '知識', '5', 1),
(37, '【棒球D教室】', '棒球比賽規則｜2023新手必懂的基本規則2', '<p>棒球比賽場地長什麼樣子？\n台灣北、中、南，各有不同用途及特色的棒球場，依照球場的規格及性質，安排不同層級的賽事，如國際賽、中職賽事或業餘棒球等等…。</p><p>\n而在認識每個球場的特色之前，最重要的要先了解棒球場中，必要設施及區域的用途。</p><p>\n球場示意圖\n打擊區（BATTER’S BOX）\n由一個長方形的框框所顯示，打者在進行打擊時，雙腳必須站在打擊區內。</p><p>\n位於本壘板的左右兩側，各會有一個打擊區，打者可因應自身為左打或右打，來選擇站位。</p><p>\n打擊預備區\n打擊預備區，主要用來提供進攻方，下一位上場打擊的打者，揮棒熱身的空間。</p><p>\n兩隊各自有打擊預備區，位於本壘後方兩側，靠近球隊休息室的位置，會特別標示。</p><p>\n投手丘（Pitcher’s mound）\n投手丘是投手投球時，所使用的空間。</p><p>而在投手丘上方，會有一塊白色長方形的投手板，用來規範投手所站的位置。</p><p>\n界內、界外區\n以本壘左右兩側的打擊區，延伸出來的兩條線。</p><p>而線會一直到全壘打標竿，用來區分球被打者擊出時，落在界內或界外判定的依據。</p><p>\n	界內區\n	一壘壘包邊線的左側\n	三壘壘包邊線的右側\n棒球場界內區以外的區域，都屬於界外區。</p><p>\n內野、外野區\n	內野區 – 從本壘板開始，一直到壘包後方的弧形線，區域內都算是內野區。</p><p>\n	通常可明顯看出紅土與草皮的交界處。</p><p>\n	外野區 – 內野區以外的區域，就都算是外野區的範圍。</p><p>\n	外野區大部分都是草皮，除了在接近全壘打牆前方的一小段，為紅土區。</p><p>\n壘包（Base bag）\n棒球場上會有四個壘位，從本壘開始，以逆時針的方式來看，分別為一壘、二壘、三壘，除了本壘是使用五角形的本壘板之外，其餘三個均使用正方形的壘包。</p><p>\n棒球比賽中，壘包在兩隊攻防之間，都會使用到的一項器具。</p><p>\n本壘板（Home base）\n本壘板屬於壘包的其中之一，而其主要用途在於\n	判斷球是否經過好球帶\n	跑壘員是否順利踏觸本壘得分\n	擊球員是否揮棒過半\n棒球員休息區（Dugout）\n一般球員休息區設置的地方，會在一、三壘的兩側，而使用的方式，通常以一壘為主場球隊，三壘為客場球隊的安排方式居多。</p><p', '38-1.png', '2022-07-29 02:01:03', '知識', '5', 1),
(38, '【棒球D教室】', '棒球比賽規則｜2023新手必懂的基本規則3', '<p>一場棒球比賽時間多長？\n棒球比賽開始時間\n中職比賽有區分平日及假日，平日通常會在晚上 18：35 時開始進行比賽，除了台北天母棒球場的比賽開打時間為 18：05。</p><p>\n假日則是會有兩個比賽時段，分別為 14：05 及 17：05。</p><p>大多都是以下午 5 點開打的時段居多，而下午 2 點開打的狀況，相對較少，以球團及聯盟討論，並將各季節的天氣狀況納入考量。</p><p>\n	平常日：晚上 18：35\n	例假日：下午 14：05 或 17：05\n棒球比賽結束時間\n中職比賽並不會有時間上的限制，都是以最後一個出局數的出現，比賽才算是正式結束 \n除了因其他特殊狀況，讓球賽必須提前終止，如雨勢過大、現場設備故障…等等，又或是像台北天母棒球場，晚上 10 點過後有比賽限制。</p><p>\n正規比賽\n中職正規的棒球比賽為 9 局，時間大多落在 2.5 – 3 小時，會再視當天比賽的狀況，而有所增減，但基本上時間都是會比較長一些。</p><p>\n延長賽\n中職延長賽的規定，最多只打到 12 局，若遲遲無法分出勝負，最後則會以和局收場。</p><p>\n而在台灣大賽（總冠軍賽）則沒有局數上的限制，必須打到分出勝負為止。</p><p>過去最令人印象深刻的，莫過於中職 2009 年的台灣大賽，曾出現 17 局的延長加賽。</p><p>\n投打時間限制\n為降低棒球比賽過程中，不必要的時間消耗，近年來有逐漸調整打者及投手的時間限制\n	中職 2022 年相關規定\n	投手 – 在壘上無跑者時，投手持球後開始計時，20 秒內需出手投球。</p><p>\n	打者 – 投手持球開始計時後，打者需在 10 秒內進到打擊區。</p><p>\n因雨延賽\n台灣都是以室外球場為主，所以容易受天候狀況影響，像是在下雨的部分，常出現雨勢過大或場地積水嚴重等狀況，導致球賽必須延期\n而在中職球賽的部分，蠻常受到雨勢的影響，尤其在中職開打期間，會遇到梅雨季、颱風季節…等等。</p><p>\n保留比賽\n保留比賽，通常出現在球賽進行中，受到雨勢過大的影響，而被迫中止比賽，必須延期再戰。</p><p>\n而保留比賽也須符合某些條件，就是該場比賽尚未完成五局，才會變成保留比賽。</p><p>若已超過五局的局數，則會直接以當下的比分，裁定比賽勝負。</p><p>\n棒球隊是如何組成的呢？\n中華職棒球隊的組成\n球隊', '39-1.jpg', '2022-07-29 09:01:02', '知識', '5', 1),
(39, '【棒球術語】', '棒球好球帶規則介紹｜九宮格的奧妙1', '<p>前言\n好球帶，屬於棒球術語之一。</p><p>\n你知道為什麼好球帶的大小，會不一樣嗎？為何好球帶的判決，過去時常出現爭議呢？\n本篇文章將依中華職棒棒球規則，整理有關於好球帶的資訊及案例，並加上個人見解，與您分享。</p><p>\n溫馨提醒：文章中藍色字為超連結，有助於你對該名詞的理解。</p><p>\n相關棒球術（用）語：\n》球數、三振、不死三振、四壞球保送\n棒球好球帶規則基本介紹\n好球帶是什麼意思？\n好球帶，作為判定投手投出的球，是好球或壞球之基準。</p><p>\n好球帶的範圍有多大呢？\n以本壘板為基準，向上延伸出來的一個五角體空間。</p><p>只要球有接觸到好球帶，都會被判為好球。</p><p>\n而好球帶的高度，會隨著打者的身高，而有所變化。</p><p>\n好球帶範圍大小的參考資訊如下：\n	最高點：打者肩膀上緣，到球褲上緣的中間點。</p><p>（以手軸為參考基準）\n	最低點：打者膝蓋下緣。</p><p>\n	寬度（固定）：本壘板左右寬度。</p><p>\n	深度（固定）：本壘板延伸出來之五角體範圍。</p><p>\n好球帶的九宮格長什麼樣子？\n好球帶，總共區分為九個格子，各有各自的代表號碼。</p><p>\n過去收看賽事轉播的經驗來看，時常能聽到賽事主播及賽評，用數字來解釋，比賽當下的狀況。</p><p>\n對於打者來說，球在 1-6 號位置、相對容易進攻，而在 7-9 號位置時，則較難出現有效的攻擊。</p><p>\n為什麼不同主審裁判的好球帶，會不太一樣呢？\n人工判決，難免會有些許誤差。</p><p>\n主審裁判都是依規則上，所訂定好球帶大小，進行好壞球判定。</p><p>\n但實際上仍會有，裁判個人喜好的好壞球位置。</p><p>\n打者與投手，就必須適應每一場比賽中，主審裁判好球帶的大小，來進行調整。</p><p>\n捕手也會影響好壞球的判定？\n會。</p><p>偷好球（Cather Framing），是捕手一項重要的接球技巧。</p><p>\n比賽過程中，捕手在接到，投手投出的球之後，會把手套往好球帶的位置移動。</p><p>\n藉此混淆主審裁判的判決，來增加好球的機率。</p><p>\n為什麼抗議好球帶，會被驅逐出場呢？\n好壞球判定，是主審裁判的自由心證，而且在中華職棒的棒球規則中，目前是沒有抗議的空間。</p><p>\n當雙方球隊，對於主審裁判的好球帶有意見時，', '40-2.jpg', '2022-11-14 01:03:05', '投球', '2', 1),
(40, '【棒球術語】', '棒球好球帶規則介紹｜九宮格的奧妙2', '<p>棒球好球帶有哪些實際案例呢？\n投手不滿，好壞球的判定…但仍留在場上\n影片中，富邦悍將投手江少慶，面對打者赫雷拉，投了一顆 7 號位置附近的直球，主審裁判認定為壞球。</p><p>\n投手江少慶，當下有出現較大不滿的行為，但最終裁判未將他驅逐出場。</p><p>\n捕手懷疑，好球帶判決\n影片中，富邦悍將投手曾峻岳，面對打者蘇智傑，連續投了兩顆 7 號位子的變化球，都被判定為壞球。</p><p>\n捕手張進德，疑似有出現不滿判決的聲音，而被主審裁判，直接驅逐出場。</p><p>\n打者不滿，好球帶判決\n影片中，中信兄弟打者陳子豪，與投手羅華韋的投打對決，最終被三振出局。</p><p>\n打者陳子豪不滿好壞球的判決，在被三振出局時，疑似發出不雅字眼，而被裁判驅逐出場。</p><p>\n投手不滿，好球帶判決\n影片中，味全龍投手布里悍，面對打者林承飛，投了一顆 3 號位置附近的直球，主審裁判認定為壞球。</p><p>\n布里悍接著投下一顆球時，被打者林承飛敲出安打時，投手當下不滿情緒、瞬間引爆。</p><p>\n大動作向主審裁判抗議，而被遭到驅逐出場。</p><p>\n總教練不滿好球帶判決\n影片中，義大犀牛投手林政賢，面對打者潘武雄，投了一顆 7 號位置附近的變化球，主審裁判認定為壞球。</p><p>\n義大犀牛時任總教練葉君璋，上場詢問主審好壞球的部分，而被直接驅逐出場。</p><p>\n捕手偷好球的接球方式\n影片中，可看到捕手完成接球時，手套順勢往好球帶的位置移動，來混淆主審裁判的判決。</p><p>\n棒球好球帶常見問題有哪些？\n	好球帶高度該怎麼看呢？\n以打者本身的身高，並依照下面兩項，來決定好球帶的高度：\n（1）最高點：打者肩膀上緣，到球褲上緣的中間點。</p><p>（以手軸為參考基準）\n（2）最低點：打者膝蓋下緣。</p><p>\n	好壞球出現誤判，可能有哪些因素？\n（1）捕手偷好球（Cather Framing）。</p><p>\n（2）主審裁判個人誤判。</p><p>\n	打者在好球帶的範圍被球丟到，不算觸身球嗎？\n不算。</p><p>\n只要投手投的球，有進到好球帶裡，都會被記為好球\n結論\n對於好球帶有什麼問題或想法，歡迎在下方留言，或許你所提供的資訊，也能幫助到其他人，解決他所遇到的問題。</p><p>。</p>', '40-3.jpg', '2022-11-14 05:10:20', '投球', '2', 1),
(41, '【棒球術語】', '棒球三振規則介紹｜為何打不到球呢？1', '<p>前言\n三振，屬於棒球術語之一。</p><p>\n那你知道什麼樣的狀況下，打者會被三振出局呢？三振能力對於投手來說，很重要嗎？\n本篇文章將依中華職棒棒球規則，整理有關於三振的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球三振規則基本介紹\n三振出局是什麼意思？\n投打對決中，出現第三顆好球時，打者揮棒落空或沒揮棒，就算是三振出局。</p><p>\n收看比賽轉播時，可聽到球評使用「 K」 或「老 K」的方式，來形容三振。</p><p>\n三振的第三顆好球，需要符合哪些條件？\n當投打對決，來到兩好球的球數時，投手投出第三顆好球，需要符合下面條件其中之一。</p><p>\n	球直接投進好球帶。</p><p>\n	好球，打者揮棒落空。</p><p>\n	壞球，打者揮棒落空。</p><p>\n	觸擊短打出界。</p><p>\n	打者擦棒被捕。</p><p>\n若打者出現擦棒界外球時，投手在帳面上的成績，會記錄為好球。</p><p>\n但對於當下的投打對決，仍會維持在兩好球的局面。</p><p>\n為何投手投出三振了，打者還沒出局呢？\n投打對決的過程中，當出現特殊狀況時，打者是有符合不死三振的條件。</p><p>\n當下守備方，就必須透過觸殺或封殺的方式，才能讓打者出局。</p><p>\n三振會怎麼紀錄呢？\n投手會有兩種三振打者的方式，分別以正 K 及倒 K 來顯示。</p><p>\n	K：打者揮棒落空。</p><p>\n	?：打者無揮棒，球進到好球帶。</p><p>\n三振次數最多的投手\n單一球季當中，累積投出最多三振的投手，能夠獲得三振王的殊榮。</p><p>\n三振之參考資料\n	三振英文：Starikeouts\n	奪三振率（K9值）英文：Strikeouts per Nine Innings\n	棒球規則：9.15\n奪三振率規則基本介紹\n奪三振率是什麼意思？\n用來計算，投手在一場比賽當中，平均投出多少次的三振。</p><p>\n數字越大，意味著投手的三振能力越好。</p><p>\n奪三振率怎麼計算呢？\nK/9 值 = K x 9 ÷ IP。</p><p>\n以下為此公式所代表的意思：\n	K：投手奪三振次數\n	IP：投手投球局數\n	9：以一場比賽 9 局為基準換算\n假設，計算出來 K/9 值為 9 的話，代表該投手，平均每一局，可以投出一次的三振。</p><p>\n高三振率的投球', '42-1.jpg', '2022-11-10 09:40:59', '投球', '2', 1),
(42, '【棒球術語】', '棒球三振規則介紹｜為何打不到球呢？2', '<p>棒球三振有哪些實際案例呢？\n打者未揮棒，站著不動被三振出局\n場上狀況：無人出局、無人在壘\n影片中，富邦悍將打者高國輝，面對投手銳力，投進好球帶的第三顆好球，未進行揮棒，而被好球三振出局。</p><p>\n打者揮棒落空，三振出局\n場上狀況：無人出局、無人在壘\n影片中，富邦悍將投手羅力，面對樂天桃猿的三位打者，接連讓打者揮空，第三顆好球，連續投出三次三振。</p><p>\n打者擦棒被捕，三振出局\n場上狀況：兩人出局、無人在壘\n影片中，統一7-ELEVEn獅打者陳傑憲，面對投手狂威投出內角變化球。</p><p>\n打者陳傑憲揮棒，雖有打到球，但球在落地之前，捕手已完成確實接捕，所以主審裁判認定為三振出局。</p><p>\n棒球三振有哪些常見問題呢？\n	為何投手投出三振了，打者還沒出局呢？\n投打對決的過程中，當出現特殊狀況時，打者是會符合不死三振的條件。</p><p>\n守備方，就必須透過觸殺或封殺的方式，才能讓打者出局。</p><p>\n	三振會怎麼紀錄呢？\n投手會有兩種三振打者的方式，分別會以正 K 及倒 K 來顯示。</p><p>\nK：打者揮棒落空。</p><p>\n?：打者無揮棒，球進到好球帶。</p><p>\n結論\n對於三振有什麼問題或想法，歡迎在下方留言，或許你所提供的資訊，也能幫助到其他人，解決他所遇到的問題。</p><p>\n有關其他棒球術語、規則、名詞及用語，可利用首頁右上角放大鏡的搜尋功能，相信會找到你所需要的問題答案。</p><p>。</p>', '42-2.jpg', '2022-11-10 02:20:59', '投球', '2', 1),
(43, '【棒球術語】', '棒球不死三振規則介紹｜死裡逃生的那個男人1', '<p>前言\n不死三振，屬於棒球術語之一。</p><p>\n為何打者都被三振了，還可以跑上一壘呢？不死三振的產生，又需要符合哪些條件呢？\n本篇文章將依中華職棒棒球規則，整理有關於不死三振的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球不死三振規則基本介紹\n不死三振是什麼意思？\n在特殊狀況下，打者被投手三振，但沒有出局，趁機跑上壘包。</p><p>\n打者當下已經被投手，投出的第三顆好球給三振。</p><p>\n但捕手沒有完成確實接捕，守備方就必須使用，觸殺或封殺的方式，才能夠讓打者出局。</p><p>\n不死三振條件之出局數與跑者關係\n對於進攻方來說，符合不死三振的基本條件如下：\n	兩人出局之前，一壘壘包上，不能有跑者。</p><p>\n	兩人出局之後，不限於壘包上有多少跑者。</p><p>\n為什麼要有不死三振？\n避免守備方在兩人出局前，刻意滿足不死三振的條件（捕手故意漏球），創造出一次抓兩個以上的出局數。</p><p>\n守備方為何會讓不死三振出現呢？\n投手投出，第三顆好球三振打者時，出現投手暴投或捕手捕逸，讓打者趁機跑上一壘壘包。</p><p>\n有時則會是，投捕之間暗號上的溝通，出現了問題。</p><p>\n不死三振對攻守雙方有何影響？\n出局數及壘包上跑者的增減。</p><p>\n一來一往之下，對於攻守雙方，影響相當可觀。</p><p>\n	進攻方 – 球隊增加了一個出局數，運用的空間，以及壘包上多了一位跑者。</p><p>\n	守備方 – 沒抓到該出局的打者，反倒投手必須在，多面對一位打者。</p><p>\n不死三振會如何紀錄呢？\n	進攻方 – 打者紀錄為三振出局。</p><p>\n	守備方 – 投手紀錄三振，會再加計投手暴投或捕手捕逸。</p><p>\n不死三振所導致的失分，算是投手自責分嗎？\n不一定。</p><p>\n簡單區分的方式，若是投手的問題，就會算是自責分，如：投手暴投、被安打、保送、投手牽制失誤等等…。</p><p>\n而其他的狀況，如野手失誤、捕手捕逸、妨礙打擊等等…，就不算是投手自責分。</p><p>\n	投手暴投 – 算自責分。</p><p>\n	捕手捕逸 – 不算自責分。</p><p>\n不死三振幫助球隊得分，會算打點嗎？\n不算。</p><p>\n可把不死三振，當作是守備失誤的一個環節。</p><p>\n單局四次三振的由來\n每一局不是只有三個出局數嗎？', '44-1.jpg', '2022-11-09 05:07:04', '投球', '2', 1),
(44, '【棒球術語】', '棒球不死三振規則介紹｜死裡逃生的那個男人2', '<p>不死三振有哪些實際案例呢？\n案例一、捕手未在第一時間，把球接進手套\n場上狀況：兩人出局、二壘有人\n影片中，中信兄弟打者岳政華，面對投手猛威爾投進好球帶的第三顆好球，沒有進行揮棒動作，遭到三振出局。</p><p>\n但捕手陳重羽在第一時間，未完成確實接捕，必須透過觸殺或封殺的方式，才能讓打者岳政華出局。</p><p>\n由於不死三振的當下，屬於活球狀態，所以二壘上的跑者周思齊，趁機跑回本壘得分。</p><p>\n案例二、投手暴投之不死三振\n場上狀況：兩人出局、無人在壘\n影片中，樂天桃猿打者梁家榮，面對投手王尉永投出之變化球、揮棒落空，遭到三振出局。</p><p>\n由於球進到捕手手套前、提前落地，又反彈到一旁，因此打者梁家榮，趁機跑上一壘，完成這次的不死三振。</p><p>\n案例三、投手單局 4K\n影片中，中信兄弟投手陳鴻文，面對義大犀牛的打者群，在第九局投出兩次的不死三振，創造出單局四次三振的紀錄。</p><p>\n案例四、不死三振還是觸身球？\n場上狀況：無人出局、無人在壘\n影片中，兄弟象打者張志豪，面對投手邦勝投出之近身球，打到鞋子的部分。</p><p>\n但因當下打者張志豪出棒過半，已被判定三振出局。</p><p>\n再加上球打到張志豪身上，比賽進入死球狀態，所以就失去符合不死三振的條件。</p><p>\n不死三振有那些常見問題呢？\n	為何一壘有跑者時，打者仍符合不死三振的條件呢？\n當兩人出局之後，就都符合不死三振。</p><p>\n	不死三振所導致的失分，算是投手自責分嗎？\n不一定。</p><p>\n（1）投手暴投 – 投手自責分\n（2）捕手捕逸 – 非投手自責分\n結論\n對於不死三振有什麼問題或想法，歡迎在下方留言，或許你所提供的資訊，也能幫助到其他人，解決他所遇到的問題。</p><p>\n有關其他棒球術語、規則、名詞及用語，可利用首頁右上角放大鏡的搜尋功能，相信會找到你所需要的問題答案。</p><p>。</p>', '44-3.jpg', '2022-11-09 07:01:02', '投球', '2', 1),
(45, '【棒球術語】', '棒球投手用球數規則介紹｜越投越帶勁！1', '<p>前言\n投手用球數，屬於棒球術語之一。</p><p>\n那你知道為何要記錄投手用球數嗎？難道控制好用球數，投手就不會受傷了嗎？\n本篇文章將依中華職棒棒球規則，整理有關於投手用球數的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球投手用球數規則基本介紹\n早期棒球在投手的使用上，較欠缺用球數限制的想法，再加上投手分工不明確。</p><p>\n讓許多陣中的王牌投手，不僅要擔任先發投手，還需兼任後援投手。</p><p>除了投球量多之外，相對也壓縮了休息時間。</p><p>\n以中華職棒初期為例，像是陳義信、黃平洋等人，都有這樣的出賽狀況。</p><p>而金臂人黃平洋的綽號，也是這樣來的。</p><p>\n投手用球數是什麼意思？\n用來統計投手，在正式比賽過程中，總共投出了多少顆球。</p><p>\n為何要記錄投手用球數呢？\n以利教練團進行投手調度。</p><p>\n教練必須控制投手的投球量，來應付短期賽事，或例行賽事中，球隊的投手使用需求。</p><p>\n進而分配每位投手的投球量，並適當安排休息時間，以保護投手。</p><p>\n投手如何降低用球數的消耗？\n積極進攻好球帶。</p><p>\n可簡單把投手類型區分成，飛球型、滾地球型及三振型，這幾種類型。</p><p>\n其中三振型的投手，在用球數會來的比較多。</p><p>有些投手甚至追求，極致進壘點的情況，反而造成不少的壞球出現。</p><p>\n熱身時的投球量，也會影響投手表現？\n會。</p><p>\n正常熱身的頻率及投球數，並不會有太大影響。</p><p>\n但出現較特殊的狀況時，就會增加投手熱身的需求，比賽情境如下：\n	先發投手 – 自家球隊進攻時間過長，或因雨暫停時間過長，先發投手必須增加熱身量，來維持身體的熱度。</p><p>\n	後援投手 – 場上投手狀況不穩時，必須在場邊熱身待命。</p><p>有時同場比賽，需反覆熱身好幾次。</p><p>\n球場上，投手用球數的顯示位置\n可區分為線上轉播（Pitches）及球場的電子看板（NP）。</p><p>\n投手討厭的打者型態之一\n消耗投手用球數。</p><p>\n不論打者是透過選球，或是把球頻繁的擊成界外球，都會造成投手的用球數增加。</p><p>\n投手用球數增加的情況，除了體力消耗之外，連帶影響到投手的球威及控球等等。</p><p>\n投手用球數之參考資料\n	投手用球數英文：Nu', '46-1.jpg', '2022-11-02 20:10:50', '投球', '2', 1),
(46, '【棒球術語】', '棒球投手用球數規則介紹｜越投越帶勁！2', '<p>棒球投手用球數有限制？\n為何要限制投手的用球數呢？\n降低受傷風險。</p><p>\n運動選手最害怕的，無疑是受傷了。</p><p>傷勢的出現，一定會影響到場上的表現，甚至無法上場比賽。</p><p>\n而投手用球數過量時，就容易造成投手傷勢的狀況發生。</p><p>\n投手用球數有限制嗎？\n職業棒球的賽事中，基本上不會有用球數上的限制。</p><p>\n先發投手用球數的限制是多少？\n因人而異。</p><p>投手出賽頻率及個人狀況，都會有不同的結果。</p><p>\n以下投手用球數的部分，為其他國家職棒 的參考值：\n	美國職棒：100 球 、投一休四\n	日本職棒：120 球 、投一休六\n為何先發投手用球數會這麼多？\n當場上的先發投手，用球數暴增時，通常都是下面這幾種狀況：\n	挑戰紀錄：無安打、完投完封、完全比賽。</p><p>\n	中止連敗：球隊處於連敗期間，若當天先發投手狀況好，就會負擔多一些局數。</p><p>\n	關鍵賽事：季後挑戰賽、總冠軍賽等等的短期賽事。</p><p>\n何時會特別控制投手用球數呢？\n較常看見投手用球數會被限制，有以下這三種狀況：\n	國際賽事 – 國際賽本身規定的用球數，或是球團要求需控制投球量。</p><p>\n	傷後回歸 – 循序漸進，逐步調整可承受比賽的強度。</p><p>\n	基層棒球 – 控制投球量，以確保選手獲得足夠之休息。</p><p>\n棒球投手用球數有哪些案例呢？\n案例一、投手 123 球完投完封比賽\n影片中，中信兄弟投手羅傑斯，對戰富邦悍將時，使用 123 球，完成一場完投完封的比賽。</p><p>\n案例二、投手 142 球無安打比賽\n影片中，統一7-ELEVEn獅投手猛威爾，對戰味全龍，使用 142 球，完成無安打比賽。</p><p>\n棒球投手用球數常見的問題有哪些？\n	投手休息天數比較多，就能夠多投一些球嗎？\n個人認為，不適合。</p><p>每多投一顆球，都必須承擔著受傷風險。</p><p>\n人體並非機器，機器運轉負載時，可停機維護、保養，甚至零件直接換新。</p><p>\n但投手受傷時，除了開刀、復健之外，在重返球場時，能否投出先前的身手，又是另外一回事了。</p><p>\n	投手在投手丘上，可以投多少球熱身呢？\n參考 CPBL 裁判執法手冊規則補述，簡單區分下面三種狀況：\n一、新換上來的投手：投手可進行 5 球的', '47-1.jpg', '2022-11-02 21:00:21', '投球', '2', 1),
(47, '【棒球術語】', '棒球滿球數規則介紹｜兩好三壞之正面對決', '<p>前言\n滿球數，屬於棒球術語之一。</p><p>\n那你知道滿球數是什麼意思嗎？滿球數對於投手或打者來說，誰又更佔優勢呢？\n本篇文章將依中華職棒棒球規則，整理有關於滿球數的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球滿球數基本規則介紹\n滿球數是什麼意思？\n兩好三壞。</p><p>\n棒球比賽過程中，投手與打者對決時，用來稱呼當下球數的狀況。</p><p>\n在收看線上球賽轉播時，可時常聽到球評使用「滿球數」，形容兩好三壞的情境。</p><p>\n溫馨提醒：文章中藍色字為超連結，有助於你對該名詞的理解。</p><p>\n滿球數對投手有何影響？\n體力上的消耗。</p><p>\n當投打對決來到滿球數時，就意味著，投手面對眼前這位打者，至少用了六顆球，才完成這一次的對決。</p><p>\n滿球數在兩出局後有何影響？\n當壘包上的跑者，處於強迫進壘狀態時，可趁著投手投球時，提前起跑，增加再進壘的機會。</p><p>\n滿球數常見的進攻戰術？\n打帶跑及跑帶打的戰術居多。</p><p>\n以下為戰術使用的情境：一壘有人、無人或一人出局\n	打帶跑：戰術成功，至少能把跑者推進至二壘得點圈。</p><p>\n	跑帶打：打者選擇好球進行攻擊（推進），壞球則放掉不打（保送）。</p><p>\n延伸閱讀：\n》【棒球D教室】棒球戰術｜新手必懂的基本規則\n棒球滿球數之參考資料\n	滿球數英文：full count\n棒球滿球數有哪些實際案例呢？\n案例一、滿球數，打者敲安打\n場上狀況：兩人出局、滿壘\n影片中，中信兄弟打者張志豪，面對投手陳正達投出的外角球，順勢把球推向左外野，形成二壘安打。</p><p>\n當下為兩人出局的狀況，所以壘包上跑者，在球打出去時，當下就進行跑壘動作。</p><p>\n可看到最後一位回來得分的跑者，相當輕鬆愜意。</p><p>\n案例二、滿球數，打者被三振\n場上狀況：兩人出局、滿壘\n影片中，富邦悍將打者李宗賢，與投手陳禹勳之投打對決，在滿球數的情況下，選擇放掉外角偏低的直球，最終被三振出局。</p><p>\n從畫面中可看出，最後一顆三振的好球，在好球帶附近，沒有選擇揮棒的情況下，就把決定權交給了主審裁判。</p><p>\n棒球滿球數常見的問題有哪些？\n	滿球數對打者還是投手有利呢？\n不一定。</p><p>\n這其中會有很多的因素影響著，像是比賽局數、雙方比數、壘上狀況、出局數、投打雙方', '48-1.jpg', '2022-11-01 03:00:05', '投球', '2', 1),
(48, '【棒球術語】', '棒球妨礙守備規則介紹｜到底是誰擋誰呢？1', '<p>前言\n妨礙守備，屬於棒球術語之一。</p><p>\n那你知道該如何判斷場上狀況，屬於妨礙守備呢？為何跑者都撞倒守備員了，還不算是妨礙守備呢？\n本篇文章將依中華職棒棒球規則，整理有關於妨礙守備的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球妨礙守備規則基本介紹\n妨礙守備的定義為何？\n影響到守備方守備的場上所有人員，包括進攻方、工作人員、場邊觀眾等等…。</p><p>\n當以上「這些人」出現妨礙守備時，比賽會進入死球狀態，由裁判依當下的狀況判決。</p><p>\n妨礙守備有哪幾種形式？\n	打者妨礙守備\n	跑者妨礙守備\n	裁判妨礙守備\n	觀眾妨礙守備\n	工作人員妨礙守備\n	壘指導員妨礙守備\n以下列出幾種，在比賽過程中，較為常見妨礙守備的情境：\n打者妨礙守備\n關於打者妨礙守備的狀況，簡單整理出下面四項：\n	揮棒後，打者離開打擊區時，身體碰觸到界內球。</p><p>\n	揮棒後，球棒被打者拋入場內，碰觸到場內的野手。</p><p>\n	揮棒後，球棒被打者拋入場內，碰觸到場內的球。</p><p>\n	揮棒後，棒頭去打到捕手身體，影響捕手進行傳球動作。</p><p>\n跑者妨礙守備\n關於跑者妨礙守備的狀況，簡單整理出下面四項：\n	違反一壘區的三呎線跑壘規則。</p><p>\n	壘上跑者，被打者擊出之球，打到身體。</p><p>\n	跑者跑壘時，碰觸到準備接球的野手。</p><p>\n	跑者刻意做出，影響守備員的動作。</p><p>\n裁判妨礙守備\n關於裁判妨礙守備的狀況，簡單整理出下面兩項：\n	裁判於界內區，被打者擊出之球打到身體。</p><p>\n	主審裁判，影響捕手傳球動作。</p><p>\n妨礙守備對進攻方有何影響？\n以下舉幾個較為常見的狀況：\n	跑者盜壘成功，但因打者妨礙捕手傳球，被要求回到原先的壘包上。</p><p>\n	打者跑向一壘時，跑在壘線內，影響守備方傳球，被裁判認定妨礙守備、出局。</p><p>\n	打者刻意揮棒，掩護壘上跑者推進，碰觸到捕手並影響傳球，被裁判認定妨礙守備、出局。</p><p>\n妨礙守備要裁判認定才算？\n是的。</p><p>\n裁判會依據當下的狀況，認定妨礙守備之形成，屬於故意還是非故意，再進一步做出判定結果。</p><p>\n為何出現妨礙守備，裁判卻沒判呢？\n只要當下的守備結果，對於守備方有利，那就不會被裁判認定為妨礙守', '49-1.jpg', '2022-10-28 05:04:01', '守備', '3', 1),
(49, '【棒球術語】', '棒球妨礙守備規則介紹｜到底是誰擋誰呢？2', '<p>棒球妨礙守備有哪些實際案例呢？\n案例一、打者跨出打擊區，影響捕手傳球\n場上狀況：一壘有人、兩人出局\n影片中，富邦悍將打者蔣智賢，面對投手陳虎投出之變化球，揮棒落空後，一壘跑者高國輝，成功盜上二壘。</p><p>\n但因打者蔣智賢揮棒後，踏出打擊區，影響到捕手陳家駒之傳球。</p><p>\n裁判認定打者蔣智賢的動作，構成妨礙守備，判定出局。</p><p>\n案例二、打者揮棒碰到捕手，影響捕手傳球\n場上狀況：一壘有人、兩人出局\n影片中，中信兄弟打者詹子賢，面對投手布魯斯之偏低變化球，揮棒落空後，一壘跑者王威晨，成功盜上二壘。</p><p>\n但因打者詹子賢揮棒時，棒頭去碰觸到捕手身體，影響到捕手林宥穎之傳球。</p><p>\n裁判認定打者詹子賢的動作，構成妨礙守備，故跑者盜壘不算，必須回到一壘壘包。</p><p>\n案例三、跑者與接球的野手擦撞\n場上狀況：一三壘有人、一出局\n影片中，中信兄弟打者彭政閔，面對投手力猛投出之變化球，打成二壘方向滾地球。</p><p>\n二壘手林威廷在接球的過程中，與跑者蔣智賢出現碰撞，裁判第一時間判定無妨礙守備。</p><p>\n經裁判現場開會討論過後，改判蔣智賢的跑壘行為，構成妨礙守備。</p><p>\n妨礙守備後之場上狀況：\n	打者彭政閔上一壘。</p><p>\n	原一壘跑者蔣智賢出局。</p><p>\n	回本壘得分的跑者林智勝，回到三壘壘包。</p><p>\n案例四、打者打出去的球，直接打到跑者\n場上狀況：二三壘有人、兩人出局\n影片中，義大犀牛打者林益全，面對投手陳鴻文投出之直球，打成游擊方向的滾地球。</p><p>\n在游擊手處理球之前，球先打到二壘往三壘跑的跑者高國輝，故形成妨礙守備，跑者高國輝被判定出局。</p><p>\n案例五、打者跑在一壘壘線內，影響守備方傳球\n場上狀況：無人出局、滿壘\n影片中，樂天桃猿打者林泓育，面對投手萊福力投出之外角直球，打成投手正面的滾地球。</p><p>\n投手萊福力接球後，傳向本壘封殺跑回本壘的跑者，再由捕手高宇杰轉傳至一壘。</p><p>\n但球卻傳到打者林泓育身上，一路滾到外野區。</p><p>因打者林泓育跑向一壘時，跑在一壘壘線的內側，故裁判認定妨礙守備。</p><p>\n除了原先三壘跑者出局之外，打者林泓育也因違反一壘跑壘規定，被判定出局。</p><p>\n案例六、打者完成打擊後，在打擊區外碰到球\n場上狀況：無人', '49-2.jpg', '2022-10-28 04:04:00', '守備', '3', 1),
(50, '【棒球術語】', '棒球強迫進壘規則介紹｜還傻傻地站在那做啥？', '<p>前言\n強迫進壘，屬於棒球術語之一。</p><p>那你知道強迫進壘是什麼意思嗎？為何比賽中，還會突然解除強迫進壘呢？\n本篇文章將依中華職棒棒球規則，整理有關於強迫進壘的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球強迫進壘規則基本介紹\n強迫進壘是什麼意思？\n強迫進壘，也有人稱之為「被迫進壘」，屬於棒球跑壘中，常用的一項跑壘規則。</p><p>\n簡單說，打者將球打出去之後，壘包上的跑者，必須往下一個壘包前進。</p><p>\n否則守備方透過守備配合，讓跑者在踏上壘包前，輕易地完成封殺出局。</p><p>\n以下為強迫進壘最基本的條件：\n	一壘壘包上，必須有跑者。</p><p>\n	打者打出去的球，必須先碰觸到地面。</p><p>\n另一種強迫進壘的狀況\n當打者的打擊結果，出現保送、觸身球、妨礙打擊等等…，依棒球規則來看，打者可直接站上一壘。</p><p>\n若此時壘包有跑者時，則會適用強迫進壘的規則，往下一個壘包前進。</p><p>\n強迫進壘的適用情境\n一壘、一二壘、滿壘有跑者時的局面。</p><p>\n無視強迫進壘有什麼影響嗎？\n守備方，除了能輕易抓到跑者，形成出局數之外，也有利於進行雙殺守備的配合。</p><p>\n強迫進壘對守備方有何好處？\n野手在守備過程中，可依據當下的守備狀況，可選擇最近的壘包，進行封殺的動作。</p><p>\n除了縮短傳球距離之外，也降低了守備失誤的機率。</p><p>\n舉個最常見的例子，當一壘壘包有跑者時，打者擊出二壘或游擊方向的滾地球，野手可直接選擇封殺，一壘往二壘跑的跑者。</p><p>\n守備方為何故意製造強迫進壘局面？\n整體守備的戰術考量，選擇故意四壞球保送當前打者。</p><p>\n基本上會考量以下條件，如：比賽局數、出局數、雙方比數、打者棒次、打者近況等等…。</p><p>\n這邊以一人出局的狀況，列出幾個常見情境：\n	二、三壘有跑者：保送打者、形成滿壘局面。</p><p>所有壘包都處於強迫進壘，內野手接球時，可選擇任何一個壘包，進行封殺動作，或進行雙殺守備。</p><p>\n	三壘有跑者：保送打者、形成一三壘局面。</p><p>配合守備佈陣，依野手接球的位置，選擇雙殺守備或阻止三壘跑者回本壘得分。</p><p>\n強迫進壘之參考資料\n	棒球規則：5.09\n棒球強迫進壘有哪些實際案例呢？\n案例一、強迫進壘之雙殺打\n場上狀況：一', '51-1.jpg', '2022-10-24 01:08:01', '守備', '3', 1),
(51, '【棒球術語】', '棒球死球狀態規則介紹1', '<p>前言\n死球狀態，屬於棒球術語之一。</p><p>那死球狀態指的是？對於攻守雙方會有什麼影響嗎？\n本篇文章將依中華職棒棒球規則，整理有關於死球狀態的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球死球狀態規則基本介紹\n死球狀態是什麼意思？\n比賽暫停，也常用「比賽停止球」來稱呼。</p><p>\n當棒球比賽進入死球狀態時，通常是由裁判主動喊出暫停，或是裁判同意教練、球員，所提出暫停之要求。</p><p>\n除了上述之暫停之外，棒球規則也有明訂，進入死球狀態的其他條件。</p><p>\n常見的死球狀態的因素有哪些？\n	裁判喊暫停（Time）\n	觸身球\n	打者自打球\n	投手犯規\n	妨礙守備、妨礙打擊、妨礙跑壘\n	落地之界外球\n	球進入死球區\n死球狀態之參考資料\n	死球狀態英文：Dead ball\n	棒球規則：5.01、5.03、5.06、5.09\n	CPBL 裁判執法手冊規則補述：4.02、4.03、5.01\n棒球死球狀態與跑者的有何關係？\n參考 CPBL 裁判執法手冊規則補述 4.02【比賽進行球進入死球區給壘之規定】，整理後並簡述以下內容。</p><p>\n當球場上出現特定狀況時，球又剛好進入到死球區，那壘上跑者就能依規定，往下一個壘包前進。</p><p>\n那要如何認定跑者，該從哪個壘包開始前進呢？簡單區分成下面兩項：\n	投手投球時，跑者當下所站的壘包。</p><p>\n	野手傳球時，跑者當下所站的壘包。</p><p>\n跑者免費前進一個壘包\n以投手投球時之壘包開始算起\n1.	投手於投手板上，投球或牽制時，形成暴傳。</p><p>\n2.	打者擊出內野區的球，掉進野手衣服裡。</p><p>\n3.	野手完成接球後，再踏入死球區。</p><p>\n4.	投手投球時，卡於捕手或主審的面罩，或掉入裝備、衣服裡。</p><p>\n以野手傳球時之壘包開始算起\n	野手進行傳球或觸殺，球掉進野手或跑壘員衣服裡。</p><p>\n跑者免費前進兩個壘包\n以投手投球時之壘包開始算起\n1.	投手退開投手板，牽制形成暴傳。</p><p>\n2.	內野手一開始處理球之守備行為，傳入死球區。</p><p>\n3.	界內球彈入死球區。</p><p>\n4.	飛球於界內，被野手碰出觀眾席。</p><p>\n5.	野手處理界內球，遭觀眾妨礙。</p><p>\n6.	投手暴投球滾於本壘後，再經捕', '52-1.jpg', '2022-10-22 07:04:10', '投球', '2', 1),
(52, '【棒球術語】', '棒球死球狀態規則介紹2', '<p>棒球死球狀態有哪些實際案例？\n案例一、野手接殺飛球後，跌入死球區\n影片中，味全龍打者林威廷，與投手陳柏豪的投打對決中，擊出一壘側界外飛球，遭一壘手許基宏接殺出局。</p><p>\n許基宏在接殺後，立即將球傳至二壘，抓到企圖往二壘推進的跑者蔣少宏，完成雙殺守備。</p><p>\n但經裁判開會討論過後，因許基宏完成接殺後，一隻腳踏入死球區（攝影席），故以死球狀態的規則判定，壘上跑者應往前推進一個壘包。</p><p>\n案例二、打者擊出之球，打中二壘審\n影片中，中信兄弟打者岳東華，與投手賴鴻誠的投打對決，擊出二壘方向的強勁滾地球，不偏不倚的打中二壘審。</p><p>\n依棒球規則及補述之規範，當打者擊出之球打中裁判時，將進入死球狀態。</p><p>\n打者岳東華直接上一壘，其他跑者則須留在原本的壘包上。</p><p>\n另外，原先一壘的跑者，因強迫進壘關係，故前進至二壘，形成滿壘的局面。</p><p>\n案例三、球卡在全壘打牆下方\n影片中，富邦悍將打者林哲瑄，面對投手福瑞投出之直球，擊出中右外野的落地安打，球一路滾到全壘打牆下方停住。</p><p>\n第一時間處理球之外野手認為，球已經卡在全壘打牆下方，並向裁判示意。</p><p>\n經裁判開會討論後，判定球已進入死球區，故原先打者林哲瑄的場內全壘打，改判為場地規則二壘安打。</p><p>\n案例四、全壘打牆反彈球\n影片中，富邦悍將打者陳品捷，面對投手賽格威投出之直球，擊出中右外野之落地安打。</p><p>\n球在第一時間彈出全壘打牆之外，接著又彈回球場內，屬於場地規則二壘安打，當下已形成死球狀態。</p><p>\n故能從影片中，看出當球回彈時，裁判已比出判決手勢，守備方之外野手，則放棄後續的守備動作。</p><p>\n案例五、觸身球還是不死三振？\n影片中，兄弟象打者張志豪，面對投手邦勝投出之近身球，打中鞋子。</p><p>\n但因打者張志豪出棒過半的關係，主審裁判直接判定三振出局。</p><p>\n這個 Play 必須先以打者，是否有出棒來判定好壞球，其次再考量到觸身球的部分。</p><p>\n	好球或出棒過半：打者三振出局。</p><p>因球丟到打者身上，處於死球狀態，故失去不死三振之條件。</p><p>\n	壞球或未出棒：打者觸身球保送。</p><p>\n棒球死球狀態之常見問題\n	活球狀態跟死球狀態差別在哪裡？\n活球狀態（Play）= 比賽', '52-2.jpg', '2022-10-22 05:10:20', '投球', '2', 1),
(53, '【棒球術語】', '棒球活球狀態規則介紹', '<p>前言\n活球狀態，屬於棒球術語之一。</p><p>\n那你可知棒球場上的活球狀態，代表著什麼意思呢？當球打中跑者時，也算是活球狀態嗎？\n本篇文章將依中華職棒棒球規則，整理有關於活球狀態的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球活球狀態規則基本介紹\n活球狀態的定義為何？\n比賽進行中。</p><p>\n棒球比賽必須進入活球狀態時，才算是比賽開始。</p><p>由球場上的裁判來決定，比賽開始及暫停的各個時機點。</p><p>\n活球狀態在場上發生的攻守行為，才會被認可，包含投手投球、打者打擊、跑者跑壘…等等。</p><p>\n什麼時候算是活球狀態？\n由主審裁判喊 Play（比賽開始）到 Time（比賽暫停）這段期間，都屬於活球狀態。</p><p>\n反之，從 Time 到 Play 的這段期間，則屬於死球狀態。</p><p>\n容易混淆的活球狀態？\n像是觸身球、四壞球保送、不死三振等等的狀況，容易讓對於棒球規則不熟悉的球迷，混淆活球及死球狀態的差別。</p><p>\n以下簡述不同投打結果之比賽狀態：\n	觸身球 – 屬於死球狀態。</p><p>因球已碰觸到打者身體，改變了球的軌跡，造成守備方無法掌握球的方向及位置。</p><p>\n	四壞球保送 – 屬於活球狀態。</p><p>若投手投出暴投時，打者及跑者可趁著守備方處理球，往下一個壘包再推進。</p><p>\n	不死三振 – 屬於活球狀態。</p><p>打者揮空第三顆好球，而捕手未確實接捕，打者則可趁機跑上一壘。</p><p>\n為何投手投出的好球不算數？\n裁判喊出暫停（Time）。</p><p>\n若場上投手的投球節奏太慢時，打者會向主審裁判要求暫停，或是主審本身主動喊出暫停。</p><p>\n當裁判喊出暫停時，投手隨即投出的任何球，均無效。</p><p>\n球打中跑者算是活球狀態嗎？\n不一定。</p><p>\n這需要視比賽當時局面來判定，以下舉兩個常見的狀況：\n	壘包上跑者，被打者打出去的球擊中身體，算是妨礙守備的行為，跑者將自動出局，屬於死球狀態。</p><p>\n	壘包上跑者，被守備方之傳球擊中身體，跑者若無違反跑壘規則時，屬於活球狀態。</p><p>\n活球狀態之參考資訊\n	活球狀態英文：Live Ball\n	棒球規則：5.01、6.01\n	CPBL 裁判執法手冊規則補述：5.03\n棒球活球狀態有哪些實際案', '54-1.jpg', '2022-10-20 05:40:10', '投球', '2', 1),
(54, '【棒球術語】', '棒球促請裁決規則介紹｜裁判大人來評評理', '<p>前言\n促請裁決，屬於棒球術語之一。</p><p>守備方可在特定狀況下，針對進攻方疑似出現的違規事項，進行申訴動作。</p><p>\n哪些情況下是可以提出申訴呢？是否守備方有任何疑慮時，都適用促請裁決呢？\n這篇文章將依中華職棒棒球規則，整理有關於促請裁決的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球促請裁決規則基本介紹\n什麼是促請裁決？\n棒球比賽中，當守備方進行防守過程時，發現進攻方疑似出現，特定違規的事項，可依棒球規定的程序，向裁判提出「促請裁決」之需求。</p><p>\n裁判會依當下所看到的結果，進行裁定，維持原判或判定進攻方出局。</p><p>\n這項棒球規則較特別的地方是，關於促請裁決的部分，必須由守備方主動提出才算數，若沒提出，就算進攻方違規也不會有影響。</p><p>\n另外，裁判並不能針對這些促請裁決的項目，直接進行判決動作，這也算是棒球規則裡，還蠻特別的一個點…。</p><p>\n促請裁決有哪些項目？\n	跑者未完成再觸壘。</p><p>\n	【棒球規則 5.09(c)(1)】\n	跑者漏踩壘包。</p><p>\n	【棒球規則 5.09(c)(2)】\n	跑離一壘或滑離一壘壘包。</p><p>\n	【棒球規則 5.09(c)(3)】\n	跑者漏踩本壘。</p><p>\n	【棒球規則 5.09(c)(4)】\n	打擊順序錯誤。</p><p>\n	【棒球規則 6.03(b)】\n如何向裁判提出促請裁決？\n這個環節，將以跑壘面的促請裁決做說明。</p><p>\n守備方必須在上一個 Play 結束時，由主審裁判恢復比賽、進入活球狀態，守備方才能向裁判提出，促請裁決之需求。</p><p>\n以下為壘包攻防時，使用「促請裁決」需符合及注意之項目：\n	比賽進入活球狀態。</p><p>\n	投手面對下一位打者，投出第一球之前，以及不能進行任何守備行為，否則會失去促請裁決之權力。</p><p>\n	投手出現投手犯規，則失去促請裁決之權力。</p><p>\n	守備方出現暴傳球時，若屬於活球狀態，並未出現其他守備行為，仍保有促請裁決之權力。</p><p>\n	守備方出現暴傳球時，若屬於死球狀態，則失去促請裁決之權力。</p><p>\n	另外，針對跑者漏踩本壘的部分，捕手可直接持球觸殺（tag），或向裁判提出促請裁決之需求。</p><p>\n	至於，打擊順序錯誤之促請裁', '55-1.jpg', '2022-10-19 07:10:20', '知識', '5', 1),
(55, '【棒球術語】', '棒球確實接捕規則介紹｜球進到手套了嗎？1', '<p>前言\n確實接捕，屬於棒球守備時的一種動作。</p><p>但在什麼樣的情況下，裁判才認定野手確實把球接住了呢？\n本文章內容將確實接捕，區分為一般野手接捕，以及捕手接捕，這兩個項目來做說明。</p><p>\n依中華職棒棒球規則，整理有關於確實接捕的資訊及案例，並加上個人見解，與您分享。</p><p>\n野手確實接捕規則之基本介紹\n確實接捕是什麼意思？\n確實接捕，屬於棒球術語之一。</p><p>\n指野手面對打者所擊出之飛球，完成接殺的動作（手套或手），又或是野手進行傳接球的守備配合。</p><p>\n可區分為飛球接殺、投手投出三振的第三顆好球，以及野手進行守備時，傳接球的封殺或觸殺。</p><p>\n關於確實接捕之接殺出局\n棒球比賽過程中，守備方之野手，面對打者所擊出的飛球，用手或手套，完成接殺的動作。</p><p>\n又或是無法第一時間完成接殺，但在球落地之前，完成確實接捕的動作，仍算是接殺出局。</p><p>\n以下為野手確實接捕之接殺，常見情境：\n	A 野手直接將飛球，用手或手套接住。</p><p>\n	A 野手在接飛球時，球第一時間從手套中彈出，但在落地前將球接住。</p><p>\n	A 野手在接飛球時，球第一時間沒完成確實接捕，由 B 野手在球落地之前，將球接住。</p><p>\n	飛球打到 A 野手身上，球在落地之前，由 B 野手將球接住。</p><p>\n關於確實接捕之傳接球守備動作\n棒球比賽過程中，守備方之野手，在接到隊友傳球後，進行封殺或觸殺的動作。</p><p>\n以下為野手確實接捕之封殺或觸殺，常見情境：\n	封殺：野手掌握住球以後，比跑者先一步碰觸到壘包。</p><p>\n	觸殺：野手掌握住球以後，以持球之手套或手，觸碰到跑者身上的任一處，且沒出現掉球的情形。</p><p>\n怎樣不算是確實接捕？\n依棒球規則及 CPBL 執法裁判手冊規則補述，除了前面提到確實接捕的情況，若未完成確實接捕，打者或跑者則會算是安全上壘。</p><p>\n以下為「非」確實接捕的情境：\n	野手使用手或手套以外的部位接球。</p><p>如：帽子、頭盔、護具、口袋或制服。</p><p>\n	野手碰觸到飛球後，球彈至裁判或對手身上，在落地前完成接殺，也不算是確實接捕。</p><p>\n	野手接到球後，撞到全壘打牆或與其他隊友相撞，導致球掉出來，也不算是確實接捕。</p><p>\n第二動作指', '56-1.jpg', '2022-10-12 08:10:20', '守備', '3', 1),
(56, '【棒球術語】', '棒球確實接捕規則介紹｜球進到手套了嗎？2', '<p>確實接捕相關案例\n案例一、常見的確實接捕球\n影片中，味全龍隊的一壘手林智勝，面對打者辛元旭擊出之平飛球，在球未落地前接進手套，完成確實接捕，形成接殺出局。</p><p>\n案例二、接球後掉球之第二動作\n影片中，樂天桃猿的左外野手邱丹，面對打者李聖裕擊出之左外野飛球。</p><p>\n在接完球之後，順勢將球從手套中拿出來，準備進行回傳的動作，但球卻在同時掉了出來。</p><p>\n裁判認定邱丹並沒有完成確實接捕，所以判定打者安全上壘。</p><p>但從慢動作重播來看，其實是有判定確實接捕的空間。</p><p>\n案例三、擦棒被捕之三振出局\n影片中 00:48-01:12，味全龍的打者蔣少宏，面對投手陳禹勳所投出的第三顆好球，雖球棒有擦到球皮。</p><p>\n但被捕手嚴宏鈞直接接進手套裡，完成擦棒被捕球，打者三振出局。</p><p>\n案例四、捕手未完成確實接捕\n影片中，兄弟象打者郭健瑜，面對投手雷力在兩好球後，投出的球揮棒落空。</p><p>\n因球提前落地的情況下，捕手無法完成確實接捕，必須使用觸殺或封殺的方式，才能讓跑者出局。</p><p>\n而球滾太遠的因素，郭健瑜趁機跑上一壘，完成這次的不死三振。</p><p>\n案例五、衣服接球\n影片中，富邦悍將投手陳明軒，面對打者林承飛所打出的強勁平飛球，不偏不倚的，跑進陳明軒的衣服裡。</p><p>\n依棒球規定來看，這顆球會判定為一壘安打，並當下為比賽停止球。</p><p>\n棒球確實接捕常見的問題有？\n外野手準備接球時，球卻跑進衣服裡\n參考 CPBL 裁判執法手冊規則補述 4.02(B)(1)(f)。</p><p>\n無論球是直接飛進外野手的衣服裡，又或是落地反彈後跑進衣服裡，都會判定打者為二壘安打，並為比賽停止球。</p><p>\n當球卡在手套裡時，那該怎麼算？\n參考 CPBL 裁判執法手冊規則補述 4.04(C)。</p><p>\n只要野手掌握住手套（含球），那就算完成確實接捕，可進行觸殺或封殺的動作。</p><p>\n結論\n對於確實接捕有什麼問題或想法，歡迎在下方留言，說不定你的想法，也能幫助到其他人。</p><p>。</p>', '57-1.jpg', '2022-10-12 09:10:20', '守備', '3', 1),
(57, '【棒球術語】', '棒球高飛犧牲打規則介紹｜外野高飛球有這麼好打嗎？1', '<p>前言\n高飛犧牲打，屬於棒球進攻時的一種方式。</p><p>不過你知道什麼樣的情境下，才算是高飛犧牲打呢？\n這篇文章將依中華職棒棒球規則，整理有關於高飛犧牲打的資訊及案例，並加上個人見解，與您分享。</p><p>\n高飛犧牲打規則介紹\n什麼是高飛犧牲打？\n高飛犧牲打，屬於棒球術語之一。</p><p>進攻方在特定的情境下，由打者擊出外野高飛球，雖會被野手接殺出局，但壘包上的跑者，能趁機跑回本壘得分。</p><p>\n高飛犧牲打使用情境\n	適用對象：二壘或三壘的跑者（三壘為主）。</p><p>\n	出局數：無人出局或一人出局。</p><p>\n	投打狀況：外野界內飛球或界外飛球。</p><p>\n高飛犧牲打相關資訊\n	棒球規則：5.05、5.06、5.08、6.01\n	高飛犧牲打代號：sacrifice flies\n	高飛犧牲打英文：SF\n高飛犧牲打起跑時機\n跑者必須在野手確實接捕後，才能離開原先的壘包，往本壘方向進行跑壘的動作。</p><p>\n若出現提早離壘的狀況，則是有可能被對方提出促請裁決，因違反再觸壘的規定，而被判定出局。</p><p>\n高飛犧牲打紀錄怎麼看？\n高飛犧牲打，在棒球紀錄上，相對比較特別一些，對於打者的相關紀錄如下：\n	打席 – 計算（增加）\n	打數 – 不計算\n	打點 – 計算（增加）\n	打擊率 – 不計算\n	上壘率 – 計算（下降）\n為何高飛犧牲會被稱之為基本功呢？\n基本功的說法，個人過去是從棒球球評轉播球賽時，所得知的。</p><p>為何球評會這樣說呢？\n我認為會有這樣的說法，比起要打者擊出安打來說，把球打成高飛球的難度，相對降低許多。</p><p>\n但實際要打成外野飛高球時，似乎並沒有想像的這麼容易。</p><p>尤其當三壘跑者是比賽的關鍵分數時，除了打者本身有壓力之外，投手投起球來，也會格外小心。</p><p>\n一來一往之下，高飛犧牲打的難度，也就在這種局面下，隨之提高。</p><p>\n高飛犧牲打該如何定義？\n壘包上的跑者，能靠著打者所擊出的外野高飛球，在被接殺之後，回到本壘得分。</p><p>\n若出現外野高飛球，只能將跑者往下一個壘包推進，並非得分的情況，那就僅算是一般高飛球出局，不符合高飛犧牲打的要求。</p><p>\n守備失誤也算是高飛犧牲打？\n當外野手接球失誤時，也會算是高飛犧牲打嗎？\n符合高飛犧牲打的基本條件，紀錄組', '58-1.jpg', '2022-10-10 08:08:08', '打擊', '1', 1),
(58, '【棒球術語】', '棒球高飛犧牲打規則介紹｜外野高飛球有這麼好打嗎？2', '<p>高飛犧牲打相關案例\n案例一、二壘跑者回本壘得分\n影片中，中信兄弟在二壘有人、一出局的情境，打者周思齊將球打向中右外野的深遠飛球，遭到中外野手郭天信接殺。</p><p>\n因郭添信在接球過程中，撞到全壘打牆，必須倚靠隊友協助將球回傳，而拉長了回傳球的時間，最終讓二壘上的陳子豪，直接從二壘跑回本壘得分。</p><p>\n周思齊在紀錄上，仍算是一支高飛犧牲打，帶有一分打點。</p><p>\n案例二、三壘回本壘得分\n影片中 01：06，統一7-ELEVEn獅在二三壘有人、一出局的情境，打者潘傑楷擊出右外野飛球，遭到右外野手王正棠接殺後，三壘跑者陳傑憲跑回本壘得分，由潘傑楷完成這次的高飛犧牲打。</p><p>\n案例三、三壘跑者回本壘出局\n影片中，味全龍在一三壘有人、無人出局的情境，打者郭天信擊出右外野的平飛球，遭到右外野手林書逸接殺，接著順勢將球回傳至本壘，跑者先一步回到本壘得分。</p><p>\n經中信兄弟挑戰之後，裁判改判為跑者蔣少宏出局，得分不算。</p><p>除了右外野手林書逸回傳快又準之外，加上三壘跑者蔣少宏的跑壘速度偏慢，才有機會完成這次的長傳助殺。</p><p>\n案例四、促請裁決\n影片中，統一7-ELEVEn獅在三壘有人、一人出局的情境，打者唐肇廷擊出中外野飛球，遭中外野手詹子賢接殺出局後，三壘跑者林佑樂跑回本壘得分，由唐肇廷完成這次的高飛犧牲打。</p><p>\n中信兄弟認為，跑者有提早離壘的嫌疑，進行促請裁決的動作，最終三壘裁判判定正常離壘，跑者得分照算。</p><p>\n案例五、界外飛球之高飛犧牲打\n影片中 00：56，味全龍在三壘有人、一出局的情境，打者蔣少宏擊出左外野界外飛球，遭左外野手江亮緯接殺出局後，三壘跑者董秉軒跑回本壘得分，由蔣少宏完成這次的高飛犧牲打。</p><p>\n結論\n對於高飛犧牲打有什麼問題或想法，歡迎在下方留言，說不定你的問題，正是其他人也想問的。</p><p>。</p>', '58-2.jpg', '2022-10-10 07:07:07', '打擊', '1', 1),
(59, '【棒球術語】', '棒球再觸壘規則介紹｜進退兩難的尷尬局面？', '<p>前言\n這篇文章將以棒球術語及名詞，來解釋有關於棒球跑壘的內容，協助棒球入門的新朋友，也能一個人看懂場上的狀況。</p><p>\n以下內容會使用實際比賽的案例作為輔助，加強您對規則的認知及理解。</p><p>\n再觸壘之跑壘規則基本介紹\n再觸壘是什麼意思？\n再觸壘，屬於棒球規則跑壘的其中一項，當比賽出現特定情境時，跑者須回到原先的壘包上，使用身體的任何一處（手或腳），碰觸到原本的壘包。</p><p>\n再觸壘使用情境\n	對象：壘上的所有跑者。</p><p>\n	出局數：無人出局、一人出局。</p><p>\n	投打狀況：打者界內飛球或界外飛球接殺。</p><p>\n跑者「完成」再觸壘\n當跑者完成再觸壘的動作時，則解除封殺狀態。</p><p>跑者可判斷球場上的狀況，留在原壘包上或選擇往下一個壘包推進。</p><p>\n跑者「未完成」再觸壘\n當跑者未完成再觸壘時，當下壘包是處於封殺狀態。</p><p>只要野手早一步持球碰到壘包，跑者則會算是封殺出局。</p><p>\n再觸壘相關資訊\n	棒球規則：5.09\n	再觸壘英文代號：Retouch\n再觸壘有哪些實際案例呢？\n案例一、雙殺守備（Double play）\n影片中，在一壘有人、一出局的情況，投手江少慶面對打者王威晨擊出的平飛球，接殺出局後，把球傳給一壘手，讓一壘跑者回壘不及出局。</p><p>\n原先一壘壘包的跑者岳政華，只是正常的離壘，但因強勁平飛球被接殺的情況下，來不及回到一壘，進行「再觸壘」的動作，而形成封殺出局。</p><p>\n案例二、促請裁決（Appeal）\n影片中，在三壘有人、一出局的情況，打者唐肇廷擊出中外野飛球，在中外野手接殺後，三壘上的跑者順勢回到本壘得分，完成高飛犧牲打。</p><p>\n而防守方的中信兄弟，向三壘進行促請裁決，裁判認定跑者並沒有提前離壘，判定 SAFE。</p><p>\n若裁判判定跑者提前離壘，則跑者會違反「再觸壘」的規則，得分不算。</p><p>\n案例三、提前起跑之戰術使用\n影片中，在一三壘有人、一出局的情況，打者辛元旭打向三壘前的強勁平飛球，遭到三壘手王威晨接殺，再傳向一壘，抓到一壘提前起跑的跑者，完成雙殺守備。</p><p>\n在兩人出局之前，跑者提前起跑的戰術，最怕打者出現平飛球被接殺，因為跑者幾乎沒有機會，回到原先的壘包上，進行「再觸壘」的動作。</p><p>\n案例四、深遠高飛球再進壘', '60-1.jpg', '2022-10-06 11:11:11', '守備', '3', 1),
(60, '【棒球用語】', '棒球自打球規則介紹｜多麼痛的領悟', '<p>前言\n自打球，棒球用語的一種。</p><p>\n你知道自打球，打到身上的感覺嗎？為何一個自打球，會讓球員出現嚴重傷勢呢？\n本篇文章將依，中華職棒棒球規則，整理有關於自打球的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球自打球規則基本介紹\n自打球是什麼意思？\n球，打到打者自己。</p><p>\n打者在打擊區，揮棒打到球之後，第一時間反彈到自己身上，稱之為「自打球」。</p><p>\n自打球會如何記錄？\n好球一顆。</p><p>\n若球數來到兩好球時，打者再打出的自打球，仍會維持在兩好球的局面。</p><p>\n另外，當出現自打球時，球無論在界內區或界外區，都會進入死球狀態。</p><p>\n自打球對打者有何影響？\n疼痛感，還可能出現嚴重傷勢。</p><p>\n大多數打者，都會選擇穿戴護腿，來降低自打球，造成受傷的風險。</p><p>\n而打者最怕自打球打到，膝蓋附近的位置。</p><p>除了沒有護具保護之外，相對肌肉也比較少一些。</p><p>\n自打球可以進行挑戰嗎？\n可以。</p><p>\n若裁判第一時間無法判定，打者是否為自打球時，球隊是可提出電視重播輔助判決。</p><p>\n自打球之參考資料\n	聯盟規章：第九章 45 條（10）\n棒球自打球有哪些實際案例呢？\n自打球 – 球員場邊治療\n影片中，味全龍打者郭天信，與投手郭俊麟的投打對決中，在一個打席裡面，出現了兩次的自打球。</p><p>\n兩次自打球，都打在膝蓋附近。</p><p>可看出打者郭天信，相當的痛苦。</p><p>\n立即進行初步的治療後，仍選擇繼續站上打擊區，繼續比賽。</p><p>\n自打球 – 電視重播輔助判決\n影片中，中信兄弟打者王威晨，與投手豪勁的投打對決中，打成一壘方向滾地球，遭到野手刺殺出局。</p><p>\n裁判們第一時間，並未做出自打球的判決，所以中信兄弟提出，電視重播輔助判決。</p><p>\n經即時重播檢閱小組確認後，仍維持原判、打者刺殺出局。</p><p>\n自打球 – 打中頭盔\n影片中，樂天桃猿打者成晉，與投手林逸達的投打對決中，打出本壘後方的界外飛球，被捕手確實接捕。</p><p>\n但主審裁判，第一時間認定為自打球。</p><p>因打者揮棒後，球先碰到頭盔，所以接殺不算。</p><p>\n棒球自打球的常見問題有哪些？\n	自打球會如何記錄？\n好球一顆。</p><p>\n若球數來到兩好球時，', '61-1.jpg', '2022-11-16 12:12:12', '打擊', '1', 1),
(61, '【棒球用語】', '棒球球數規則介紹｜一顆好壞球定勝負1', '<p>前言\n球數，屬於棒球用語之一。</p><p>\n那你知道球數領先及落後，所代表的意思嗎？為何一顆好壞球的差別，卻有著極大的影響力呢？\n本篇文章將依中華職棒棒球規則，整理有關於球數的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球球數規則基本介紹\n球數是什麼意思？\n紀錄比賽過程中，好球與壞球的部分，及用來形容比賽情境的一種說法。</p><p>\n平時可從收看轉播賽事，從主播或賽評播報時使用，不同球數下，形容當下投打對決的狀況。</p><p>\n如何區分好壞球呢？\n主審裁判依照好球帶的範圍，來判定投手投出的球，屬於好球或壞球。</p><p>\n打者若有揮棒或出棒過半的行為，無論球有無通過好球帶，都會被判定為好球。</p><p>\n如何區分球數領先及落後呢？\n不同好壞球的球數下，有時對打者有利，有時則讓投手位居上風。</p><p>\n當打者處於球數領先時，也就意味著投手處於球數落後。</p><p>\n好壞球，總共有 12 種組合。</p><p>以下列出「球數領先」的球數組合。</p><p>\n	投手領先：1 好 0 壞、2 好 0 壞、2 好 1 壞、2 好 2 壞。</p><p>\n	打者領先：0 好 1 壞、0 好 2 壞、0 好 3 壞、1 好 2 壞、1 好 3 壞。</p><p>\n打者球數領先及落後的差別\n	球數領先：打者可縮小好球帶，鎖定想進攻的球種。</p><p>\n	球數落後：打者需放大好球帶，被迫揮擊較難打的球。</p><p>\n投手球數領先及落後的差別\n	球數領先：投手可靈活配球，擾亂打者節奏。</p><p>\n	球數落後：投手容易出現失投球，被打者鎖定。</p><p>\n球數「絕對」領先及落後\n	打者球數絕對領先（0 好 3 壞）：\n	打者通常會等一顆球，少部分打者，會選擇積極進攻。</p><p>\n	打者球數絕對落後（2 好 0 壞）：\n	打者放大好球帶，避免被好球帶邊緣的球給三振，但相對容易追打壞球。</p><p>\n	投手球數絕對領先（2 好 0 壞）：\n	更多配球及引誘球的空間可運用，來與打者周旋。</p><p>\n	投手球數絕對落後（0 好 3 壞)：\n	需要將球投入好球帶，否則會直接保送打者，但相對容易出現比較好打的球。</p><p>\n球數領先卻…沒把握住機會\n當球數領先時，不論對於投手或打者，都會具有一定的優勢存在，但並非每', '62-1.jpg', '2022-11-03 18:08:08', '投球', '2', 1),
(62, '【棒球用語】', '棒球球數規則介紹｜一顆好壞球定勝負2', '<p>棒球球數有哪些實際案例呢？\n案例一、打者兩好球，跑者盜壘\n影片中，中信兄弟跑者張正偉，在球數 2 好 2 壞時，選擇盜壘、並成功盜上二壘。</p><p>\n在這樣的球數發動盜壘，成功的話，可創造出得點圈的進攻機會。</p><p>\n若盜壘失敗，也能讓打者在下一局進攻時，球數從 0 好 0 壞的狀況下，再次與投手對決。</p><p>\n案例二、打者三壞球，擊出全壘打\n影片 01：44 開始，中信兄弟陳子豪，在球數 0 好 3 壞的情形下，將小白球一棒扛出右外野大牆，形成全壘打。</p><p>\n通常在這樣的球數下，打者多半會選擇等一顆球，看能否靠著四壞球保送上壘。</p><p>\n就算投手投出好球，打者仍保有 1 好 3 壞的球數，處於球數領先狀態。</p><p>\n棒球球數之常見問題有哪些？\n	Q1：好球壞球怎麼分？\n簡單的區分好壞球。</p><p>\n好球：投手投出的球，在好球帶範圍裡（削到好球帶邊緣也算）。</p><p>又或是打者出現揮棒動作，這些都屬於「好球」。</p><p>\n壞球：投手投出的球，在好球帶的範圍之外，且打者沒有進行揮棒，這些都屬於「壞球」。</p><p>\n	Q2：為何打者在兩好球後，打擊率都偏低呢？\n兩好球的情況下，打者必須放大好球帶，避免在好球帶邊緣的球，被主審裁判認定為好球，直接被三振。</p><p>\n而打者在放大好球帶的同時，相對就容易追打壞球。</p><p>\n一來一往之下，打者的打擊率，就會受到影響。</p><p>\n	Q3：打者在兩好球後打出界外球，怎麼不會被三振呢？\n紀錄上算是好球，但打者並不會被三振。</p><p>\n打者除了在兩好球之後的，揮棒落空、擦棒被捕、短打失敗等等狀況，才會被認定為三振。</p><p>\n結論\n對於球數有什麼問題或想法，歡迎在下方留言，或許你所提供的資訊，也能幫助到其他人，解決他所遇到的問題。</p><p>。</p>', '62-2.jpg', '2022-11-03 17:07:07', '投球', '2', 1),
(63, '【棒球用語】', '棒球出棒過半規則介紹｜灰色地帶的爭議判決1', '<p>前言\n出棒過半，屬於判斷打者是否揮棒的一個說法。</p><p>那在什麼樣的情況下，裁判才會認定為出棒過半呢？\n這篇文章將依中華職棒棒球規則，整理有關於出棒過半的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球出棒過半規則基本介紹\n出棒過半的定義\n出棒過半，並非棒球術語，故查詢棒球規則或維基百科時，無法看不到這樣的字眼。</p><p>\n只能透過棒球規則的部分，針對這項動作進行解釋。</p><p>但就規則面來看，並無對出棒過半有明確的解釋，所以導致不少爭議出現。</p><p>\n以下整理了球評及球迷們，對於出棒過半的定義及說法：\n1.	以本壘板為平行線，揮棒時，球棒是否超出這條平行線。</p><p>\n2.	以本壘板為基準，揮棒時，棒頭是否有超出本壘板。</p><p>\n3.	觀察打者的手腕翻轉或腰部旋轉的狀況。</p><p>\n4.	以打者身體中心線為基準，揮棒時，是否超出身體中心線。</p><p>\n上述四個出棒過半的定義，你比較認同哪一個呢？\n其實想怎麼定義都可以，畢竟規則沒明確律定。</p><p>判決結果也是以現場裁判的認定為主。</p><p>\n個人是偏向於第一個，作為出棒過半的判決基準，在認定上也相對有明確判決的依據。</p><p>\n以下影片的介紹，對於出棒過半的認知及解釋，過程中也提及攝影機拍攝角度，所造成視覺上的誤差。</p><p>\n打者出現出棒過半的情境\n打者可能出棒過半的情形，大多有這兩種狀況，不是打者猜球進行揮擊，就是被投手的引誘球給吸引出棒。</p><p>\n當打者發現不該進行揮棒時，會試圖將幫棒子收回來，避免出棒過半的狀況發生。</p><p>\n出棒過半有何影響？\n好球及壞球的差別。</p><p>\n當投手投出引誘球（壞球）時，若裁判認定打者出棒過半，會判定為好球。</p><p>\n反之，打者未出棒過半的情形，則判定為壞球。</p><p>\n看似僅一顆好壞球的差別，但往往影響甚大，不光是對於球員本身的成績影響，更有左右比賽勝負的可能性。</p><p>\n出棒過半由誰來認定？\n主審裁判。</p><p>會在第一時間做出判決，認定打者有無出棒過半。</p><p>\n但主審裁判無法確定時，打者是否有出棒，主審則會評估當下的狀況，是否需請一、三壘審，協助判決。</p><p>\n對於不同打者的出棒判定，會由不同位置的壘審協助判決：\n	左打者：三壘裁判協助判決。</p', '64-1.jpg', '2022-10-18 19:19:09', '打擊', '1', 1),
(64, '【棒球用語】', '棒球出棒過半規則介紹｜灰色地帶的爭議判決2', '<p>棒球出棒過半有哪些實際案例呢？\n主審直接裁定打者出棒過半\n影片中，統一7-ELEVEn獅打者莊駿凱，面對投手蔡齊哲投出高角度的球，有揮棒的嫌疑，主審裁判認定已出棒過半，形成第三顆好球，三振出局。</p><p>\n主審請壘審協助判決\n影片中，中信兄弟打者福來喜，面對投手賴智垣投出外角的變化球，打者發現是引誘球，及時將球棒收住。</p><p>\n捕手戴培峰向主審裁判示意，請壘審協助判決之動作，主審同意並指示一壘審協助判決，最終一壘審判定並未出棒。</p><p>\n觸身球沒上壘，卻被三振出局？\n影片中，Lamigo 打者藍寅倫，面對投手賽格威投出近身的暴投球，落地後反彈至打者腿部。</p><p>\n主審裁判立即請三壘審協助判決，三壘裁判認定打者已出棒過半，故觸身球不成立，而是以好球作為判決，最終打者遭三振出局。</p><p>\n都揮棒了還不算出棒？\n影片中，打者面對投手所投出的球、揮棒落空。</p><p>\n但主審似乎沒注意到打者有揮棒的部分，進而請一壘審協助判決，一壘裁判也判定打者未出棒。</p><p>\n過去從沒看過這樣的判決…，只能說當下主審跟一壘審，並沒有注意到打者揮棒。</p><p>\n棒球出棒過半的常見問題\n出棒過半可以進行重播輔助判決嗎？\n不行。</p><p>\n簡單說，在棒球規則中，若是以裁判主觀認定的項目，基本上都不適用電視重播輔助判決。</p><p>\n假設以現行的規則來看，出棒過半若能夠進行挑戰，那該以什麼樣的基準來判定呢？\n出棒過半可以抗議嗎？\n不行。</p><p>\n僅能當下由總教練或捕手示意主審，請一三壘審協助判決，若有疑慮時，裁判會視情況，是否需當下開會討論。</p><p>\n結論\n看完了以上的基本介紹，你心目中對於出棒過半的認知，是否有新的看法了呢？\n對於出棒過半有什麼問題或想法，歡迎在下方留言，說不定你的想法，也能幫助到其他人解決疑惑。</p><p>。</p>', '64-2.jpg', '2022-10-18 20:20:20', '打擊', '1', 1),
(65, '【棒球用語】', '棒球第二動作規則介紹｜掉球後依然算出局？', '<p>前言\n第二動作，屬於棒球守備時的一種說法。</p><p>那這種說法代表著什麼意思呢？對於攻守雙方又會有什麼影響？\n這篇文章將依中華職棒棒球規則，整理有關於第二動作的資訊及案例，並加上個人見解，與您分享。</p><p>\n棒球第二動作之基本介紹\n第二動作的定義為何？\n第二動作，並非為棒球術語，但時常被用來形容守備方的野手，接球後準備傳球的過程中，出現掉球情形。</p><p>\n第二動作之使用情境\n判定第二動作的基準，建立在守備方的野手完成確實接捕時，造成進攻方的打者或跑者，產生出局數。</p><p>\n什麼是第二動作？\n以第二動作字面上來解釋，可將野手的守備動作，拆解成下面兩項：\n	第一動作：接球\n	第二動作：傳球\n當野手完成第一動作之後，從手套中準備將球拿出來、進行傳球時，若不慎掉球，會由裁判認定進攻方是否出局。</p><p>\n若裁判裁定野手已完成第一動作之確實接捕，因第二動作的關係而造成掉球，則會判定打者或跑者出局。</p><p>\n常見的第二動作守備行為\n	野手在面對飛球時，完成確實接捕之接殺後，準備將手套中的球拿出來，進行傳球動作，而導致掉球。</p><p>\n	野手在進行傳接球時，完成確實接捕之封殺後，準備將手套中的球拿出來，進行傳球動作，而導致掉球。</p><p>\n與確實接捕的密切關係？\n第二動作的說法，依棒球規則來看，主要來自確實接捕的相關規則，所延伸出來的。</p><p>\n棒球第二動作有哪些實際案例呢？\n投手接殺後掉球之第二動作\n影片中，樂天桃猿的投手翁瑋均，面對打者高宇杰所擊出的平飛球，第一時間接進手套，在準備傳球時，球卻從手套裡掉出來。</p><p>\n經主審裁判認定，翁瑋均已完成確實接捕動作，接續掉球的部份，判定為第二動作，所以算接殺出局。</p><p>\n內野手接殺後掉球之第二動作\n影片中，Lamigo 桃猿的一壘手陳俊秀，面對打者蔣智賢所擊出之平飛球，第一時間接進手套，在準備傳球時，球卻從手套裡掉出來。</p><p>\n經一壘裁判認定，陳俊秀已完成確實接捕動作，接續掉球的部份，判定為第二動作，所以算接殺出局。</p><p>\n棒球第二動作之常見問題\n第二動作可以挑戰嗎？\n依聯盟規章第 45 條【即時重播輔助判決】，關於確實接捕的挑戰項目，僅能針對飛球是否在落地之前完成接殺，並不能針對第二動作來進行挑戰。</p><p>\n結論\n若不使用重播畫面的慢動', '66-1.jpg', '2022-10-13 19:05:04', '守備', '3', 1),
(66, '【D觀點】', '無限牽制？「牽」一髮而動全身！1', '<p>前言\n棒球場上，「牽制」屬於比賽中的一個環節，經常能夠在跑者上壘時，看到投手時不時的往壘包進行牽制，那牽制有很重要嗎?這個就見仁見智了，或許整場棒球比賽中，牽制的存在感，並不是那麼的明顯，但往往比賽的輸贏，從這些好像不這麼重要的動作中，可以看出些端倪。</p><p>\n只能說球場上的各個小細節都很重要，每一個動作都間接的影響勝負的走向，尤其是在兩支隊伍實力相當的情形下，如何掌握球場上的狀況，並適時為球隊做出貢獻，就顯得特別重要。</p><p>\n牽制小學堂\n牽制的目的\n棒球場上牽制的用意，主要在限制壘包上的跑者，避免跑者離壘距離過大，間接形成對方戰術使用的成功率變高，而有時還會抓到心不在焉的跑者，增加一個出局數。</p><p>\n有些投手願意花心思琢磨在牽制這一個技術，靠著自身優異的牽制動作與隊友配合，不只有效限制跑者的離壘距離，更能夠有較高的機會把跑者牽制在壘包前出局。</p><p>\n縮小離壘距離\n投手牽制壘包上的跑者，其中一個主要的用途，就是要縮小跑者與壘包間的距離，進一步影響對方戰術運用的成功率。</p><p>\n回顧先前看球賽的印象，時常能夠看到重播畫面中，出現相當接近的Play，當下安全上壘跟出局，往往就只差零點幾秒而已，所以讓跑者的離壘距離減少，就算只有半步，也會對整體結果造成不小的影響。</p><p>\n防止跑者盜壘\n盜壘企圖心強的選手，上壘後通常都會把離壘距離抓到極限，來增加盜壘成功的機率，而另一個盜壘重點，就是觀察投手的投球動作，抓第一步的起跑時機，往往在此時作牽制，都會收到不錯的效果，甚至會抓到已經跑出去的跑者。</p><p>\n反覆的牽制，或多或少能夠達到一些效果，但還是有可能會被盜壘成功，需要去考量整體的狀況，包含投手投球(牽制)動作、捕手阻殺能力、跑者盜壘能力等相關因素。</p><p>\n2019年05月17日，中華職棒例行賽 富邦悍將 VS 中信兄弟，四局上半，富邦一壘跑者王正棠，在一人出局，打者球數兩好三壞的狀況下，提前啟動嘗試往二壘跑，不過被中信投手牽制，在二壘前出局。</p><p>\n就上面這個情況，富邦可能有下達盜壘或是跑帶打的戰術，跑者才抓投手出手的瞬間，出現往二壘跑的動作，想靠著戰術運用上得點圈。</p><p> \n2017年04月01日，中華職棒例行賽_統一7-ELEVEn獅 VS 中信兄弟，三局上半，統一一壘跑者陳傑憲，在投手前後陸續', '67-1.jpg', '2022-01-30 18:02:59', '守備', '3', 1),
(67, '【D觀點】', '無限牽制？「牽」一髮而動全身！2', '<p>牽制教科書\n牽制出名的投手\n在棒場上的選手中，有哪些投手在牽制的技術上，是讓你特別印象深刻的呢?一個「回馬槍」就讓壘包上的跑者牽制出局，還是瘋狂的一壘做牽制，享受整場球迷的噓聲呢?\n戰神黃欽智\n曾經站在投手丘上，獨自面對現場眾多的象迷，不斷的向一壘壘包做牽制，一次、兩次…總共連續牽制六次，兩方球迷隨著牽制次數的增加，鼓譟聲也越來越大。</p><p>\n結束連續六次牽制後，最後以好球三振打者結束掉該半局，而一直牽制的情形下，想必也影響到打者的專注度及打擊節奏。</p><p>\n黃欽智「戰神」綽號的由來，有些人誤以為因為這場比賽牽制的關係，但實際上要回顧到2002年，黃欽智當年度投出相當亮眼的成績，單年度囊跨年度MVP、勝投王、防禦率王、最佳九人及金手套等等，拿下多個個人獎項而獲稱的綽號。</p><p>\n影片重點從2:00開始\n回顧這段經典時刻，近期也有Youtuber在專訪黃欽智時，請當事人現身說法，當時到底發生了甚麼事情?是教練團下達牽制的暗號，還是自己選擇做牽制?\n影片重點從13:20開始\n阿家張誌家\n提到台灣牽制的代表人物，大多數有在看球的朋友，應該都會反射性的想到張誌家，簡潔有力的牽制動作，台灣的選手，很少有人能夠像他一樣，做出這麼有侵略性的牽制，而每次在投手丘上轉身，都是想讓跑者出局。</p><p>\n曾經在2008年八搶三的奧運資格賽，中華隊對上韓國隊時，張誌家兩度把韓國隊的跑者牽制出局，當時真的是讓台灣球迷嗨翻，也讓韓國隊的跑者氣到摔頭盔。</p><p>\n影片重點從0:18開始\n七折蔡齊哲\n中信兄弟投手群的泡麵三人組之一「蔡齊哲」，近兩(2020-2021)年被定位在牛棚投手，主要以中繼的角色出賽，不只投球內容越來越穩之外，他的牽制功夫也不容小覷。</p><p>\n打者要上壘已經不容易了，就算上壘後，七折還是有機會靠著自身優異的牽制動作，讓跑者在壘包前被牽制出局。</p><p>\n2018年03月31日，中華職棒例行賽_中信兄弟 VS Lamigo桃猿，擔任中信兄弟先發投手的蔡齊哲，在一局上半，先後把Lamigo一壘的跑者，林智平及王柏融牽制出局，出現中職史上第一次，單局兩次牽制出局的罕見紀錄。</p><p>\n牽制失誤\n「人有失足、馬有失蹄」，好的牽制能夠限制跑者的離壘距離、甚至出局，但不好的牽制，就容易出現牽制失誤，而往往大多數都是投手暴傳所發生的，真的發', '67-2.jpg', '2022-01-30 21:25:36', '守備', '3', 1),
(68, '【D觀點】', '觸擊短打！這年頭還有人在使用嗎？1', '<p>前言\n說到觸擊短打戰術的部分，很容易讓人聯想到日本的小球戰術，尤其在日本棒球裡，對於態度及基本功的要求，針對戰術執行的狀況，以及球場上各項細節的處理，是我們必須去參考並學習。</p><p>\n不只是技術層面的部分，更重要的是在於日本人的所稱的「職人精神」，專注並投入在各自的領域內，一直追求更好的態度。</p><p>\n棒球戰術有哪些?\n棒球場上的戰術大致上區分攻擊和守備兩個面向，使用方式、時機及頻率，則會依照各隊總教練的習慣，而有所不同。</p><p>\n2021年中華職棒大聯盟(CPBL)的賽季中，中信兄弟新上任的總教練林威助的執教過程，與其他球隊比較，相較出現更多戰術的執行。</p><p>\n整年度觸擊短打戰術的次數上來看，高過其他球隊的次數，跟他本身之前受過日本教育及長時間在日本職棒出賽的關係不小，深植在他體內的日式球風，也在擔任總教練期間，展現出日式球風的執教風格。</p><p>\n棒球進攻戰術\n常見的進攻戰術\n棒球場上有五花八門不同的進攻戰術，像是打帶跑、跑帶打、犧牲觸擊短打等等的戰術，透過這些戰術的運用，讓跑者往下一個壘包做推進，創造出球隊更多得點圈的進攻機會。</p><p>\n而戰術使用的過程中，也會影響著對方的守備佈陣及補位，必須做出應變，造成內野有更大的空檔能夠做進攻。</p><p>\n打帶跑戰術\n壘上有跑者時，投手將球投出的瞬間，跑者啟動往下一個壘包跑，此時打者必須想盡辦法擊成滾地球，才能有比較高的機率，護送跑者往下一個壘包推進，而戰術下達的時機，主要是建立在兩人出局之前。</p><p>\n先前在國中棒球比賽中，出現比較特別的狀況，投手在出現大暴投頭情形下，打者依舊把球棒丟出去，試圖去碰到球，但從轉播畫面上來看，這種球應該是不用去揮棒，只能說打者真的確時去執行教練所下達的「戰術」。</p><p>\n跑帶打戰術\n壘上有跑者時，投手將球投出的瞬間，跑者啟動往下一個壘包跑，此時打者自行判斷好壞球，視情況去做揮擊。</p><p>與打帶跑很相似，差別在於跑帶打的情形下，打者則視情況選擇做揮擊。</p><p>\n比較常出現在兩人出局前，一壘有跑者，兩好三壞的情形下，投手若投壞球，會變成強迫進壘，對跑者不影響，而好球進來的話，打者就勢必要想辦法去擊中球，一來能夠避免被三振，二來則是有機會確實護送跑者，安全推進至下一個壘包。</p><p>\n不論是執行打帶跑或是跑打帶的戰術，只', '69-1.jpg', '2022-01-28 23:26:50', '打擊', '1', 1),
(69, '【D觀點】', '觸擊短打！這年頭還有人在使用嗎？2', '<p>棒球戰術的價值\n戰術執行成功率\n戰術的下達，無非是想在進攻端更有破壞力，又或是在防守端抓下關鍵的出局數，不過回歸到戰術的本身，戰術成功能帶來不錯的效益，反觀戰術失敗的情形下，就會在攻擊端增加出局數的產生，而防守端則會讓對手延續攻勢。</p><p>\n如何提升戰術執行的成功率，就是各隊教練團及球員的課題了，像是訓練方式、頻率、團隊配合…等等，也會隨著各隊的球風及總教練的執教風格而有所不同。</p><p>\n近幾年被冠上「彈力球」封號的中華職棒，在2019-2020的兩個賽季，在四支隊伍的例行賽中，整年度各出現超過500支以上的全壘打。</p><p>\n直到2021年下修比賽用球的彈性係數之後，在五支隊伍的例行賽中，整年度全壘打總數驟降到331支，普遍攻擊數據都往下修的情形下，雙方比分就容易形成拉鋸戰，此時能夠靈活的戰術運用，就會顯得相當重要了。</p><p>\n投手戰\n隨著中華職棒大聯盟(CPBL)的比賽用球調整彈性係數後，打者整體的攻擊數據普遍下降，反觀投手的投球數據則有明顯的提升。</p><p>\n球隊有時靠著先發投手一人就可以主宰整場比賽，而有時也會靠著優異的牛棚投手(鐵牛棚)，在球賽的中後半段，鎖定比賽的結果，讓打者要上壘都相當的困難。</p><p>\n此時要靠著連續安打或長打的出現，並非易事，而有效的運用戰術，就會是另一個創造出突破口的機會。</p><p>\n關鍵短期賽事\n短期重要的比賽，像是中華職棒的台灣大賽或是國際賽等等，都蠻吃球員自身的調整狀況，尤其這些賽事的重要性及比賽張力，讓球員們背負著不小的壓力，畢竟過往在打不好的情形下，網路上的砲火都會相當猛烈。</p><p>\n有些球員能夠正常發揮，甚至發揮出預期以外的表現，而有些球員則會在這種場面軟手或烙賽，可能是技術層面的問題，也有可能是心理層面(抗壓性)的因素所影響。</p><p>\n這些賽事中，每一分、每個出局數都很關鍵，甚至到每個好壞球都要斤斤計較，在雙方實力接近的情形下，如何拿下比賽的勝利?戰術的運用，就會是其中一個選擇。</p><p>\n實力不如對方時，進攻端的戰術更加重要，能夠上壘都是個奢求的時候，想要連續擊出安打，難度想必是難上加難，如何去突破這種困境，就需要整個團隊配合，也考驗著帶隊的總教練。</p><p>\n台灣大賽\n能夠進台灣大賽的隊伍，實力應該都差不了多少(雖然台灣隊伍少)，在撇除彈力球賽季，比分基', '70-1.jpg', '2022-01-28 21:20:16', '打擊', '1', 1),
(70, '【D觀點】', '盜壘成功的關鍵因素｜連車尾燈都看不到…為什麼？1', '<p>前言<br>那些在壘包間穿梭自如的球員，是如何辦到的呢?往往在上壘後，都蠢蠢欲動的想攻略下個壘包。<br>在中華職棒大聯盟(CPBL)的各個年代，都有出現不同的盜壘王，哪個人對你來說最具代表性呢?<br>而想成為盜壘好手需要具備那些條件呢?<br>•&nbsp;&nbsp;&nbsp;&nbsp;速度快<br>•&nbsp;&nbsp;&nbsp;&nbsp;判斷能力<br>•&nbsp;&nbsp;&nbsp;&nbsp;滑壘技巧<br>•&nbsp;&nbsp;&nbsp;&nbsp;積極&amp;正向的心態<br>相信具備這些條件的選手，在壘包間都能夠來去自如，跟逛自家後花園沒甚麼兩樣。</p><p><br>盜壘小教室 -&nbsp;<br>盜壘起源<br>在19世紀時，只有跑者一次跑過不止一個壘包才被記作一次盜壘。例如從一壘成功上到三壘。蘇格蘭人胡格·尼克（Hugh Nicol）曾創下單季138次盜壘成功（按照當時的規則）。<br>現代的盜壘定義從1898年開始實行。如果捕手無意使盜壘者出局，則不記盜壘，視為防守方的故意忽略（defensive indifference）。<br>盜壘是一種積極突破，但也須承擔一定風險的進攻戰略。通常在比分接近時使用，以達突襲、搶攻之效。<br>相對的，若球隊已經在比賽中大幅領先時，傳統上認為不應再執行諸如盜壘、短打等積極搶分的戰術，以免產生落井下石、勝之不武的不佳觀感，為球界的一種不成文規定。<br>至於領先多少分叫做「大幅領先」，並沒有明確定義。但如果是有提前結束比賽（Called Game）制度的盃賽，球隊在大幅領先之後多仍會為了達到提前結束的門檻而下戰術，此時較無不成文規定之爭議。</p><p><br>盜壘風險<br>談到盜壘的風險，你第一個會想到甚麼呢?盜壘失敗的時候，奉送對手一個出局數?還是在盜壘的過程中，不慎在跑壘受傷所造成的影響?那又應該如何去降低盜壘所需承擔的風險呢?</p><p><br>提升盜壘成功率<br>隨著時代及科技的進步，現在能夠透過各種方式，來提升盜壘的成功率，像是藉由儀器設備的輔助，來觀察場上投手的習慣，又或是透過現今運動科學的幫助，進行自主訓練及強化身體數值。<br>在有限的時間內，達到更好的訓練效果，相信對球員本身的盜壘成功率，都有實質上的幫助。<br>有盜壘成功的存在，當然就會有盜壘失敗的出現，透過盜壘失敗所獲取的經驗，也有助於球員去思考，如何去觀察盜壘過程中的各個細節。<br>像是離壘距離、投手習慣、捕手傳球能力、當天自身狀況…等等，進而評估各項細節並調整，來提升盜壘成功率。</p><p><br>球員盜壘受傷<br>任何職業運動員，最怕的就是受傷，棒球球員亦是如此，但往往這些受傷的發生，是大家最不願意看到的，畢竟健康的身體，是職業運動員相當重要的資產之一。<br>球員受傷後，不只要熬過這段長時間的復健，心理與生理上的煎熬，而最怕的是，回不到受傷前的巔峰狀態。<br>2018年9月22日，中華職棒例行賽_中信兄弟 VS 統一獅，一局下半，統一獅一壘跑者鄧志偉，嘗試往二壘做盜壘嘗試，卻在壘包前不慎受傷。<br>當年鄧志偉受傷前的棒子，相當的火燙，但在受傷過後，狀況似乎回不去了，一軍的出賽數迅速驟減，表現也不理想，最終在2021年被統一獅釋出。<br>DDL個人認為，以統一獅鄧志偉這個受傷案例，是可以拿出來做討論，對於非盜壘見長的選手，如何去降低類似的狀況發生?<br>•&nbsp;&nbsp;&nbsp;&nbsp;如何在跑壘過程中，降低球員受傷的風險<br>•&nbsp;&nbsp;&nbsp;&nbsp;球隊是否有把盜壘訓練納入常態訓練<br>•&nbsp;&nbsp;&nbsp;&nbsp;戰術下達時，考量更多的因素<br>這些問題是球隊需要去思考的，畢竟這一次的Play，讓統一獅損失了一位好手，也大大影響了鄧志偉後續的棒球生涯。</p><p><br>跑壘手套<br>對於運動員保護的重視，陸續出現各種不同的方法，來降低球員在跑壘過程中，可能出現受傷的風險。<br>像是透過防護器具、提升滑壘技巧、強化身體素質等等，都能以科學的角度去切入，更精準地去協助並保護球員。<br>近期在看比賽轉播時，發現越來越多選手開始戴跑壘手套，不只能夠降低受傷的機率，也能夠讓球員更專注在跑壘上。</p><p><br>棒球場上不成文規定<br>身為棒球迷，一定都有聽過這個不成文的規定「大比分領先時，不可以盜壘」，否則站在打擊區的打者，很有可能就會遭到球吻…，以前有、現在也有、未來不知道還會不會存在。<br>不過在中華職棒大聯盟(CPBL)近幾年彈力球的賽季，不知道所謂的”大比分”領先，是不是能夠確保球隊能拿下勝利呢?</p><p><br>速度快才能盜壘嗎?<br>盜壘判斷比跑壘速度還重要?<br>棒球場上，盜壘王大部分都跟快腿畫上等號，而速度快本身就存在著盜壘優勢，但盜壘不只是完全看跑壘速度，在技巧及判斷的部分，也是相當重要，有相輔相成的作用。<br>所以一位好的盜壘者，平時就需要做足功課，像是觀察投手的一些習慣動作，進而去掌握到他的配球模式、投球習慣等等，抓住盜壘的第一步相當重要。<br>也曾聽過盜壘見長的選手分享：「速度並非盜壘最重要的因素」。</p><p><br>速度慢照樣盜壘成功<br>有些速度較慢的選手，一樣能夠盜壘成功，雖然盜壘次數不多，卻還是能夠成功的盜上壘包，這些狀況在一些老將身上還蠻常見的。<br>一來是投手對他們戒心相對較低，二來這些老將在場上所累積的比賽經驗，在場上能夠更快速的去解讀比賽，進而執行盜壘嘗試。</p><p><br>投手投球型態<br>相較於一般常見的上肩投球(高壓式投球)，低肩側投(3/4側投或下勾投手)的投手，更高的機率進行盜壘嘗試。<br>尤其是下勾式投手更加明顯，不只在投球的動作較大，再加上使用這種投球模式的投手，球速普遍較慢，也讓盜壘者更多的運用空間。</p>', '71-1.jpg', '2022-01-14 15:10:20', '體能', '4', 1),
(71, '【D觀點】', '盜壘成功的關鍵因素｜連車尾燈都看不到…為什麼？2', '<p>棒球盜壘型態\n盜二壘\n盜壘中最普遍的就是盜二壘了，跑者只要踏上二壘壘包，就等於站上了得點圈，此時在安打出現的情形下，就有很高的機會奔回本壘得分。</p><p>\n盜三壘\n相較於盜二壘的難度比較高，不過還是偶爾會看到球員出現盜三壘的嘗試。</p><p>\n盜三壘機率較低的因素\n	捕手傳球到三壘的距離與二壘相比要來的短\n	跑者已站上二壘得點圈的位置，不用冒太大的風險去拚三壘\n提升盜三壘成功的因素\n	投手的投球節奏被跑者抓到\n	打者為右打時，會影響捕手傳球的動線\n盜上三壘的好處\n	一人出局前，可以不用靠著安打就能得分\n	二人出局時，也可以靠著投手暴投、捕手捕逸..等等方式得分\n	影響投手配球模式，減少容易出現暴投的球種(像是指叉球)\n盜本壘\n中華職棒大聯盟(CPBL)史上，僅有六位球員完成純盜本壘成功的紀錄。</p><p>\n最近一次盜本壘成功的案例，是在2018年10月22日的季後賽_統一獅VS富邦悍將，2局下半，富邦悍將跑者林哲瑄趁著投手牽制一壘時，從三壘盜回本壘成功。</p><p>\n延遲盜壘(delayed steals)\n延遲盜壘有別於常見盜壘方式，屬於比較進階的盜壘模式，需要具備的條件也比較多。</p><p>\n	延遲盜壘會在投手出手後才進行盜壘的動作\n	一般盜壘則是會抓投手出手的瞬間，進行盜壘的動作\n包含球員本身速度要有一定的水準之外，跑者還需要區觀察對方防守的狀況，包含投手、捕手、二遊等等，都影響著延遲盜壘成功的機率。</p><p>\n雙盜壘\n比賽中較常見的雙盜壘戰術，大多是在一三壘有跑者的情形，由一壘的跑者提前起跑，發動盜壘戰術，誘使捕手將球傳向二壘壘包，三壘跑者再趁機奔回本壘得分。</p><p>\n有時捕手也會選擇不傳球，讓一壘跑者上二壘，來避免原先在三壘的跑者回來得分。</p><p>\n2021年賽季的中信兄弟，在林威助總教練戰術運用比較頻繁的情形，時常會看到發動雙盜壘的戰術，成功率又相當的高，屢試不爽。</p><p>\n中職盜壘王\n壘包破壞者\n中華職棒大聯盟(CPBL)說到盜壘王，你最常聽見哪些球員的名字呢?哪些球員又是你心目中最喜歡的盜壘王?\n其中最常聽見的應該選手有大帝士、林易增、黃甘霖這三位選手，黃甘霖跟林易增都曾經連續五年拿到盜壘王的頭銜，大帝士則是在兩個球季內，以超高的盜壘成功率，跑出破百次的盜壘成功。</p><p>\n中職單季最多盜', '72-2.jpg', '2022-01-14 04:05:07', '體能', '4', 1),
(72, '【D觀點】', '跑壘失誤！天上掉下來的出局數？1', '<p>前言\n職棒場上，一位好的跑者需要具備那些條件呢?觀念、技巧、速度、心態…等等，每一個環節都相當重要，但現今中華職棒的選手，又有多少人是能夠稱得上優秀的跑者呢?\n魔鬼藏在細節中，如何在壘包間發揮影響力，創造球隊更多的得分機會，往往都在那瞬間的判斷，這也是球員們的重要課題之一。</p><p>\n棒球場上的跑者\n跑壘者心態\n身為職業球員在球場上擔任跑壘員時，應該保有甚麼樣的心態?\n了解當下本身的角色，做好跑壘員的本分，專注在球場上，相信在擁有正確的心態下，球員能夠在壘包上，為球隊做出最大的貢獻。</p><p>\n「朱老」朱鴻森\n2008年05月04日，中華職棒例行賽_La new熊vs兄弟象，12局下半，兄弟象的打者朱鴻森，擊出左外野的深遠飛球，「以為」擊出再見全壘打，最後球沒飛過大牆，朱才開始跑壘，最後在二壘壘包前無情被觸殺。</p><p>\n看比賽直播的當下，非常的傻眼又生氣，不過事後再回來看，朱老也是為我們帶來了很多的歡樂…。</p><p>\n「鍋爐」張志豪\n2017年9月17日，中華職棒例行賽_Lamigo vs 中信兄弟，二局下半，中信兄弟的打者張志豪擊出右外野深遠飛球，「以為」會過大牆的全壘打，結果因當天風勢影響，小白球打到全壘打牆後反彈，最後因一開始沒積極跑壘，導致最後在二壘壘包前出局。</p><p>\n張志豪在爪迷心中的位置，與前面提到的朱鴻森相比，相信是在不同的層級，尤其是張志豪曾出現超越完全打擊的「態度」，卻也出現一樣的跑壘失誤，相信經過這一次事件，會讓張志豪在跑壘上更加謹慎，避免再出現一樣的狀況，而傷害到自身球隊。</p><p>\n跑壘技巧\n球場上，以球迷的角度，能看到跑壘員的部分，不外乎是滑壘技巧、判斷能力、盜壘技術及搶攻壘包的積極態度。</p><p>\nDDL個人認為，判斷能力相當重要，專注在球場上，掌握每一個細節，視情況積極的往下一個壘包去推進，就能夠離本壘板更近一步。</p><p>\n就像是投手暴投或是捕手捕逸的情形下，該不該往搶攻下一個壘包?都是在那瞬間的判斷，需要透過平時的訓練，提升自身的觀念及技術。</p><p>\n跑壘越位\n棒球場上的其中一項規則「跑壘員不可以超過前一位跑者」，否則就會自動出局。</p><p>\n回顧2020年10月8日，中華職棒31年例行賽_樂天桃猿vs中信兄弟，二局上半，當時樂天的一壘跑者林智平，在跑壘的過程中，超越了前面一位跑', '73-1.jpg', '2022-01-05 06:02:04', '守備', '3', 1),
(73, '【D觀點】', '跑壘失誤！天上掉下來的出局數？2', '<p>壘包精算師\n搶攻三壘的必要性?\n「第三個出局數不要出現在三壘壘包」，你是否有聽過這句話呢?主要在敘述，兩人出局的情形下，此時跑者留在二壘，能夠在打者擊球的瞬間起跑，就算只是一壘安打，跑者要跑回來得分的機會也很大。</p><p>\n在不同的狀況下，會有不同的選擇及考量，像是比分差距、投手戰力、比賽重要性等等，但只要踏上三壘壘包，離得分大門口，就只剩最後一步了。</p><p>\n兩人出局的情形下，跑者站上上三壘壘包，還是能夠靠著各種方式得分， 投手暴投、投手犯規、捕手捕逸、內野安打、失誤等等，另外也會影響著投手的配球，減少像指叉球類型容易形成暴投的球路，對進攻方的打者也更加有利。</p><p>\nDDL個人認為，保持積極的搶壘心態是必要的，綜合考量各種因素，在成功機率高的前提下，都應該再往下一個壘包去做推進。</p><p>\n那些年漏踩的壘包\n爆氣的總教練\n中華職棒2003年的總冠軍賽_兄弟象VS興牛農的第五戰，兄弟象握有聽牌的優勢下，只要再取得一勝，就能拿下當年度的總冠軍，反觀興農牛，背負著輸球就要打包回家，對每一個出局數都要錙銖必較，更何況是安打被沒收的情形下。</p><p>\n在四局下半，鄭兆行擊出了一支中左外野的安打，在跑上二壘後，卻疑似漏踩一壘壘包，導致不只安打被沒收，還變成了出局數，牛隊總教練陳威成無法接受這個判決，甚至還朝向裁判出拳，造成不小的風波。</p><p>\n而且當時也沒有電視輔助判決，在攝影機拍攝的角度也無法還原畫面，所以變成了中華職棒的懸案之一。</p><p>\n消失的全壘打\n中信兄弟的許基宏，在2015年6月11日，中華職棒例行賽_義大犀牛VS中信兄弟，二局下擊出了一隻陽春全壘打，卻在最後被改判為三壘安打。</p><p>\n因為跑壘過程通過本壘板時，把注意力放在慶祝手勢上，卻忘記了確實踩壘的動作，導致全壘打被沒收，還變成了一個出局數。</p><p>\n就連在美國大聯盟MLB也有類似漏踩壘包的案例，在2021年6月9日的例行賽中，海盜隊的Ke’Bryan Hayes在1局下半擊出全壘打時，出現了漏踩一壘壘包，經對方提出重播輔助判決後，而被判定出局。</p><p>\n壘包癡漢\n兄弟歷年盜壘王\n在中信兄弟(含前身兄弟象)，最有名的盜壘者，就屬盜帥林易增了，連續五年的盜壘王(1990-1994)，包含在兩個不同的球隊，味全龍時期(1990-1991)、兄弟象時期(', '74-2.jpg', '2022-01-05 10:10:13', '守備', '3', 1),
(74, '【D觀點】', '零失誤等於金手套？中信兄弟之守備選擇1', '<p>前言\n相信很多人對於中華職棒大聯盟票選出來的金手套，有時都會滿頭問號？像是下面的一些問題 \n	零失誤等於守備好?\n	守備好的定義?\n	這個球員也可以拿金手套?\n	金手套評選標準?\n透過這篇文章來一起討論，有關職業棒球球場上，大家對守備不同的認知，以及守備真的會影響比賽的勝負嗎?\n出局數之斤斤計較\n正規球賽\n現今在職業棒球的環境中，不論是美職、日職、韓職、中職…等等，基本上在一場9局的比賽中，每隊總教練都會有27個出局數可以去運用，當然這裡就不包括延長賽、因雨裁定等其他特殊原因。</p><p>\n超過27個出局數的優勢\n如何在一場常規9局的比賽中，比對方球隊多出1個出局數，甚至更多呢?可以靠著對方的出現守備失誤或瑕疵，進而增加我方球隊在該半局多1個出局數運用的概念。</p><p>\n這邊所說的守備失誤或瑕疵，較常見的像是不死三振、暴投、傳接球失誤…等等，這些是會被官方紀錄的。</p><p>\n那不會記錄的部分呢?主要是以隱形失誤為主，像是強襲的滾地球朝著二游的方向過去，原本有進行雙殺守備的機會，卻因為守備球員處理球上的瑕疵，造成原先可以抓到2個出局數，變成只抓到1個出局數。</p><p>\n又或是外野手在接高飛球時，因為瞬間判斷錯誤，導致原先有很大機率接殺的球，卻變成安打球，這樣又給對方球隊多一次的進攻機會。</p><p>\n為何會發生守備失誤呢?\n守備失誤產生時，全部都是守備球員本身守備不穩所造成的嗎?絕大部分球員個人的問題，但其中一部分是擊球跑壘員給守備球員所帶來的壓力，尤其是腳程快的球員。</p><p>\n舉個最著名的例子，日本球星鈴木一朗，靠著個人的打擊特性及速度優勢，時常能夠跑出內野安打，每次擊出內野滾地球時，都會迫使內野守備需要快速處理球，不然就會被跑出內野安打。</p><p>\n當然每個球員都有自己的打擊特性，但這裡主要想說的是『跑壘積極度』，也就是心態層面的問題，每次鈴木一朗在擊球後，都是全力向一壘衝刺，就算看起來是必死球，還是會全力衝刺，因為對方守備球員有可能出現守備瑕疵。</p><p>\n像是接球沒接乾淨、傳球時傳偏了、跑壘速度產生了守備員處理球的壓力..等等，都有可能讓你靠著守備失誤而上壘，進而又創造出一次安全上壘的機會。</p><p>\n反觀有在關注中華職棒CPBL比賽的球迷，大概就會知道我想要表達甚麼了，『態度決定了你的高度』，不只棒球比賽中，會', '75-1.jpg', '2022-01-01 00:00:00', '守備', '3', 1),
(75, '【D觀點】', '零失誤等於金手套？中信兄弟之守備選擇2', '<p>極端的攻守表現-球員印象\n守備教科書?\n現今中華職棒CPBL的現役選手裡，提到擁有優異的守備表現，相信很多球迷都會聯想到富邦悍將的林哲瑄，就連爪迷的DDL都不得不佩服，他那極大的守備範圍、雷射肩的臂力，比賽中常有美技表現，基本上是家常便飯。</p><p>\n轉播球賽的主播，都時常嘖嘖稱奇，感覺準備落地變成安打的球，硬是被他守下來，所以在看比賽的過程中，只要球往中外野飛過去，心都先涼一半了。</p><p>\n另外在林的守備過程中，總會讓人覺得跩跩的感覺(因人而異)，雖然並不是很喜歡，但他也是有真材實料，才有辦法這樣，不然怎麼能夠僅靠著優異的守備表現，登上美國職棒大聯盟MLB的舞台。</p><p>\n在2016-2019年，連續四個球季的金手套獎得主，DDL認為林所獲得的金手套，純金度應該不太會有人去質疑。</p><p>\n攻優於守\n在過往看比賽的過程中，令人印象深刻的球員，像是樂天桃猿的朱育賢、林立，富邦悍將的蔣智賢，這幾位球員的打擊成績都是相當優異的。</p><p>\n但在守備表現，卻是令人不敢恭維，每次球往他們守位的方向過去，感覺跟拆炸彈沒甚麼兩樣，不知道何時會引爆，這顆不定時炸彈，往往都會造成球隊的重傷害。</p><p>\n參考下表數據，這三位球員的整體攻擊指數(OPS)都相當亮眼，為人詬病的就是在他們的守備表現，時常出現不穩定的情形。</p><p>\n以三位的整體守備率來看，林跟蔣的守備率都偏低，只有朱的守備率相較之下，要來的好很多，但真正有在觀注中職CPBL的球迷，對朱的守備情形，或多或少會有一些印象，就如本文前面有提到的一樣，守備率的部分，僅供參考。</p><p>\n四拍子球員\nDDL個人本身是在國中時期開始看中職CPBL的比賽，大約從2003年的時候，一直到現在2021年，都持續有在關注相關賽事，一直以來最喜歡的球星『恰恰彭政閔』，這裡就不闡述相關數據及記錄。</p><p>\n重點著重於四拍子球員『打、跑、傳、守』，攻守兩端都有出色的表現，各項成績也都相當優異，可遇不可求。</p><p>\n更難能可貴的是在於他表現出來給人的態度，也是為何恰恰能夠受到多人愛戴的原因(百萬象迷當然也是主因之一)，相信他展現出來的態度，必然是讓他成為偉大球星的關鍵因素之一。</p><p>\n守備的好壞，成了左右勝負的關鍵\n2008年北京奧運\n回顧當年中華隊與中國隊的比賽，雙方以4比4的比分，', '76-1.jpg', '2022-01-01 20:40:31', '守備', '3', 1),
(76, '【D觀點】', '零失誤等於金手套？中信兄弟之守備選擇3', '<p>對球隊最大效益\n透過實戰經驗，提升守備細膩度\n近幾年來看，DDL個人認為中信兄弟球員中，分別守在一壘的許基宏跟三壘的王威晨，在整體守備的表現下，都有明顯的提升及進步。</p><p>\n不論是在守備的穩定性，又或是遇到不規則彈跳、強襲球等不易處理的球，都能夠順利的守下來，也出現了不少的美技守備，讓投手在投球的過程中，能夠帶來安定感。</p><p>\n大量守備練習跟實戰經驗就能有好表現?\n把對的人放在對的位置上，文章內也有提到林立、朱育賢、蔣智賢等人，在攻守表現上相較算是比較極端的球員，在職棒球場上已經打滾了好幾年，但守備能力看起來，並沒有隨著實戰經驗而有明顯提升的趨勢。</p><p>\n這些球員都算是球隊的主力先發，既然長時間的出賽，為何守備狀況卻不見起色呢?或是進步的幅度很有限，DDL個人認為比較有可能的兩個因素：\n	天分，任何人都有比較專長的項目，職業球員也不例外，就像這邊提到的三位球員，在進攻端會讓對手帶來不少的壓力，但在守備端，還有很大的進步空間。</p><p>\n	態度，相信這些職業球員，就算守備是他們的弱項，但還是會有方法去改善這些弱點，不求球球Niceplay，但求穩定守備，穩穩地抓下每一個出局數，\n綜合前面兩個項目來看這幾位球員，DDL個人認為態度>天分，並非人人都可以像富邦悍將的林哲瑄具有優異的守備能力，但就提升個人守備能力，不論是從技巧上、心理層面…等等，還有很多課題是它們自己要去練習的。</p><p>\n『天下無難事，只怕有心人』，在這些球員能夠有更穩定的守備表現情況下，相信對未來在國際賽事上，中華隊會有更多的可用之兵。</p><p>\n當然守備不會是說的那麼簡單，還有很多層面可以去探討\n這些在守備不穩定的球員身上，可能會有哪些問題?缺乏練習嗎?還是本就算是比較不擅長的項目?當然都是有可能的。</p><p>\n但就認知及心態上來看，他們是為了提升守備穩定度，而進行守備練習，還是成為一個攻守俱佳的明星球員，無時無刻在球場上都會去思考如何做?才會對球隊帶來更大的效益。</p><p>\n但畢竟DDL主要還是關注中信兄弟的球員，中信兄弟以外的球員，大多是憑印象跟官方的數據去切入。</p><p>\n2021年球季之中信兄弟守備位置調度\n2021年賽季中信兄弟之守備位置調度，從季初到季末，DDL個人認為有更好選擇的三個守備位置，分別為二壘手、右外野手、指定打擊。</', '77-1.jpg', '2022-01-01 12:10:08', '守備', '3', 1),
(77, '【棒球規則教室Vol69】 ', '一定要有「進壘意圖」才能宣判妨礙跑壘嗎？', '<p>	黑豹旗火熱開打，在內壢高中對上永平高中的比賽中發生了妨礙跑壘的案例，跑者與野手相撞後第一時間返回了一壘上，隨後又被裁判叫上了二壘，球迷們爭論的點在於妨礙跑壘是否必須要有「進壘意圖」才能繼續再向前推進呢？規則怎麼說？一起來一探究竟！\n	Vol69判例檔案\n	事發日期：2023/10/18 青埔運動公園棒球場\n	對戰組合：高中黑豹旗 內壢高中V.S永平高中\n	事發過程：二局上，永平高中的打者擊出外野安打，在繞過一壘準備繼續向前時與內壢高中的一壘手發生碰撞，隨後返回一壘，此時一壘審宣判妨礙跑壘成立，將跑者叫上了二壘。</p><p>\n	先我們要確認妨礙跑壘的最基本條件：\n	野手在未持球或未處理球之行為狀況下，不得碰觸或阻擋跑者正常跑壘路線，違反時視為妨礙跑壘。</p><p> \n	所謂處理球之行為，係指該球確實已直接傳向該野手， 而該野手不得不進入理想位置接應的狀態，全賴裁判之判斷。</p><p>野手處理球失誤後，不可視為處理擊出球之野手。</p><p>\n	野手在沒有球的情況下不能阻擋到跑者的路線，不管故意與否，全部都可以被認定為防礙跑壘。</p><p>\n	例外就是，如果野手是正在進行守備行為，一定必須到跑壘員的路線上，此時就不會有妨礙跑壘的產生。</p><p>\n	妨礙跑壘一共分為兩個種類：\n	（h）妨礙跑壘Obstruction 若發生妨礙跑壘時，裁判員應宣告「Obstruction」。</p><p>\n	（1）野手採取防守行為妨礙跑壘員，或擊球跑壘員踏觸一壘前受到妨礙時，形成比賽停止球，所有跑壘員在不虞被判出局情形下，得進至由裁判員判定若無妨礙時可能到達之壘。</p><p> \n	( 夾殺等狀況適用)\n	（2）野手未對受到妨礙的跑壘員採取守備行為時，Play應繼續進行，直到沒有進一步行動的可能。</p><p>然後裁判員應宣告 「Time」，並依據判斷，對受到妨礙的跑壘員給予適當之 壘。</p><p> \n	(擊出安打或守備失誤後的跑壘過程中適用)\n	今天的狀況是球被打成左外野邊線的安打，跑壘員跑過一壘後與沒有要進行守備行為的一壘手碰撞，並且跑壘員也不是被採取夾殺等守備行為的狀況下，因此今天必須要引用規則（2）。</p><p>\n	我們再重新看一次規則原文：\n	（2）野手未對受到妨礙的跑壘員採取守備行為時，Play應繼續進行，直到沒有進', '78-1.jfif', '2023-10-19 21:18:40', '知識', '5', 1),
(78, '【棒球規則教室Vol68】 ', '捕手回傳球打中打者球棒該如何宣判？', '<p>	棒球規則一共有將近兩百頁、九個篇章、一則用語之定義，每個篇章還有無數個小標題，小標題中又有無數個小細項，同時還有原註、附註、註釋，除此之外各個聯盟還會有各自的規則補述，裁判員必須在當下立刻理出條文進行判決，本系列將不定時更新介紹許多球場上罕見的PLAY以及實務宣判條文，讓我們一起走入規則的世界。</p><p>\n	悍將與統一在新莊球場激烈對壘，六局上滿壘時捕手張進德的回傳球不偏不倚地丟在打者蘇智傑的球棒上，投手肯特見狀趕緊衝刺將球撿起，並且嚇阻了三壘上的跑者，無獨有偶，在昨天的比賽中也發生了打者被回傳球丟中頭的狀況，究竟此時該如何宣判呢？一起來一探究竟！\nVol68判例檔案\n事發日期：2023/9/27 新莊棒球場\n對戰組合：CPBL例行賽 統一獅V.S富邦悍將\n事發過程：六局上，兩出局統一攻佔滿壘，張進德將球回傳給投手時正好丟中了打者蘇智傑的球棒，球改變方向後掉落在內野區，投手肯特見狀立即衝刺將球撿起，並且逼退了三壘跑者。</p><p>\n好的!\n我們要翻開的是規則補述！\n中華職棒規則補述 3.03 【擊球員碰觸捕手回傳球之規定】\n(A) 捕手回傳投手之球，碰觸位於擊球區內之擊球員身體、球棒、頭盔等，經裁判認定擊球員非故意妨礙情況下，皆視為比賽進行中；若擊球員有自然擺動、是否揮棒之餘勢動作而碰觸回傳球時，則為比賽停止球，不視為妨礙，跑壘員不得進壘。</p><p>【參考美國大聯盟裁判手冊】 \n規則上告訴我們，當即球員在打擊區內，經由裁判認定如果不是在故意碰觸或是揮完棒餘勢的狀態被捕手的回傳球擊中，此時為比賽進行中，壘上的跑者可以進壘，一切PLAY照算，反之則會被認定立即比賽停止球，跑者不能向前攻佔壘包。</p><p>\n從本壘後方的鏡頭我們可以看到，在第一時間主審就針對這個狀況做出了一個比賽進行中Nothing的宣判：\nMLB也有發生過這種狀況，近年來最讓人印象深刻的是2015年藍鳥隊與遊騎兵隊的季後賽，打者秋信守的球棒同樣也被捕手的回傳球擊中，三壘上的Rougned Odor回到本壘，主審一開始宣判比賽暫停，在開會過後確認是比賽進行中的狀況，跑者安全回到本壘得分，雖然大家在賽後都在討論Jose Bautista在下半局的驚天甩棒就是了(笑)。</p><p>\n那如果打者是踏出打擊去呢？\n我們接著把規則往下看：\n(B) 捕手回傳投手之球，碰觸踏出擊球區外之擊球員', '79-1.jfif', '2023-09-27 03:04:07', '知識', '5', 1);
INSERT INTO `article` (`id`, `subtitle`, `title`, `description`, `photo`, `created_at`, `type`, `type_id`, `valid`) VALUES
(79, '【棒球規則教室Vol67】 ', '主審踢到球後跑者必須回原壘，怎麼回事？', '<p>棒球規則一共有將近兩百頁、九個篇章、一則用語之定義，每個篇章還有無數個小標題，小標題中又有無數個小細項，同時還有原註、附註、註釋，除此之外各個聯盟還會有各自的規則補述，裁判員必須在當下立刻理出條文進行判決，本系列將不定時更新介紹許多球場上罕見的PLAY以及實務宣判條文，讓我們一起走入規則的世界。</p><p>\n味全龍與中信兄弟在二連戰的第二場比賽中打得難分難解，七局上，味全捕手蔣少宏起身接球後不小心將球掉向了身後，球隨後又被主審踢到了一旁，壘上的江坤宇見狀拔腿狂奔上到二壘，此時主審卻宣判了比賽停止球，要江坤宇回到一壘上，這是怎麼回事呢？\nVol67判例檔案\n事發日期：2023/9/21 天母棒球場\n對戰組合：CPBL例行賽 中信兄弟V.S味全龍\n事發過程：七局上，江坤宇攻佔一壘，龍隊捕手蔣少宏起身接球、拿球後不小心將球掉到身後，球隨後又被主審蘇建文踢到了一旁，江坤宇見狀跑向二壘，主審立即宣判比賽停止球，要求江坤宇回到一壘上。</p><p>\n我們直接來看規則：\n6.01 妨礙守備、妨礙跑壘與捕手碰撞 Interference ,Obstruction ,and Catcher Collisions\n（a）下列情況為擊球員或跑壘員對守備之妨礙： \n（1）投球未被捕手接補，該球於本壘附近遭主審裁判或擊球 員未注意情況下將球轉移方向，此時為比賽停止球，所有 跑壘員應返回投手投球前所佔有之壘；若為第3好球時， 擊球員宣判出局。</p><p> (後段)\n這條規則就是在強調投球後主審被主審移動影響到守備的狀況，正常的情況下，主審未做任何移動遭球擊中，此時為比賽進行中，但是當暴投或是捕手擋球、接球之後，球因為主審的移動改變行進方向，造成捕手守備困難，此時就必須立即宣告比賽停止，攻方不能因此得利，必須回到原壘。</p><p>\n很多人對這條例沒有印象，因為這是近年剛更改修訂的條文。</p><p>\n或許很多人對這個畫面還有印象：\n這條規則就是為了因應這種事情修訂的，按照現行規則，這個Play就會是停止球。</p><p>\n那傳球打到裁判呢？\n6.01（f）教練及裁判之妨礙 Coach and Umpire Interference\n若傳球偶然觸及壘指導教練，或投球、傳球觸及裁判員時 ，為活球並為比賽進行中；若壘指導教練妨礙傳球時，跑壘員應出局。</p><p> \n【6.01(f)原註】', '80-1.jfif', '2023-09-22 23:01:02', '知識', '5', 1),
(80, '【棒球規則教室Vol63】 ', '關於攝影席的死球規則！', '<p>棒球規則一共有將近兩百頁、九個篇章、一則用語之定義，每個篇章還有無數個小標題，小標題中又有無數個小細項，同時還有原註、附註、註釋，除此之外各個聯盟還會有各自的規則補述，裁判員必須在當下立刻理出條文進行判決，本系列將不定時更新介紹許多球場上罕見的PLAY以及實務宣判條文，讓我們一起走入規則的世界。</p><p>\n兄弟與富邦在新莊球場交手，九局下，江坤宇的長距離傳球在落地後不偏不倚擊中了場邊攝影席內的相機，小白球反彈後在欄杆上跳了一下又滾回場內，富邦總教練丘昌榮上場向裁判表示這球應該是死球，跑者要進到二壘，裁判在開會討論後宣判比賽進行中，跑者停留在一壘，究竟規則怎麼說呢？\nVol63判例檔案\n事發日期：2023/6/14 新莊棒球場\n對戰組合：CPBL例行賽 中信兄弟V.S富邦悍將\n事發過程：九局下，王正棠擊出游擊方向滾地球，江坤宇將球傳向一壘時發生暴傳，球擊中後方攝影席中的相機，隨後又彈回場內，富邦總教練丘昌榮上場向裁判表示這球應該是死球，裁判在開會討論後宣判比賽進行中，跑者停留在一壘。</p><p>\n我們直接翻開規則補述的後面！\nCPBL規則補述 5.03 【球場各設施之認定說明】\n(C) 『攝影席』\n(1) 無論攝影席屬固定或臨時架設，比賽進行球碰觸欄杆護網後之人員、器材、後牆，又直接反彈於比賽場內，則為比賽進行中。</p><p>一旦落於該區域之地面時，即視為已進入死球區，比賽停止球。</p><p>野手一腳踏入攝影席地面之死球區接球，視為無效接捕行為。</p><p>若因攝影席欄杆下護網，因人為因素遭破壞時，若野手傳球由欄杆破洞中直接進入再反彈於比賽場內，仍為比賽進行中。</p><p>除非裁判員非常確定該球已落於地面，才屬比賽停止球。</p><p> \n大家印象中球進入休息室就會是比賽停止球，但攝影席比較不一樣，除非球有落地，否則碰到東西直接回彈進入場內都還是比賽進行中。</p><p>\n今天的狀況就是打到新莊球場攝影席內的相機，並且在沒有落地的狀況下回到場內，所以是比賽進行中。</p><p>\n不過攝影席也是有個特別例外的：\n【例外一】台中洲際球場攝影席前方欄杆護網，為死球區之界線，欄杆護網以內之地面、後牆、屋簷皆為死球區，比賽進行球一旦越過該護網上方碰觸護網欄杆內之人員、器材、裝備，即視為已進入死球區，為比賽停止球。</p><p>\n【例外二】台中洲際球場本壘看台', '81-1.jfif', '2023-06-14 21:00:30', '投球', '2', 1),
(81, '【棒球規則教室Vol57】 ', '球掉進護具裡為什麼壘上跑者可以進壘？', '<p>棒球規則一共有將近兩百頁、九個篇章、一則用語之定義，每個篇章還有無數個小標題，小標題中又有無數個小細項，同時還有原註、附註、註釋，除此之外各個聯盟還會有各自的規則補述，裁判員必須在當下立刻理出條文進行判決，本系列將不定時更新介紹許多球場上罕見的PLAY以及實務宣判條文，讓我們一起走入規則的世界。</p><p>\nVol57判例檔案\n事發日期：2023/4/5 新北新莊棒球場\n對戰組合：一軍例行賽 樂天桃猿V.S富邦悍將\n事發過程：六局下，富邦攻占二壘，樂天捕手林泓育在擋球時讓球掉進了護胸內，裁判開會討論後判定死球，壘上跑者前進至三壘。</p><p>\n這個事情比較少見，但是規則非常容易解釋，因為有明文規定：\n棒球規則5.06 跑壘 Running the Bases（原7.00)\n（c）比賽停止球Dead Balls（原5.02、5.09)\n在下列情形下成為比賽停止球，跑壘員得不虞被判出局進1個壘或返回原壘。</p><p>（原5.09)\n（7）投球夾於主審或捕手之面具或其隨身用具而靜止時-跑壘員得進1個壘，此時為比賽停止球。</p><p>\n為了防止這種特殊狀況發生，棒球規則明訂出特殊狀況的應對方法。</p><p>\n投手在正規投球所投出的球如果進入了捕手手套以外的東西，例如:捕手、主審的護具、口袋、球袋，都會馬上成為比賽停止球，壘上跑者向前進一個壘包。</p><p>\n如果遇到三振或是四壞球的狀況怎麼辦？\n規則很貼心地想到了：\n【5.06(c)(7)原註】（原5.09(g)原註)\n若被宣告為第3好球或第4壞球之投球，夾於主審或捕手之面罩或隨身之用具中時為比賽停止球，給予擊球員進一壘，所有跑壘員亦給予進1個壘；若球數為3壞球以下，則所有跑壘員進1個壘。</p><p>\n這條規則很特別的就是會有打擊者無條件攻站上一壘的判決，四壞球時沒有任何問題，打擊者一定會上到一壘，壘上跑者則是各往前推進一個壘包，如果是第三好球，三振不會成立，打者同樣也是進到一壘，跑者同樣往前推進一個壘包，原理類似未確實接捕或是球打進球衣時的處置，這就是這條規則特別的地方。</p><p>\n為什麼會是這樣？我們可以看一下確實接捕的定義：\n棒球規則 規則5.09 出局 Making an Out：\n確實接捕（Catch）（原2.15)—應指飛行中的擊出球、或投球、或守備員的傳球，被野手以手或手套確實接住之行為', '82-1.jfif', '2023-04-05 15:14:13', '守備', '3', 1),
(82, '【棒球術語】', '透過運科與握法調整讓四縫線直球更為銳利', '<p>一顆能夠上竄的四縫線速球會為打者群帶來劇烈的殺傷力，譬如2022年開始崛起的先發投手Spencer Strider就以他的直球大殺四方，相比於類似球速的其他大聯盟投手，他的四縫線速球平均多了1.8吋 (4.6公分) 的上升幅度，可能就是造就這顆 Run Value 高達-20的四縫線速球的原因。</p><p>\n但許多選手的直球無法投出這樣的感覺，我們先暫且將出手點不同造成移動軌跡變化的差異擺在一旁，一顆高品質的四縫線直球需要你能將食指、中指的施力施壓在球的正後方，這能讓你的直球的旋轉效率上升，即富含較高比例的倒旋、側旋與較低比例的子彈型轉動，讓直球變的更會跑。</p><p>\n相反地，如果中指施力在球的側面，便會造成球種旋轉效率的下降，導致類似弱化板的卡特或滑球移動軌跡出現，甚至根本不會跑；當然如果食指施力在球的側面，也會造成旋轉效率的下降，但就不會跑出卡特或滑球的軌跡了。</p><p>\n改善的方法有非常多種，而常常聽到大聯盟投手教練的名言「相信握法」，便是在提醒我們握法的重要性。</p><p>譬如我其中一位選手便是透過改變中指的擺位，讓中指以較不能出力的指腹或指節放在縫線上；讓食指指尖扣在縫線前端，便改變了兩指在出手點對球的施力情況，進而改變球的品質。</p><p>\n但獲得改變是要嘗試的，我們還是在眾多失敗當中，尋求可以成功的可能性，這也是球路設計的主軸，透過對於數據、握法的理解，改變球的移動軌跡。</p><p>。</p>', '83-1.jpg', '2023-04-10 20:24:36', '投球', '2', 1),
(83, '【棒球用語】', '提高擊球初速的訓練方式 Part 1', '<p>擊球初速簡介\n既然你會看到這篇文章，想必也或多或少聽過「擊球初速」這個名詞。</p><p>它表示打者揮棒擊球後，球飛離球棒瞬間的速度。</p><p>而「擊球初速」的高低更與打擊的成功與否有著高度關係，這樣的比喻可能更好理解，「擊球初速對於打者的重要性，就如同球速之於投手」。</p><p>\n根據大聯盟 (Major League Baseball, MLB) 官方統計數據網站 Baseball Savant可以發現，強打球的定義為【擊球初速>95mph】的球(約等於152.9kph)，背後原因其實很簡單，因為他們根據統計數字發現，「擊球初速」高於95mph的球較有機會對比賽創造貢獻，簡而言之，就是能打出超過95mph的球是打者要在大聯盟中生存的基本能力。</p><p>\n雖然我們絕大多數人打的棒球比賽跟大聯盟不是同一個等級，因此統計數值無法直接套用，但擊球初速得重要性卻不會因為層級的不同而消失，只是不同層級的基準值有幅度上的差異 (例如沒有90mph的擊球初速很難進入美國Division 1層級)。</p><p>\n打者與球之間的關係，比起投手而言多了一層媒介-球棒，因此會影響擊球初速的也分成兩個部分：【揮棒速度】與【擊球品質】，揮棒速度可以理解成人體在旋轉平面產生爆發力的能力；而擊球品質則是在討論棒到球技巧 (Bat to ball skill) 的擊球準確性問題，下述討論將分別討論影響【揮棒速度 (Bat speed)】與【擊球品質 (Smash factor)】的要素。</p><p>\n \n揮棒速度簡介\n為避免產生誤解，以下揮棒速度均指「球棒甜蜜點在擊到球該瞬間的速度」，這也是當你使用棒尾感測器量測揮棒速度時可以量測到的數值(例如：Blast Motion、Garmin Impact)。</p><p>\n知名打擊教練Noah Thurm曾說過一句話：「A hitter’s bat speed sets their ceiling and their floor, and their smash factor and swing decisions determine where they live in between the two」(翻譯：揮棒速度決定打者擊球表現的天花板高度，擊球品質與揮棒決策則決定打者能發揮其上限的程度)，揮棒速度在擊球中的重要性由此可見一', '84-1.jpg', '2022-11-06 21:21:24', '打擊', '1', 1),
(84, '【棒球術語】', '關於增加球速的入門知識', '<p>不希望你忽略的前言\n在棒球的世界中，球速是很引人耳目的關鍵字，它是選手能夠晉升高競技殿堂的一張入場券，它佔據了投手運動表現中的重要地位，這或許便是現今世界中與球速提升相關的方法琳瑯滿目的原因，這恰恰應對了龐大的選手、家長、教練的需求，可惜在資訊流通快速的爆炸時代，人類接觸資訊的管道繁多，但卻難以控管資訊的正確性與否，這使得許多缺陷開始浮現，其中最嚴重的便是「訓練受傷風險上升」，舉例來說，我們可以輕易地從社群媒體管道上獲取一項提升球速的訓練技巧名為「跑投 (pull down)」，這個技巧可以協助選手提高投球強度，極大程度地讓人體獲得更大的刺激進而拓展球速的上限，而許多的選手、球迷便立即地開始嘗試這項訓練技巧，藉此達到球速提升的願景，這個過程其實是充滿風險的，第一沒有考量到訓練學中的漸進原則，這個原則告訴教練們「安排訓練強度與訓練量應該循序漸進，否則身體組織在訓練過程中，受傷的風險會提升」；第二沒有考量到投球機制中是否有一些風險因子受到助長，投手的前導腳是否能夠有效剎車，與手臂承受的壓力相關，偏偏跑投是透過跑動的方式使得身體累積更大的線性速度，前腳要面臨的剎車壓力也就隨之放大，在剎車機制不佳、身體素質不足的情況底下，同常跑投時前導腳都沒辦法好好剎車，也助長了手臂要承受的壓力。</p><p>而上述僅僅是專業考量的一小部分。</p><p>\n當社會獲取提升球速的訓練方式的門檻極低，但卻極少掌握重要的第一性原則，如運動生物力學、訓練學、肌動學等等來協助篩選資訊，容易使得訓練效果不彰且訓練安全性低落，因此我所撰寫的這本電子書，其秉持的目標不在於讓閱讀者獲得球速快速增長的奇方妙法了，而是希望閱讀者能在閱讀類似題目時，能有更全面的視野，讓我們用安全、有效且科學的方式建構我們所喜愛的棒球世界，但同時也要提醒，本書撰寫的設想受眾並不在於教練，為了讓閱讀者容易理解，會將許多專業思考過程省略掉，然而身為教練的基礎知識應當透過完整的教育體系來建構，並藉由高強度的批判性思考能力，建構自己訓練系統的完整邏輯。</p><p>\n \n怎麼看待投球機制\n身在棒球訓練環境，常常會聽到來自四面八方的說法，「因為你這個投球機制不好，所以你球速才會這麼低，你看看那個誰誰誰……」、「我不會去模仿特定選手，但我會擷取不同選手的優點」，這些說法都或多或少地讓我產生了疑問，第一是哪些投球機制能夠提升球速 ? 第二', '85-1.jpeg', '2022-11-08 20:00:30', '投球', '2', 1),
(85, '【棒球用語】', '年輕選手專項化訓練須知(一)', '<p>國小、國中這個階段的選手，正值身體組織快速發育的時期，同時也代表他們此時的肌肉力量、軟組織柔韌性尚未完全發育，因此不論在面對投球、打擊或守備等棒球專項訓練時，自然也有一些額外應該要謹慎處理的細節，身為孩子的父母或教練，你的職責就是讓孩子可以在棒球這條路上走得更好，因此也就更不能不了解這些眉角，好習慣要從小養成，正確的事越早開始效果越好，基於這個理念，我們會在【年輕選手專項化訓練須知】這個篇章裡列舉我們貝思沛拉棒球學校在訓練少棒、青少棒選手時最著重的幾個訓練概念。</p><p>\n今天要討論的主題是【均衡發展】，這其中又可以細分成肌群和動作模式的均衡發展，今天我們先就前者進行探討。</p><p>肌群的均衡訓練，簡單來說就是手臂照護課程，其重要性對於年輕選手而言更為重要。</p><p>當我們的訓練內容過於單一化，就很容易陷入某些肌肉經常被使用，此時如果它的拮抗肌群又疏於訓練，強弱過度失衡就是傷害開始萌芽的地方了，所以從小就將手臂照護訓練加入專項訓練前的熱身與訓練後的補強課表，可以讓接下來的棒球生涯最大化遠離運動傷害的困擾。</p><p>\n以投球為例，投手會在投球末期有一個極大的肩內轉角速度，這就告訴我們肩內旋肌群是加速肌群，在我們每一次的投球中都在訓練它收縮加速的能力，反之，如果我們的肩外旋肌群不夠力，就無法好好扮演球出手後的剎車角色，容易使肩關節的受傷風險直線上升，因此，你必須強化你的肩外旋肌群。</p><p>這邊提供一個好用的肩外旋訓練方式：\n?	站姿肩外轉：在執行上必須注意肩膀與手肘的相對位置，基本上手肘應該平行於肩膀，另外需注意軀幹是否不穩定。</p><p>一樣為了讓動作型態更符合棒球投擲專項運動，在此動作熟悉後，可將啞鈴置換成沙球，以站姿外旋拋擲的方式執行。</p><p>\n青少棒選手於投球前進行站姿外旋拋擲訓練\n其次，我們日常的鍛鍊上常常只以大肌群的訓練為主，一些與正確投球機制息息相關的小肌群則容易被忽視，例如下斜方肌與前鋸肌可以共同協助創造較佳品質的最大肩外旋，降低肩肘關節承受的壓力，因此在投球訓練的前後做適當的啟動與訓練就顯得格外重要。</p><p>以下這個訓練動作是我們很常使用，效果立竿見影，值得你學起來套用到你的訓練課表中：\n?	俯臥Y字手臂上抬: 在執行上必須要注意這是兩個關節都必須產生動作，包含肩胛骨會內收、後傾，而肱骨則會向上抬起，許多的棒球', '86-1.jpg', '2021-12-27 10:04:06', '體能', '4', 1),
(86, '【棒球用語】', '年輕選手專項化訓練須知(二)', '<p>接續之前的內容，本篇我們針對【均衡發展】這個主題的第二個部分 – 動作模式的均衡發展進行論述。</p><p>\n首先，我們先初步將動作模式依照解剖三平面做分類，矢狀面、額狀面與橫斷面(亦稱旋轉面)。</p><p>槓鈴背蹲舉、硬舉、直線衝刺等均較偏向矢狀面的動作；側蹲、側向跳躍、側併步等則屬於額狀面的動作；最後，跟軀幹旋轉有關的，例如棒球的投球、打擊，網球的抽球等動作就包含了高比例的旋轉面動作。</p><p>當然，這只是簡略的分類，多數動作會同時包含兩個以上的平面，引此我們這邊只會說某某動作”偏向”矢狀面動作，而不是完全只包含矢狀面動作。</p><p>\n解剖三平面\n從上面的分類不難發現，棒球中最重要的投球與打擊都屬於旋轉面的動作，因此我們就面臨了一個抉擇點，在訓練青少年選手時，應該要讓他嘗試多樣化、不同平面的動作模式；還是反正棒球專項中最重要的是旋轉面的動作，因此我就及早開始專心投入所有時間讓他練習跟旋轉面動作模式有關的動作就好？\n要回答上述的問題，我們從一個近代最廣為人知的成功學概念開始切入-【10000小時定律】，10000小時定律講述的內容是要成為某個特定領域的專家，需要通過大約10000小時對於該特定技能的刻意練習，這聽起來是不是十分符合常理，這也是為什麼這套理論能讓多數人信服的主要原因，對同一件事情反覆練習、再練習、更多練習，累積下來你就會成功，多麼勵志的故事不是嗎？但事情真的是這樣嗎？\n如果10000小時定律是對的，那可以輕易得出一個推論，那就是要練就一項技能，開始投入練習該項技能的時間越早越好，但近年針對運動領域不同層級選手在各個年齡層練習專項技能時間的研究中卻顯示出不同的結果，研究發現，在高中階段之前，頂尖選手花在專項動作本身的訓練時間是顯著少於次優秀選手的 (Moesch et al., 2013)。</p><p>更深入探詢會發現，頂尖選手額外的時間反而是花在各種不同運動項目的練習上。</p><p>不只研究，實務上也常見頂尖選手年輕時期的多樣化訓練反而有助於日後專項運動上的發展，例如今年最火紅的大谷翔平，小時候同時接觸棒球、游泳、羽球，就是一個沒有過早專項化，仍然能在未來成為頂尖的最好案例。</p><p>\n優秀與次優秀選手專項練習時間-年齡折線圖 (Moesch et al., 2013)\n看到這邊，那難道說現在應該馬上幫孩子報名各種不同的運動夏', '87-1.jpg', '2021-12-27 11:12:11', '體能', '4', 1),
(87, '【棒球術語】', '閒談投手非法外來物質', '<p>大家都知道投手丘旁邊都會放止滑粉，止滑粉裡面有松脂成分，讓投手出汗的手掌可以比較乾爽。</p><p>止滑粉裡因為有松脂成份，所以“抹久”以後確實會“有點黏黏”的感覺。</p><p>我個人是比較不習慣用止滑粉，因為感覺放球的“timing”會被影響。</p><p>\n最近大聯盟幾位著名投手被影射使用非法外來物質，甚至有此一說「80%到90%的大聯盟投手會使用非法物質」。</p><p>投手都知道:「球與手指接觸時間越長球的旋轉力越大」。</p><p>一些非法外來物質(例如松焦油、黏性物質……)，可以幫助投手抓穩球，增加手指和球的接觸時間。</p><p>\n使用外來物質對於投手而言，可以有效提升轉速，而轉速的增加會使得ㄧ些球種(四縫線直球、曲球、滑球、卡特球)的球質及位移也因而提升，打擊者對於擊球點無法精準掌握，讓投手比較處於優勢。</p><p>\n隨著運動科技的發達，2011年開始有Trackman和2015年開始有Statcast的追蹤器，取得投手的轉速資料後，也統計出「打擊率」和「轉速」之間的消長關係。</p><p>\n但最重要的是，轉速這項能力似乎透過訓練也很難大幅度增加！（根據美國傳動科學訓練機構及伊利諾大學教授兼大聯盟顧問Alan Nathan奈森的說法）。</p><p>\n轉速能力跟投手的表現是息息相關的,績效表現影響所及可以小到一場比賽，一個球季，也可以大到投手的生涯。</p><p>不使用非法物質會讓自己處於競爭劣勢，使用非法物質提升表現但違反運動精神。</p><p>\n如果你是大聯盟的投手，你會怎麼思考非法物質這件事情呢 ?。</p>', '88-1.jpg', '2021-06-19 10:09:10', '知識', '5', 1),
(88, '【棒球用語】', '從微小衛生習慣累積棒球選手訓練成效', '<p>1995年的時候，統一球團讓我有機會參加日本讀賣巨人隊二軍的春訓，當時巨人球團在球場和宿舍門口都擺放漱口水，目的是減少感冒的機會。</p><p>感冒對職業球員而言，影響是很大的。</p><p>可能跳過先發、可能因為休息打亂調整節奏、可能傳染給其他球員。</p><p>“感冒”這件事情可能對球隊的戰績產生很大的影響。</p><p>\n我因為“在球場漱口”這件事情，讓自己更知道：職業運動員要注意的不是只有自己的技術精進，還有生活上的一些習慣。</p><p>\n最近我閱讀了詹姆斯·克利爾「原子習慣」一書。</p><p>內容提到英國自行車隊邁向成功的歷程。</p><p>2003年英國職業自由車協會聘僱了戴夫·布萊爾斯福德為國家隊教練，他接掌之後短短五年，英國自由車隊就在2008年北京奧運拿下自由車6成的金牌。</p><p>四年之後的倫敦奧運 成績再次提升，創下九項奧運紀錄與七項世界紀錄。</p><p>\n而在此之前，英國長達100多年，沒有一位英國選手在賽事中奪冠。</p><p>\n「原子習慣」一書中提到，是「習慣」讓一群普通的運動員變成世界冠軍。</p><p>比較想特別提到的是，其中教練團聘請了一位醫生來教導“洗手”，以減少選手感冒機會，讓選手朝著既定訓練方向 達到訓練效果。</p><p>\n這個習慣和我在日本讀賣巨人二軍春訓看到的“漱口”是一樣的目地。</p><p>\n影響職業選手成績的一定又很多面向。</p><p>英國自行車國家教練戴夫·布萊爾斯福德說「如果能找出所有面向的分解，讓每個面向都改善1%，全部加起來就會得到可觀的成長」！\n身為職業球員要創造巔峰突破技術，真的沒有捷徑。</p><p>目標的達成需要靠時間的累積，養成「持續並願意每天進步1%」的習慣，效果會看到、目標也有望達成。</p><p>目前台灣面臨新冠疫情，台灣職棒不論以何形式開打，也建議要特別加強選手“洗手和漱口”這件事情，對預防疫情應該有些幫助！。</p>', '89-1.jpg', '2021-06-18 20:10:20', '體能', '4', 1),
(89, '【棒球術語】', '投手動力鍊訓練—肩髖分離之角度與時間點探討', '<p>「肩髖分離」，這是一個對所有從事棒球運動的朋友都不會陌生的名詞 \n有了肩髖分離代表著伸展了腹部肌肉，讓彈性能量、神經反射、肌肉活化程度等機制蓄勢待發，當上半軀幹開始轉向本壘板的那一刻，從腹部創造的能量，將會湧入你握著的球，幫助我們創造更快的球速。</p><p>也無怪乎大聯盟投手教練 Tom House 在其2009年著作的投球聖經裡建議，「身為一位投手，肩髖分離角度，至少要到達40-60度」，但有了角度就夠了嗎 ?\n不夠，你要的考慮的不僅是角度大小，還有「肩髖分離發生的時機點」\n 2007年，以Arnel Aguinaldo為主的運動生物力學家們，邀請了38位來自不同層級「少年、高中、大學、職業」的投手來做實驗，希望能從具有不同技術等級的運動員們間，看到投球機制上的差異 ! 而結果讓人出乎意料，職業選手的肩髖分離最大角度落在50度附近，與其他層級沒有差異，但是發生的時機點卻天差地遠，能夠在投球過程中比較晚做出最大的肩髖分離角度 。</p><p>這時候，我們把目光拉向21位少年、高中生運動員，結果顯示裡面整整有11位在前導腳觸地之前，最大肩髖分離就出現了 !\n2009年，這位學者再次研究了肩髖分離的時機，想要看看它對於手臂負擔的影響，結果發現在觸地前就發生最大肩髖分離的投手，對於手肘副韌帶（是的！就是Tommy Jone手術動刀的部位）所造成的負擔是觸地後才發生的「1.4倍」(詳見圖二)，這表示\n那你可能會問要怎麼判斷最大肩髖分離角度出現的時間點，我的建議是可以將手機錄下你前方的投球影片，這時候你要關注「身體什麼時候開始向本壘板方向旋轉」，如果在前導腳觸地前就發生（圖三），那你肯定太早做出肩髖分離。</p><p>\n那如果要看得更細，現在有一個投球生物力學分析的商業服務，能夠提供你詳細的投球檢測報告（我們未來也會針對這個系統做詳細介紹），如圖四，我們就可以看到這位小選手的最大肩髖分離48度發生在前導腳觸地前，這個角度好不好 ? 非常好，只是時機不太對，這個可能就是造成他投球效率只有3%的因素，需要立刻著手機制上面的改善。</p><p>\n未來，我會繼續介紹如何提升肩髖分離角度，以及如何修正肩髖分離時機的方法，讓我們一起改善投球機制，讓球速直直升，受傷風險直直落 ! 除了肩髖分離之外，我也會繼續分享相關的查核點與相關科學證據，讓球友訓練有所依。</p><p>。</p>', '90-1.jpg', '2021-06-07 11:07:40', '體能', '4', 1),
(90, '【棒球用語】', '數據科技棒球的眉角', '<p>數據導向的棒球訓練方式(data-driven baseball)正如火如荼地發展中，其中不管是好萊塢電影「魔球」或2020年賽揚獎得主Trevor Bauer在球員正職下，斜槓棒球科學家都在網路上吸引了眾人目光，使眾多科技產品在浪潮中一同獲利，因為我們都希望透過科技產品的幫助獲得數據，讓我們了解自己的弱點，以促成我們日的運動表現進步，成為球場上最閃亮的那顆星，然而透過數據棒球要獲得成功，它的進行過程與執行架構是有些眉眉角角的，包括:\n(一) 了解數據:\n數據的背後都有它的定義、成因與作用，譬如在Trackman、Rapsodo等追蹤儀器中的「Spin Direction (Tilt)」便代表著投手視角下球的旋轉方向，可以透過放球點及握球方式改變之，並進一步改變球的移動模式，達到球路設計的效果。</p><p>而如果不了解數據，便容易被風潮帶著走，但很快地便會因為數據無法提供實際影響，而使儀器被棄之一旁；但如果了解數據，便能解析複雜的整體，找出技術執行過程的弱點，進一步改善它。</p><p>\n(二) 正確的資料蒐集、整合與儲存方式\n數據的取用過程其實是相當複雜的，需要設計良好測驗方式來幫助它的運行，相信不少人都有聽過「信度(reliability)」，又或者「一致性(consistency)」。</p><p>舉個例子，如果一個選手在球速的測驗過程中，第一次投出50mph，但第二次投出75mph，這樣的數據似乎落差就太大，無法反映出選手的真實投球程度，造成這種狀況的原因有很多，包含: 測驗儀器出問題、沒有足夠熱身等等，而這些都要在測驗前去一一排除。</p><p>\n而在處理完數據後，更重要的是創建一個好的模板，方便我們能夠調用不同數據，進而比較不同的球員之間的差異、追蹤長期的訓練效果，甚至從中發現其他弱點。</p><p>而為了以利教練、選手之間的溝通與閱讀，資料需要轉換成圖表，甚至簡化成方便了解的例子。</p><p>\n(三)  配合相對應的訓練方式\n無論是科學驗證後的訓練方式，又或者是憑藉日積月累的教練經驗，所使用的方式都要能夠解決數據顯示出來的問題，而且可能得依賴不同專業的合作，如創建了Elite Baseball Performance的Mike Reinold，便將投手表現歸功於四項要素「好的手臂保養」、「身體素質」、「投球機制、方法」與「投手的身體發育階段」', '91-1.jpg', '2021-05-20 21:24:20', '體能', '4', 1),
(91, '【棒球術語】', '打擊運科檢測與優化調整策略', '<p>面對漫長的球季，職業選手如何在季中調整自身的狀況是一個相當重要的課題 ! 「統一神全」林益全8月下旬回來貝思沛拉棒球學校進行季中檢測訓練，透過「運科方法論」及「數據分析」來追蹤季中的表現況狀。</p><p>時間就這麼剛好，在檢測調整的幾天後，益全就在對上樂天的比賽中出現兩分逆轉全壘打，隔天又擊出再見安打 !  如此好表現讓我們教練團隊振奮不已啊 !\n說到定期檢測追蹤，在休賽季的時候，其意義十分明確，就是找出休賽季期間的訓練目標，並且依據測驗數據的分析來安排訓練的週期。</p><p>但賽季中的情狀就很不一樣，季中沒有大量時間可以規畫完整的訓練週期，一切都應該以最大化當下實戰表現為優先，因此藉著這個機會，貝思沛拉運科團隊就來討論一下季中的運科檢測到底扮演什麼樣的角色吧。</p><p>\n季中的檢測多數需要藉由觀察多個不同揮棒數據之間的相互關係，來找出選手的「弱連結」。</p><p>\n所謂「弱連結」，就是只需要微調，就可以帶來顯著表現差異的點，弱連結當然也因人而異。</p><p>因為賽季中沒有大量時間可以慢慢調整，而且也不宜在比賽時期大幅調整動作機制，很容易因為不習慣反而造成實戰表現的下降，所以我們就需要找到既是弱連結，又是微調後不會破壞選手目前打擊擊球動作整體性的地方來著手。</p><p>\n賽季中可以進行調整，同時也是打擊常見弱連結的有以下三個\n●蓄力準備的時機\n●擊球深度設定(跟常被提到的timing關係密切)\n●預設攻擊的球種與位置的選擇\n益全這次檢測的分析就是從Blast棒尾感測器所收取的攻擊角度、擊球點深度、揮棒時間這幾個參數間的關聯性發現著手點，加上跟上次今年4月檢測的數據比對之後，在擊球深度的設定上給益全一些建議與調整方式。</p><p>期待益全與我們運科教練討論後，針對數據回饋的分析建議進行優化調整，下半季持續產出亮眼表現囉。</p>', '92-1.jpg', '2023-08-25 23:03:03', '打擊', '1', 1),
(92, '【棒球用語】', '談揮棒平面策略', '<p>今年中職選秀首輪第三順位被統一獅選入的穀保家商強打外野手林佳緯，目前在U18集訓中的亮眼表現也備受關注。</p><p>貝思沛拉棒球學校長期提供穀保家商棒球隊運動科學週期性訓練服務，每季也會定期提供檢測服務，林佳緯選手不論是幾乎完全符合查核點列表的打擊機制，還是那接近美國大專等級的揮棒速度與擊球初速，都讓我們較練團在進行數據分析時印象深刻。</p><p>加上後續與穀保體能教練的交流中，也得知佳緯在眾多爆發力相關的體能檢測上，也都是球隊中數一數二的存在。</p><p>\n回想起今年初在檢測後與佳緯、穀保教練團後續的討論中，也進一步了解到佳緯在比賽中打擊遇到的一些問題，例如在幾場比賽的紮實擊球頻率較低、或是揮空率較高。</p><p>綜和以上資訊，可以知道佳緯是一位極具爆發力的打者，但擊球準確性(我們稱之為”擊球品質”)還有強化的空間。</p><p>對於如何提高擊球品質，有很多可以切入討論的面向，今天我們從揮棒平面的角度出發。</p><p>(圖一)是佳緯在2022 U18培訓隊中擊出球壘打的影片截圖，黃色箭頭是我們將擊球前2個影格的來球(用紅圈標示)連起來的連線，可以視作球的進壘方向；藍色箭頭則是擊球前2格影格我將佳緯的球棒棒頭(用紅圈標示)連起來的連線，可以視作球棒在擊球點附近的揮棒軌跡(也可稱作”攻擊角度”)。</p><p>(以下使用的影格標點方式，精確度無法與精密科技儀器比較，僅作為本文範例說明使用)\n想要提高擊球品質，讓藍線與黃線這兩條線越平行，越能提高紮實擊到球的機率，原因在於若兩條線角度差異越大，球與球棒交會的時間就越短，如上圖兩條非平行線條會只有一個交會點，代表除了在該交會點附近擊到球會是紮實擊球以外，稍微早一點會晚一點擊到球就會是切到甚至揮空；反之，若兩條線越平行，則稍微晚一點或早一點，球與球棒仍處於交會狀態，因此還是有機會能紮實擊到球。</p><p>\n綜合來說，球棒的攻擊角度與來球的垂直進壘角度越接近，就能提高選手紮實擊球的機率。</p><p>根據統計，MLB投手的四縫線速球之垂直進壘角度約為-3至-7度(會依據不同層級略有落差，這邊以MLB數據為例)。</p><p>因此，3至7度左右的球棒攻擊角度聽起來會是一個最能高機率紮實擊球的揮擊軌跡。</p><p>\n說到這裡，好像3至7度的攻擊角度是最優解?或是說，難道所有選手的揮棒軌跡都應該維持在3至7度嗎?', '93-2.jpg', '2023-07-13 10:05:08', '打擊', '1', 1),
(93, '', '棒球', '<p>前言<br>棒球守備都是在做些什麼呢？不就只是球員間互相傳球、接球而已嗎？應該把大多的訓練時間，都放在進攻上吧！<br>守備在棒球運動裡，雖然不像是投手投球或是打者打擊，來的引人注目，但卻在整個運動之中，不可或缺、也是相當重要的一個環節。<br>回顧過去個人所看過的棒球比賽，確實有不少比賽的勝負，跟守備有著不小的關聯。<br>本篇文章將用淺顯易懂的方式，來說明棒球守備的基礎規則及意義。</p><p><br>棒球守備基礎介紹 -&nbsp;<br>為什麼要守備呢？<br>棒球比賽，由兩個重要的元素所組成，一個是進攻、一個是防守。關於防守的部分，必須降低球隊失分之外，最重要的就是抓出局數了。<br>那在球場上該如何拿到出局數呢？除了投手直接三振對方之外，其他就必須靠著團隊的守備配合，來讓跑者一個一個出局。</p><p><br>棒球場上有幾位守備員呢？<br>棒球場上一共有 9 位的守備員，包含 1 位投手、1 位捕手，以及 7 位的野手，各有負責的守備位置。<br>1. &nbsp; &nbsp;投手<br>2. &nbsp; &nbsp;捕手<br>3. &nbsp; &nbsp;一壘手<br>4. &nbsp; &nbsp;二壘手<br>5. &nbsp; &nbsp;三壘手<br>6. &nbsp; &nbsp;游擊手<br>7. &nbsp; &nbsp;左外野手<br>8. &nbsp; &nbsp;中外野手<br>9. &nbsp; &nbsp;右外野手</p><p><br>棒球員基本的守備動作有哪些？<br>棒球員在場上進行守備時，最基本的動作，不外乎就是接球及傳球這兩項。而比賽過程中，以這兩個基本的動作，再依不同的實際狀況，進行變化。</p><p><br>棒球員需要哪些裝備才能守備呢？<br>棒球並不像籃球、足球等等的團隊運動，球員身上不需要特定裝備，就能夠進行比賽。<br>棒球場上的 9 位守備員，除了捕手的裝備比較多之外，其餘的野手（包含投手），都只需一個手套，就能可以上場進行守備。</p><p><br>捕手的守備裝備有哪些？<br>為何捕手身上的裝備，比起其他守備位置的球員，要來的多？捕手平常除了要接投手所投的球之外，有時還可能被反彈球或是球棒給打到，所以身上穿戴的護具，一件都不能少。<br>捕手的裝備有：頭盔、面罩、護胸、護膝、護擋、手套。</p><p>鞏固場上守備的關鍵時刻<br>時常能夠在比賽的中後段，看到球隊教練，開始調度場上的球員。從板凳出發的野手，大多會針對某個特定需求被換上場，像是打擊、跑壘或守備等等。<br>在球隊領先的情況下，會選擇把守備能力較優異的球員，換上場進行守備，不僅能夠加大守備範圍，也提升抓到出局數的可能性。</p><p><br>棒球守備有很重要嗎？<br>考驗團隊默契的守備配合<br>在棒球場上，當打者把球打出去時，每個守備員都會有各自的任務，但為何球明明只在內野滾動，外野手也需要跟著移動呢？<br>簡單區分為兩個部份，一方面是守備配合，另一方面則是降低守備失誤的傷害。<br>• &nbsp; &nbsp;守備配合 – 守備員為了接球，必須往球的方向移動時，那壘包上就需要有其他隊友進行補位，才能夠在傳接球的配合上，讓跑者出局。<br>• &nbsp; &nbsp;降低守備失誤的傷害 – 守備員在守備時，出現漏球或把球傳偏所形成的守備失誤，能夠靠一開始的守備補位，避免跑者在往下一個壘包前進。</p><p>球員守備能力的區別<br>球員本身的守備能力，能夠從比賽的過程中，看出好壞的差異性。在每一顆球的處理上，若是因為守備員的關係，決定了跑者上壘或出局的結果，那一來一往之間，就更能凸顯出守備的重要性。<br>• &nbsp; &nbsp;守備好 – 守備員處理球的穩定度高，時不時還會出現難度較高的精彩守備，沒收打者的安打。<br>• &nbsp; &nbsp;守備差 – 守備員處理球的穩定度不佳，容易出現守備失誤或守備瑕疵，沒抓到出局數，卻反而讓跑者上壘。</p><p>守備好壞會影響投手投球？</p>', '1716173219.png', '2024-05-20 10:46:59', '投球', '2', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `cart`
--

CREATE TABLE `cart` (
  `id` int(3) NOT NULL,
  `user_id` int(3) NOT NULL,
  `product_id` int(3) NOT NULL,
  `rent_id` int(11) NOT NULL,
  `course_id` int(11) NOT NULL,
  `p_color` varchar(255) DEFAULT NULL,
  `p_size` varchar(255) DEFAULT NULL,
  `p_price` int(5) NOT NULL,
  `p_amount` int(5) NOT NULL,
  `r_color` varchar(255) NOT NULL,
  `r_size` varchar(255) NOT NULL,
  `r_price` int(5) NOT NULL,
  `r_amount` int(5) NOT NULL,
  `start_time` date DEFAULT NULL,
  `end_time` date DEFAULT NULL,
  `c_price` int(5) NOT NULL,
  `c_amount` int(5) NOT NULL,
  `img` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `comment`
--

CREATE TABLE `comment` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `p_id` int(5) NOT NULL,
  `r_id` int(5) NOT NULL,
  `c_id` int(5) NOT NULL,
  `description` varchar(255) NOT NULL,
  `star` int(11) NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `comment`
--

INSERT INTO `comment` (`id`, `user_id`, `p_id`, `r_id`, `c_id`, `description`, `star`, `created_at`) VALUES
(1, 7, 1, 0, 0, '太棒了!! 真的好用', 5, '2024-05-13 11:34:00'),
(2, 7, 3, 0, 0, '太棒了!! 真的好用', 5, '2024-05-13 11:36:00'),
(3, 7, 4, 0, 0, '太棒了!! 真的好用', 5, '2024-05-13 11:37:00'),
(4, 7, 2, 0, 0, '太棒了!! 真的好用', 4, '2024-05-13 11:38:00'),
(5, 60, 5, 0, 0, '太棒了!! 真的好用', 5, '2024-05-13 12:00:00'),
(6, 60, 6, 0, 0, '太棒了!! 真的好用', 5, '2024-05-13 12:07:00'),
(7, 60, 2, 0, 0, '好棒唷', 3, '2024-05-13 14:19:00'),
(8, 10, 7, 0, 0, '太棒了!! 真的好用', 5, '2024-05-13 14:37:00'),
(9, 11, 1, 0, 0, '太棒了啦 BRO  M3', 4, '2024-05-13 14:38:00'),
(10, 12, 2, 0, 0, '你懂得 M3', 4, '2024-05-13 14:50:00'),
(11, 13, 3, 0, 0, '版型不錯，但穿起來偏硬，個人較不習慣。', 3, '2024-05-13 15:06:00'),
(12, 14, 4, 0, 0, '版型不錯，但穿起來偏硬，個人較不習慣。', 4, '2024-05-13 15:09:00'),
(13, 15, 5, 0, 0, '版型不錯，個人較不習慣。', 2, '2024-05-13 15:10:00'),
(14, 16, 6, 0, 0, '沒有我要的顏色', 1, '2024-05-13 15:18:00'),
(15, 17, 7, 0, 0, '版型不錯，但穿起來偏硬，個人較不習慣。', 4, '2024-05-13 15:27:00'),
(16, 18, 8, 0, 0, '很快就收到了  很有效率', 5, '2024-05-13 15:27:00'),
(17, 19, 9, 0, 0, '版型不錯，但穿起來偏硬，個人較不習慣。', 5, '2024-05-13 15:35:00'),
(18, 20, 0, 2, 0, '租用品質維護不錯', 3, '2024-05-13 15:36:00'),
(19, 20, 0, 3, 0, '租用品質維護不錯  也沒有異味', 4, '2024-05-13 15:47:00'),
(20, 21, 0, 2, 0, '租用品質維護不錯', 4, '2024-05-13 15:59:00'),
(21, 21, 0, 3, 0, '租用品質維護不錯  用起來得心應手', 5, '2024-05-14 13:45:00'),
(22, 77, 2, 0, 0, '有成功了吧!!', 3, '2024-05-14 13:46:00'),
(23, 77, 0, 1, 0, '拿到的時候很感動  終於有球具用了', 5, '2024-05-14 14:46:00'),
(24, 78, 0, 1, 0, '版型不錯，但穿起來偏硬，個人較不習慣。套墊的緩衝力很好。', 4, '2024-05-14 15:45:00'),
(25, 61, 0, 1, 0, '版型不錯，但穿起來偏硬，個人較不習慣。緩衝力還不錯。', 5, '2024-05-14 15:45:00'),
(26, 77, 0, 0, 6, '體能課有點太操!!', 1, '2024-05-14 15:45:00'),
(27, 78, 0, 0, 6, '教練很帥', 5, '2024-05-14 16:12:00'),
(28, 70, 0, 0, 6, '這堂課太讚了吧!!', 5, '2024-05-14 16:12:00'),
(29, 38, 0, 0, 6, '教練很NICE   M3', 5, '2024-05-14 16:12:00'),
(30, 22, 0, 4, 0, '租用品質維護不錯', 3, '2024-05-13 15:36:00'),
(31, 23, 0, 4, 0, '租用品質維護不錯  也沒有異味', 4, '2024-05-13 15:47:00'),
(32, 24, 0, 5, 0, '租用品質維護不錯', 4, '2024-05-13 15:59:00'),
(33, 25, 0, 5, 0, '租用品質維護不錯  用起來得心應手', 5, '2024-05-14 13:45:00'),
(34, 2, 8, 0, 0, '很亮  看得喜歡!!', 5, '2024-05-15 13:45:00'),
(35, 2, 7, 0, 0, '很有效率  一下就收到了~', 4, '2024-04-16 13:45:00'),
(36, 3, 6, 0, 0, '你懂得 M3', 5, '2024-03-17 13:45:00'),
(37, 3, 5, 0, 0, '有點咬手  但無傷大雅~', 3, '2024-05-18 13:45:00'),
(38, 4, 4, 0, 0, '很亮  看得喜歡!!', 4, '2024-05-19 13:45:00'),
(39, 4, 3, 0, 0, '很有效率  一下就收到了~', 5, '2024-05-20 13:45:00'),
(40, 5, 2, 0, 0, '你懂得 M3', 5, '2024-05-01 13:45:00'),
(41, 5, 1, 0, 0, '客服應對得體', 5, '2024-05-01 13:45:00'),
(42, 6, 7, 0, 0, '體驗後不錯用   會繼續支持', 4, '2024-05-03 13:45:00'),
(43, 6, 8, 0, 0, '很亮  看得喜歡!!', 4, '2024-04-24 13:45:00'),
(44, 7, 5, 0, 0, '很有效率  一下就收到了~', 3, '2024-01-25 13:45:00'),
(45, 7, 6, 0, 0, '你懂得 M3', 3, '2024-02-26 13:45:00'),
(46, 8, 3, 0, 0, '很亮  看得喜歡!!', 5, '2024-03-27 13:45:00'),
(47, 8, 4, 0, 0, '很有效率  一下就收到了~', 5, '2024-03-28 13:45:00'),
(48, 9, 1, 0, 0, '你懂得 M3', 4, '2024-04-29 13:45:00'),
(49, 9, 2, 0, 0, '很亮  看得喜歡!!', 4, '2024-01-30 13:45:00'),
(50, 34, 0, 4, 0, '有點咬手  但無傷大雅~', 3, '2024-05-12 14:38:00'),
(51, 35, 0, 4, 0, '雖是租用，但看得出來有保養', 3, '2024-05-13 14:38:00'),
(52, 36, 0, 5, 0, '好用，拿起來感覺變高手', 5, '2024-05-14 14:38:00'),
(53, 37, 0, 5, 0, '租用品質維護不錯', 4, '2024-05-15 14:38:00'),
(54, 38, 0, 6, 0, '租用品質維護不錯', 4, '2024-05-16 14:38:00'),
(55, 39, 0, 6, 0, '有點咬手  但無傷大雅~', 3, '2024-05-17 14:38:00'),
(56, 40, 0, 7, 0, '雖是租用，但看得出來有保養', 3, '2024-05-18 14:38:00'),
(57, 43, 0, 7, 0, '好用，拿起來感覺變高手', 5, '2024-05-19 14:38:00'),
(58, 45, 0, 8, 0, '好用，拿起來感覺變高手', 5, '2024-05-20 14:38:00'),
(59, 47, 0, 8, 0, '租用品質維護不錯', 4, '2024-02-21 14:38:00'),
(60, 49, 0, 1, 0, '好用，拿起來感覺變高手', 5, '2024-02-22 14:38:00'),
(61, 51, 0, 2, 0, '雖是租用，但看得出來有保養', 4, '2024-02-23 14:38:00'),
(62, 53, 0, 3, 0, '有點咬手  但無傷大雅~', 3, '2024-02-24 14:38:00'),
(63, 55, 0, 4, 0, '好用，拿起來感覺變高手', 3, '2024-02-25 14:38:00'),
(64, 57, 0, 5, 0, '啥時有海外版  想要', 4, '2024-02-26 14:38:00'),
(65, 59, 0, 6, 0, '雖是租用，但看得出來有保養', 3, '2024-02-27 14:38:00'),
(66, 41, 0, 7, 0, '有點咬手  但無傷大雅~', 3, '2024-02-28 14:38:00'),
(67, 42, 0, 8, 0, '好用，拿起來感覺變高手', 5, '2024-03-28 13:45:00'),
(68, 44, 0, 0, 1, '餵球打起來特別爽', 5, '2024-01-01 22:45:00'),
(69, 46, 0, 0, 1, '教練人很好~', 4, '2024-01-02 21:45:00'),
(70, 48, 0, 0, 2, '餵球打起來特別爽', 5, '2024-01-03 21:45:00'),
(71, 50, 0, 0, 2, '太棒了~', 4, '2024-01-04 21:45:00'),
(72, 52, 0, 0, 3, '餵球打起來特別爽', 5, '2024-01-05 21:45:00'),
(73, 54, 0, 0, 3, '能打150KM的球  有夠爽', 5, '2024-01-06 21:45:00'),
(74, 56, 0, 0, 4, '餵球打起來特別爽', 5, '2024-01-07 21:45:00'),
(75, 58, 0, 0, 4, '能打150KM的球  有夠爽', 5, '2024-01-08 21:45:00'),
(76, 60, 0, 0, 5, '教練人很好~', 5, '2024-01-09 21:45:00'),
(77, 1, 0, 0, 5, '教練也會指導守備動作  吸收良多', 4, '2024-01-10 21:45:00'),
(78, 10, 0, 0, 6, '很扎實   會學到東西', 4, '2024-01-11 21:45:00'),
(79, 20, 0, 0, 6, '啥時可以跟健身房合作  感覺更有效率', 3, '2024-01-12 21:45:00'),
(80, 30, 0, 0, 7, '教練人很好~', 4, '2024-01-13 21:15:00'),
(81, 40, 0, 0, 7, '能幫家裡的孩子放放電  家長也能同樂', 4, '2024-01-14 21:45:00'),
(82, 50, 0, 0, 8, '教練人很好~', 5, '2024-01-15 21:45:00'),
(83, 5, 0, 0, 8, '能幫家裡的孩子放放電  家長也能同樂', 4, '2024-01-16 21:45:00'),
(84, 15, 0, 0, 1, '打得超爽', 5, '2024-01-17 13:45:00'),
(85, 25, 0, 0, 2, '機器很準   可以輕鬆練習內外角', 4, '2024-01-18 21:45:00'),
(86, 35, 0, 0, 3, '機器很準   可以輕鬆練習內外角', 4, '2024-01-19 12:45:00'),
(87, 45, 0, 0, 4, '機器很準   可以輕鬆練習內外角', 5, '2024-01-20 21:45:00'),
(88, 55, 0, 0, 5, '教練很有耐心  ', 4, '2024-01-21 17:45:00'),
(89, 11, 0, 0, 6, '小朋友要入科班推薦來上  很實用', 5, '2024-01-22 21:45:00'),
(90, 21, 0, 0, 7, '很適合小朋友入門', 4, '2024-01-23 21:45:00'),
(91, 31, 0, 0, 8, '很適合小朋友入門', 5, '2024-01-24 18:45:00'),
(92, 41, 0, 0, 8, '太棒了~', 4, '2024-01-25 18:45:00'),
(93, 51, 0, 0, 7, '太棒了~', 5, '2024-01-26 18:45:00'),
(94, 60, 0, 0, 6, '太棒了~', 5, '2024-01-27 18:45:00'),
(95, 22, 0, 0, 5, '太棒了~', 4, '2024-01-28 18:45:00'),
(96, 32, 0, 0, 4, '太棒了~', 4, '2024-01-29 18:45:00'),
(97, 42, 0, 0, 3, '太棒了~', 4, '2024-01-30 18:45:00'),
(98, 52, 0, 0, 2, '太棒了~', 5, '2024-01-31 18:45:00'),
(99, 33, 1, 0, 0, '球型不錯', 5, '2024-02-01 21:45:00'),
(100, 43, 2, 0, 0, '啥時提供代客湯揉服務阿', 4, '2024-02-02 21:45:00'),
(101, 53, 3, 0, 0, '美津濃鐵粉報到!!!!!', 5, '2024-02-03 21:45:00'),
(102, 13, 4, 0, 0, '美津濃鐵粉報到!!!!!', 5, '2024-02-04 21:45:00'),
(103, 23, 5, 0, 0, '美津濃鐵粉報到!!!!!', 5, '2024-02-05 21:45:00'),
(104, 14, 6, 0, 0, '美津濃鐵粉報到!!!!!', 5, '2024-02-06 21:45:00'),
(105, 24, 7, 0, 0, '美津濃鐵粉報到!!!!!', 5, '2024-02-07 21:45:00'),
(106, 34, 8, 0, 0, '很耐磨，練揮棒都不磨手了', 4, '2024-02-08 21:45:00'),
(107, 44, 0, 1, 0, '雖是租的，但保養得很好', 4, '2024-02-09 21:45:00'),
(108, 54, 0, 2, 0, '啥時提供日本最新版本讓我們體驗體驗呀~', 4, '2024-02-10 21:45:00'),
(109, 16, 0, 3, 0, '雖是租的，但保養得很好', 4, '2024-02-11 21:45:00'),
(110, 26, 0, 4, 0, '啥時提供日本最新版本讓我們體驗體驗呀~', 5, '2024-02-12 21:45:00'),
(111, 36, 0, 5, 0, '雖是租的，但保養得很好', 5, '2024-02-13 21:45:00'),
(112, 46, 0, 6, 0, '啥時提供日本最新版本讓我們體驗體驗呀~', 5, '2024-02-14 21:45:00'),
(113, 56, 0, 7, 0, '雖是租的，但保養得很好', 5, '2024-02-15 21:45:00'),
(114, 17, 0, 8, 0, '啥時提供日本最新版本讓我們體驗體驗呀~', 4, '2024-02-16 21:45:00'),
(115, 27, 0, 0, 1, '教練餵還能順便指導動作', 5, '2024-02-17 21:45:00'),
(116, 37, 0, 0, 2, '機器很順  不卡球', 4, '2024-02-18 21:45:00'),
(117, 47, 0, 0, 3, '機器很順  不卡球', 4, '2024-02-19 21:45:00'),
(118, 57, 0, 0, 4, '機器很順  不卡球', 4, '2024-02-20 21:45:00'),
(119, 19, 0, 0, 5, '教練LOGU練起來才有實戰感', 5, '2024-02-21 21:45:00'),
(120, 29, 0, 0, 6, '除了練棒球  想提升體能的都建議體驗看看', 5, '2024-02-22 21:45:00'),
(121, 39, 0, 0, 7, '讓小朋友來體驗  都愛上棒球了', 5, '2024-02-23 21:45:00'),
(122, 49, 0, 0, 8, '讓小朋友來體驗  都愛上棒球了', 5, '2024-02-24 21:45:00'),
(123, 59, 0, 0, 7, '小朋友來了都很開心', 5, '2024-02-25 21:45:00');

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `id` int(3) NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` varchar(255) NOT NULL,
  `option` varchar(30) NOT NULL,
  `time_start` date NOT NULL,
  `time_end` date NOT NULL,
  `discount` float NOT NULL,
  `coding` varchar(255) NOT NULL,
  `use_time` int(10) NOT NULL,
  `use_restrict` int(10) NOT NULL,
  `use_condition` varchar(20) NOT NULL,
  `update_time` datetime DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `valid` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `coupon`
--

INSERT INTO `coupon` (`id`, `name`, `description`, `option`, `time_start`, `time_end`, `discount`, `coding`, `use_time`, `use_restrict`, `use_condition`, `update_time`, `created_at`, `valid`) VALUES
(1, '七折券', '七折', '%數折扣', '2024-01-02', '2024-05-31', 0.7, 'WHJBOLO8AH', 10, 500, '已停用', '2024-02-06 14:09:36', '2024-01-30 11:57:10', 1),
(2, '八折券', '八折', '%數折扣', '2023-12-05', '2024-06-01', 0.8, '3SC4KXVOCO', 20, 800, '可使用', NULL, '2024-01-30 11:57:43', 1),
(3, '滿千折百', '滿千折百', '金額折扣', '2024-01-28', '2024-06-12', 100, 'RFHUUKVXU3', 5, 1000, '已停用', '2024-02-01 22:22:15', '2024-01-30 11:58:17', 1),
(4, '滿百折十', '滿百折十', '金額折扣', '2024-01-05', '2024-07-12', 10, 'XRH6JYLKQ1', 55, 100, '可使用', NULL, '2024-01-30 11:58:50', 1),
(5, '夏季無敵優惠', '滿千折250', '金額折扣', '2023-12-05', '2024-06-30', 250, 'NYILN1SXLI', 150, 1000, '可使用', NULL, '2024-01-30 11:59:28', 1),
(6, '五折券', '五折', '%數折扣', '2023-09-13', '2024-05-31', 0.5, 'H9V23GYDLQ', 50, 2000, '已停用', NULL, '2024-01-30 11:59:56', 1),
(7, ' 七折券', '七折', '%數折扣', '2024-01-25', '2024-06-04', 0.7, 'DOH3Q070PJ', 20, 50, '可使用', '2024-02-01 22:53:45', '2024-01-30 13:25:01', 1),
(8, '折300', '滿800折300', '金額折扣', '2024-01-18', '2024-06-10', 300, '1IP5WVMKCB', 5, 800, '已停用', NULL, '2024-01-30 13:25:50', 1),
(9, '折100', '滿999折100', '金額折扣', '2024-02-07', '2024-05-31', 100, 'NGH0C67C8P', 1, 999, '可使用', NULL, '2024-01-30 13:26:32', 1),
(10, '三折券', '三折', '%數折扣', '2024-03-01', '2024-06-30', 0.3, 'SBXQS531VK', 999, 5000, '可使用', NULL, '2024-01-30 13:27:12', 1),
(11, '周年慶', '一折', '%數折扣', '2024-03-01', '2024-06-14', 0.1, 'G22XZ1HKYG', 999, 10000, '可使用', NULL, '2024-01-30 13:27:47', 1),
(12, '折500', '滿1000折500', '金額折扣', '2024-01-10', '2024-07-19', 500, 'SX1FDLV7U8', 2, 1000, '已停用', NULL, '2024-01-30 14:08:18', 1),
(13, '夏日七折券', '七折', '%數折扣', '2024-01-11', '2024-08-31', 0.7, 'T706J7543L', 500, 2500, '可使用', NULL, '2024-01-30 14:09:06', 1),
(14, '生日慶', '一折', '%數折扣', '2024-01-20', '2024-08-30', 0.1, '6F9CMS29PB', 50, 10000, '已停用', NULL, '2024-01-30 14:55:11', 1),
(15, '豪華兩萬', '折2000', '金額折扣', '2024-03-08', '2024-07-31', 2000, 'F5PNSN2NRY', 999, 20000, '可使用', NULL, '2024-01-30 14:55:46', 1),
(16, '尊享滿5000', '499', '金額折扣', '2023-10-31', '2024-06-28', 499, 'FFPHABCI89', 50, 5000, '已停用', NULL, '2024-01-30 14:56:35', 1),
(17, '周年慶', '現折1999', '金額折扣', '2024-03-07', '2024-07-18', 1999, 'MD9SGVGEU0', 50, 0, '可使用', NULL, '2024-01-30 14:57:27', 1),
(18, '特級優惠', '六折', '%數折扣', '2024-12-30', '2025-01-31', 0.6, '48K1F7FAHN', 33, 3500, '已停用', NULL, '2024-01-30 14:58:18', 1),
(19, '尊榮兩折', '兩折', '%數折扣', '2024-01-26', '2024-05-31', 0.2, '0Z2MUIMTS1', 555, 555, '已停用', NULL, '2024-01-30 15:02:40', 1),
(20, '父親節', '父親節優惠滿2888折888', '金額折扣', '2024-03-07', '2024-08-31', 888, 'MPWEYBYFJY', 888, 2888, '已停用', NULL, '2024-01-30 15:03:14', 1),
(21, '母親節', '六折', '%數折扣', '2024-05-01', '2024-07-25', 0.6, '7EYM3BSNQ3', 666, 2999, '可使用', NULL, '2024-01-30 15:03:48', 1),
(22, '兒童節', '兒童節八折優惠', '%數折扣', '2024-03-01', '2024-04-30', 0.8, 'T80T3Q70OA', 20, 500, '可使用', NULL, '2024-01-30 15:04:25', 1),
(23, '滿百折十', '滿百折十', '金額折扣', '2023-11-01', '2024-08-22', 10, 'PRUXGMABKE', 99999, 100, '已停用', NULL, '2024-01-30 15:05:08', 1),
(24, '新年特惠', '新年滿3999享2折特惠', '%數折扣', '2024-02-01', '2024-08-08', 0.2, 'YW5VW393WL', 30, 3999, '可使用', NULL, '2024-01-30 15:06:57', 1),
(25, '666一路順', '滿5000折666', '金額折扣', '2024-01-01', '2024-06-21', 666, 'EPX1BTIQ5J', 5646, 5000, '可使用', NULL, '2024-01-30 15:09:42', 1),
(26, '超值六折券', '六折', '%數折扣', '2024-01-18', '2024-02-29', 0.6, '1TG36P28MW', 6, 100, '可使用', NULL, '2024-01-30 15:10:47', 1),
(27, '八發發折券', '八折', '%數折扣', '2024-03-01', '2024-03-31', 0.8, '2XVAUIX7UE', 80, 0, '已停用', NULL, '2024-01-30 15:11:11', 1),
(28, '特優九折券', '九折', '%數折扣', '2023-10-05', '2024-05-31', 0.9, 'U94B8JJ3M2', 5, 0, '已停用', NULL, '2024-01-30 15:11:37', 1),
(29, 'aaaaa', 'aaaa', '金額折扣', '2024-01-17', '2024-01-31', 50, 'POUXXDUOXM', 50, 550, '已停用', '2024-01-31 22:43:36', '2024-01-30 15:12:34', 1),
(30, '五折券', '五折', '%數折扣', '2024-06-12', '2024-07-31', 0.5, 'PSMZIYE9LD', 10, 50, '可使用', NULL, '2024-01-30 15:14:07', 1),
(31, '折999', '999', '金額折扣', '2024-01-02', '2024-06-27', 999, 'KKT2W2Q2XO', 999, 999, '已停用', NULL, '2024-01-30 15:14:33', 1),
(32, '歡慶大放送', '一折', '%數折扣', '2024-02-01', '2024-06-30', 0.1, 'CB8E8ZGGAN', 99999, 0, '已停用', NULL, '2024-01-30 15:15:20', 1),
(33, 'a換慶XXX落敗', '現折1999', '金額折扣', '2024-07-01', '2024-07-31', 1999, 'G3JDRAEL6F', 50, 3999, '可使用', NULL, '2024-01-30 15:16:27', 1),
(34, '限時特賣', '限時', '%數折扣', '2024-03-01', '2024-03-08', 0.5, 'PJHPP36U2X', 5, 10, '可使用', NULL, '2024-01-30 15:17:02', 1),
(35, 'a優惠', 'aaaa', '%數折扣', '2024-01-05', '2024-02-02', 0.3, '4WG6HFZ109', 48448, 44564564, '可使用', NULL, '2024-01-30 15:46:35', 1),
(36, 'b六折券', '6折', '%數折扣', '2024-02-08', '2024-03-31', 0.6, 'W3L6UHX03K', 66, 666, '已停用', NULL, '2024-01-30 16:13:42', 1),
(37, 'c六折券', '六折', '%數折扣', '2024-01-02', '2024-01-23', 0.6, 'YHM3AQLX8J', 50, 0, '已停用', NULL, '2024-01-30 16:14:06', 1),
(38, 'd六折', '6666', '%數折扣', '2024-04-11', '2024-05-31', 0.6, 'D3XV613VOC', 1, 300, '可使用', NULL, '2024-01-30 16:14:34', 1),
(39, 'b三折', '3折', '%數折扣', '2023-11-07', '2024-01-17', 0.3, 'QI7Q2TGZXN', 20, 99, '已停用', NULL, '2024-01-30 16:15:00', 1),
(40, '滿五千折五百', '5000-500', '金額折扣', '2023-12-01', '2024-07-12', 500, '5N615XAE0K', 50, 5000, '可使用', NULL, '2024-01-30 16:15:46', 1),
(41, '滿5000折1000', '5000-1000', '金額折扣', '2024-02-01', '2024-02-15', 1000, 'D7WIVYWBHZ', 40, 50, '已停用', NULL, '2024-01-30 16:16:28', 1),
(42, '滿1000折200', '1000-200', '金額折扣', '2024-03-01', '2024-03-30', 200, 'IW5HZZV7E9', 20, 1000, '可使用', NULL, '2024-01-30 16:16:58', 1),
(43, 'b九折券', '0.9', '%數折扣', '2024-02-29', '2024-03-01', 0.9, 'IDCJ5OWMZI', 1, 100, '可使用', NULL, '2024-01-30 16:27:59', 1),
(44, 'c三折券', '0.3', '%數折扣', '2024-01-01', '2024-02-29', 0.3, 'CSCLY8XCP5', 30, 300, '可使用', NULL, '2024-01-30 16:28:31', 1),
(45, '折10', '-10', '金額折扣', '2024-02-01', '2024-02-29', 10, '6SX8ZAA7OO', 500, 0, '已停用', NULL, '2024-01-30 16:31:10', 1),
(46, 'b四折券', '*0.4', '%數折扣', '2023-10-11', '2024-01-04', 0.4, '7O3VO13Z8W', 50, 500, '已停用', NULL, '2024-01-30 16:31:35', 1),
(47, '棒球日優惠', '棒球日滿100享1折優惠', '%數折扣', '2023-01-01', '2024-08-09', 0.1, 'YM4QITZ4CK', 999, 100, '已停用', NULL, '2024-01-30 21:30:51', 1),
(48, '限時特賣', '-499', '金額折扣', '2024-01-31', '2024-02-29', 499, '718HD5GMRF', 100, 500, '可使用', NULL, '2024-01-30 21:32:05', 1),
(49, '三折券', '*0.3', '%數折扣', '2023-11-01', '2024-03-29', 0.3, 'MF8GWQFGA0', 30, 399, '可使用', NULL, '2024-01-30 21:33:04', 1),
(50, '歡慶OOO', '歡慶~~~~', '%數折扣', '2023-12-01', '2024-01-31', 0.2, 'FFR3RR7P15', 100, 200, '可使用', NULL, '2024-01-30 21:35:39', 1),
(51, '歡慶XXX輸球', '歡慶XXX輸球', '金額折扣', '2024-02-01', '2024-03-31', 999, '7RMIB22CV9', 999, 999, '可使用', NULL, '2024-01-30 21:36:31', 1),
(52, '500大放送', '滿500折99', '金額折扣', '2024-01-04', '2024-05-31', 99, 'L49YHE5386', 25, 500, '可使用', NULL, '2024-01-30 21:37:12', 1),
(53, '棒球狂歡嘉年華', '五折', '%數折扣', '2024-01-25', '2024-09-30', 0.5, 'DWG7EQAB9V', 50, 999, '已停用', NULL, '2024-01-31 11:31:00', 1),
(54, '一萬樂翻天', '折500', '金額折扣', '2024-01-30', '2024-02-15', 500, 'PKM1U53KB5', 123, 10000, '可使用', NULL, '2024-02-06 14:10:36', 1),
(55, '端午節優惠', '端午划龍舟九折', '%數折扣', '2024-05-01', '2024-06-10', 0.9, 'AS26PVKJEX', 1, 1000, '可使用', NULL, '2024-05-09 04:13:30', 1),
(56, '開幕優惠', '開幕大放送九折', '%數折扣', '2024-05-09', '2024-05-31', 0.9, 'Q1K62YN26S', 1, 1000, '可使用', NULL, '2024-05-09 04:14:20', 1),
(57, '夏季優惠', '夏季促銷九折', '%數折扣', '2024-05-09', '2024-06-30', 0.9, 'VXJG9R71RG', 1, 1000, '可使用', NULL, '2024-05-09 04:15:19', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `course`
--

CREATE TABLE `course` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` varchar(1000) NOT NULL,
  `price` int(10) NOT NULL,
  `photo` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  `course_start` datetime DEFAULT NULL,
  `course_end` datetime DEFAULT NULL,
  `type` varchar(30) NOT NULL,
  `type_id` varchar(50) NOT NULL,
  `teacher_id` varchar(50) DEFAULT NULL,
  `outline` varchar(255) NOT NULL,
  `valid` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `course`
--

INSERT INTO `course` (`id`, `name`, `description`, `price`, `photo`, `created_at`, `course_start`, `course_end`, `type`, `type_id`, `teacher_id`, `outline`, `valid`) VALUES
(1, '打擊練習教練', '\n這個打擊練習教練課程旨在幫助球員提升他們的打擊技能。課程包含基礎技巧、戰術應用和心理素質的培訓。學生將學習握持和擊球姿勢、擺動動作、擊球範圍的掌握，以及面對不同球種的應對策略。課程還將重點放在如何在比賽中應對不同局勢的技巧上，以及如何在關鍵時刻保持冷靜和專注。透過持續的練習和指導，學生將能夠提高他們的打擊技能，成為更出色的球員。', 100, '1.jpg,KefnewczEE.png', '2024-01-22 10:04:39', '2024-02-02 15:30:00', '2024-06-02 16:30:00', '打擊', '1', '5', '1. 打擊基本姿勢與握持<br> 2. 擊球技巧與練習<br> 3. 動作調整與改進<br> 4. 擊球訓練工具與設備<br> 5. 心理技巧與專注訓練<br> 6. 實戰模擬與比賽情境訓練<br> 7. 體能與力量訓練<br> 8. 教練角色與溝通技巧<br>', 1),
(2, '打擊練習HitTrax發球機餵球', '這個打擊練習課程利用HitTrax發球機為學生提供高效、精準的球速和球種訓練。課程包括150個練習課，涵蓋了從基礎到進階的各種技能和戰術。學生將透過定制的餵球設置，練習應對不同球速和球種的打擊技巧。課程還將教授打擊姿勢、握持、擊球力量控制和打擊範圍調整等基本技巧。此外，學生還將學習如何根據投手的手法和比賽局勢調整打擊策略。透過反覆練習和即時反饋，學生將能夠提高他們的打擊水準，成為更加全面的球員。', 200, '2.jpg', '2024-01-22 10:04:47', '2024-01-29 13:00:00', '2024-05-31 14:00:00', '打擊', '1', '6', '50顆球/ 可即時呈現打擊數據', 0),
(3, '打擊練習\n發球機餵球', '這個打擊練習課程利用HitTrax發球機為學生提供高效、精準的球速和球種訓練。課程包括150個練習課，涵蓋了從基礎到進階的各種技能和戰術。學生將透過定制的餵球設置，練習應對不同球速和球種的打擊技巧。課程還將教授打擊姿勢、握持、擊球力量控制和打擊範圍調整等基本技巧。此外，學生還將學習如何根據投手的手法和比賽局勢調整打擊策略。透過反覆練習和即時反饋，學生將能夠提高他們的打擊水準，成為更加全面的球員。', 100, '3.jpg', '2024-01-22 10:04:51', '2024-01-19 00:00:00', '2024-06-17 00:00:00', '打擊', '1', '6', '50顆球/ 可調速度', 1),
(4, '打擊練習HitTrax教練餵球', '這個打擊練習課程利用HitTrax發球機為學生提供高效、精準的球速和球種訓練。課程包括150個練習課，涵蓋了從基礎到進階的各種技能和戰術。學生將透過定制的餵球設置，練習應對不同球速和球種的打擊技巧。課程還將教授打擊姿勢、握持、擊球力量控制和打擊範圍調整等基本技巧。此外，學生還將學習如何根據投手的手法和比賽局勢調整打擊策略。透過反覆練習和即時反饋，學生將能夠提高他們的打擊水準，成為更加全面的球員。', 200, '4.jpg', '2024-01-22 10:04:55', '2024-04-11 09:01:00', '2024-06-07 09:02:00', '打擊', '1', '1', '25顆/ 可即時呈現打擊數據', 1),
(5, '守備練習教練擊球', '守備練習教練擊球課程旨在提高學生在守備位置上的技能和反應速度。這個課程將通過使用不同速度和角度的擊球機或發球手來模擬真實比賽場景，幫助學生在不同守備位置上進行有效的擊球訓練。課程將涵蓋擊球的基本技巧，包括站位、擊球角度、握持、擺動、以及擊球後的追球和準備再次投球的能力。學生還將學習如何根據不同球種和速度做出適當的守備反應，以及如何在壓力下保持冷靜和準確。透過這個課程，學生將能夠提高他們的守備技能，增強球隊的整體防守能力。', 100, '5.jpg', '2024-01-22 10:04:58', '2024-04-24 09:02:00', '2024-06-05 09:02:00', '守備', '3', '1', '50顆', 1),
(6, '體能練習肌力體能訓練班', ' 這個體能練習肌力體能訓練班旨在提升學員的身體素質和肌力水平。課程結合了多種訓練方法，包括重量訓練、功能性訓練和核心訓練，以幫助學員達到最佳的體能水平。課程將涵蓋以下內容：  身體姿勢和基本動作的評估：學員將接受身體結構和姿勢評估，以確定個人的訓練需求和目標。  基礎肌力訓練：學員將學習如何透過重量訓練和機能訓練來增強全身肌肉力量，包括上半身、下半身和核心部位。  功能性訓練：課程將包括一系列模擬日常活動和運動動作的功能性訓練，以提高學員的身體穩定性、平衡性和協調性。  有氧運動：課程將結合有氧運動，如跑步、跳繩等，以提高心肺功能和耐力。  伸展和恢復：學員將學習伸展和恢復運動，以幫助肌肉恢復，預防運動傷害，並提高靈活性。  這個訓練班將為學員提供全面的肌力和體能訓練，幫助他們在運動和日常生活中表現更出色，同時減少受傷的風險。', 500, '6.jpg', '2024-01-17 10:05:04', '2024-02-23 17:00:00', '2024-06-03 18:00:00', '體能', '4', '9', '固定周六 1700~1800<br> 1.藥球投球發力訓練<br> 2.藥球打擊發力訓練<br> 3.基礎速度體能訓練<br> 4.基礎槓鈴訓練', 1),
(7, '初階課程(6Y-9Y)', '我們的初階課程旨在為6至9歲的學員提供有趣和互動的學習體驗，同時建立他們的運動技能和自信心。以下是課程的主要內容：<br>  基礎運動技能：教授基本的運動動作，如跑步、跳躍、捉球、投球等，以及相關的基礎技術。  <br>手眼協調訓練：透過各種遊戲和活動，提高孩子們的手眼協調能力，包括接球、拋球、擊球等。  平衡和靈活性：通過平衡板、<br>障礙訓練等活動，培養孩子們的平衡感和靈活性，增強身體控制能力。<br>  團隊合作：通過團隊遊戲和合作活動，培養孩子們的合作精神和團隊意識，提高溝通和協作能力。<br>  運動遊戲：結合各種趣味運動遊戲，讓孩子們在玩樂中學習基本運動技能，培養對運動的興趣和熱愛。  <br>這個初階課程將提供一個安全、有趣和具有挑戰性的學習環境，幫助孩子們建立健康的身體素質、積極的運動態度和良好的社交技能。我们相信通過這個課程，孩子們將成為更加自信和健康的個體。', 1000, '7.jpg', '2024-01-12 10:05:08', '2024-03-13 08:54:00', '2024-07-18 08:54:00', '打擊,投球,守備', '1,2,3', '4', '打擊守備投球綜合學習訓練<br> 固定周六 1300~1500', 1),
(8, '初階課程(10Y-12Y)', '我們的初階課程針對10至12歲的學員，旨在建立他們的運動基礎，培養他們的技能和自信心。以下是課程的主要內容：  <br>基礎運動技能：學習和加強基本的運動技能，如跑步、跳躍、捉球、投球等，並透過練習和反覆練習來提高技能水平。  <br>技術訓練：深入學習特定運動領域的技術，例如足球的帶球、傳球和射門，籃球的運球、投籃和防守等，並透過實際應用來提高技術水平。  <br>戰術理解：介紹基本的運動戰術和策略，如隊形、位置轉換、團隊合作等，幫助學員更好地理解比賽的戰術性。  <br>團隊合作：通過團隊遊戲和合作活動，培養學員的合作精神和團隊意識，並提高溝通和協作能力。 <br> 運動競賽：提供比賽和表演的機會，讓學員能夠在實際比賽中應用所學技能，並體驗競爭和合作的樂趣。 <br> 這個初階課程將為學員提供一個全面的運動訓練和成長的機會，幫助他們建立健康的身體素質、積極的運動態度和良好的社交技能。我們相信通過這個課程，學員將成為更加自信、技術優秀且具有良好運動精神的運動員。', 1500, '8.jpg', '2024-01-08 10:05:11', '2024-03-01 00:00:00', '2024-05-17 00:00:00', '打擊,投球,守備', '1,2,3', '1', '打擊守備投球綜合學習訓練<br> 固定周六 1500~1700', 1),
(9, '初階課程(青年/成人)', '我們的初階課程針對青年和成人學員，旨在為他們提供一個全面的運動入門體驗，幫助他們建立健康的身體素質和運動技能。以下是課程的主要內容：  運動基礎知識：<br>介紹各種運動的基本知識，包括規則、技術、戰術等，幫助學員了解不同運動的特點和要求。  <br>基礎運動技能：學習和加強基本的運動技能，如跑步、跳躍、捉球、投球等，並透過練習和指導來提高技能水平。  <br>身體素質訓練：包括力量、耐力、速度、靈活性等方面的訓練，幫助學員建立良好的身體素質和運動能力。 <br> 運動技巧訓練：深入學習特定運動領域的技術，如足球的帶球、傳球和射門，籃球的運球、投籃和防守等，並透過實際應用來提高技術水平。 <br> 健康生活方式：提供健康生活方式的指導和建議，包括飲食、休息、心理健康等方面的知識，幫助學員保持良好的身心健康。  <br>這個初階課程將為學員提供一個全面的運動訓練和成長的機會，幫助他們建立健康的生活習慣、積極的運動態度和良好的身體素質。我們相信通過這個課程，學員將成為更加自信、健康且具有運動技能的個體。', 2500, '9.jpg', '2024-01-25 10:05:16', '2024-04-11 09:01:00', '2024-05-22 09:01:00', '打擊,投球,守備', '1,2,3', '1', '1. 介紹與安全注意事項<br> 2. 基本姿勢與握持<br> 3. 基本擊球技巧<br> 4. 守備技巧<br> 5. 跑壘技巧<br> 6. 球賽規則與戰術<br> 7. 策略與智慧<br> 8. 比賽模擬與實戰演練<br> 9. 體能與訓練<br> 10. 結業評估與回顧<br>', 1),
(10, '初階課程(女性)', '我們的初階課程針對女性學員，旨在為她們提供一個舒適和友善的環境，幫助她們建立健康的身體素質和運動技能。以下是課程的主要內容： <br> 運動基礎知識：介紹各種運動的基本知識，包括規則、技術、戰術等，讓學員了解不同運動的特點和要求。 <br> 基礎運動技能：學習和加強基本的運動技能，如跑步、跳躍、捉球、投球等，並透過練習和指導來提高技能水平。 <br> 身體塑形訓練：包括核心訓練、柔韌度訓練、有氧運動等，幫助學員塑造健美的身體線條，提高體態美感。 <br> 健康生活方式：提供健康生活方式的指導和建議，包括飲食、休息、心理健康等方面的知識，幫助學員保持良好的身心健康。 <br> 社交和支持：提供一個支持和鼓勵的環境，讓學員在課程中建立友誼，互相支持和鼓勵，共同進步。 <br> 這個初階課程將為女性學員提供一個安全、舒適和有趣的學習環境，幫助她們建立健康的生活習慣、積極的運動態度和自信心。我們相信通過這個課程，女性學員將成為更加健康、自信和活力充沛的個體。', 1000, '10.jpg', '2024-03-14 10:05:20', '2024-04-16 10:01:12', '2024-07-11 10:03:20', '打擊,投球,守備', '1,2,3', '3', '打擊守備投球綜合學習訓練<br> 固定周日 1500~1700', 1),
(16, '打擊特訓班', '打擊特訓班是針對棒球或壘球運動員設計的培訓課程，旨在提高他們的打擊技術和能力。以下是一個典型的打擊特訓班的主要內容：<br> <br> 打擊基本功：課程將著重於教授學員打擊的基本技術，包括揮拍姿勢、握拍方式、站位平衡、擊球視線等，建立良好的打擊基礎。<br> <br> 打擊姿勢與擊球區域：學員將學習不同的打擊姿勢和擊球區域，包括如何應對不同類型的球速、球種和球路，以提高在比賽中的應對能力。<br> <br> 打擊訓練技巧：課程將介紹各種打擊訓練技巧，包括使用投球機、擊打運動器材、進行模擬比賽等，以提高學員的打擊速度、力量和精準度。<br> <br> 打擊心理戰：培訓學員如何應對壓力、集中注意力、保持自信心和冷靜頭腦，在比賽中取得更好的表現。<br> <br> 录像分析和反饋：課程可能會使用錄像分析技術，記錄學員的打擊動作，並通過反饋來幫助他們改進技術和提高表現水平。<br> <br> 體能訓練：打擊特訓班通常也包括一些體能訓練，以提高學員的身體素質、爆發力和耐力，從而增強打擊表現。<br> <br> 打擊特訓班的目標是通過系統化的訓練計劃和專業的指導，幫助學員提高打擊技術水平，增強在比賽中的競爭力。透過課程的學習和實踐，學員可以建立自信心、提高打擊成功率，並在棒球或壘球比賽中發揮更出色的表現。', 600, '16.jpg', '2024-03-08 10:06:54', '2024-03-06 10:03:38', '2024-06-04 15:00:00', '打擊', '1', '2,5,10', '星期日1400~1500', 1),
(17, '守備特訓班', '守備特訓班是針對棒球或壘球運動員的培訓課程，主要旨在提高他們的守備技能和戰術意識。<br> 以下是一個典型的守備特訓班的主要內容：<br> <br>  基本守備技能：課程將專注於教授學員守備的基本技能，包括接球、投球、扔球、接殺、滾地球等，建立穩固的守備基礎。<br> <br> 守備姿勢和移動：學員將學習正確的守備姿勢和移動技巧，包括站位平衡、腳步踏實、視線專注等，以應對不同的守備場景和球路。<br> <br> 守備位置和協作：課程將介紹不同的守備位置和區域，包括內野、外野、捕手等，並教導學員如何與隊友協作，實現無縫的守備轉換和防守戰術。<br> <br> 守備訓練技巧：課程將涵蓋各種守備訓練技巧，包括使用守備器材、模擬比賽情境、分析守備數據等，以提高學員的守備速度、反應和準確度。<br> <br> 戰術意識和判斷力：培訓學員如何在比賽中做出正確的守備決策，包括應對不同局勢的守備戰術和策略，以及如何在關鍵時刻做出正確的判斷。<br> <br> 录像分析和反饋：課程可能會利用錄像分析技術，記錄學員的守備動作，並通過反饋來幫助他們改進技術和提高表現水平。<br> <br> 守備特訓班的目標是通過系統化的訓練計劃和專業的指導，幫助學員提高守備技術水平，增強在比賽中的競爭力。<br> 透過課程的學習和實踐，學員可以建立自信心、提高守備成功率，並在球場上展現出色的守備表現。', 600, '16.jpg', '2024-04-18 10:06:57', '2024-02-02 15:00:00', '2024-06-08 16:00:00', '守備', '3', '2,5,10', '星期日1500~1600', 1),
(18, '打擊動力鏈檢核班', ' 打擊動力鏈檢核班是針對棒球或壘球運動員的專業培訓課程。<br> <br> 課程內容包括：<br>  動力鏈解析：學習人體動力鏈的結構和運作，了解如何將身體各部位的力量連貫地應用於擊球動作中。<br> <br> 打擊姿勢評估：進行專業的姿勢評估，發現並糾正學員的擊球姿勢中可能存在的問題，以提高擊球效率和準確性。<br> <br> 核心力量訓練：通過一系列核心訓練，強化學員的核心穩定性和爆發力，有助於改善揮拍力量和速度。<br> <br> 技巧矯正：針對個人技術缺陷提供專業的矯正訓練，幫助學員改進擊球動作並提高成功率。<br> <br> 录像分析和反饋：利用錄像分析技術，記錄學員的打擊動作，提供即時反饋和指導，以加速學習和進步。<br> <br> 力量訓練：包括擊球力量和速度的訓練，使用各種設備和技術來增強學員的擊球能力。<br> <br> 打擊動力鏈檢核班通過系統化的訓練和專業的指導，幫助學員提升打擊技巧和力量，從而在比賽中取得更好的表現。<br>', 999, '17.jpg', '2024-04-04 10:07:01', '2024-02-01 19:00:00', '2024-07-01 21:00:00', '打擊', '1', '8', '提供紮實優質的打擊訓練方式，並且運用科學化訓練工具，針對個人動作進行科學化的教學指導，加上MLB等級設備數據分析與解析，讓學員記憶正確運動姿勢、養成好的棒球技術及態度，進而提升個人專業球技。', 1),
(19, '投手養成訓練班', '投手養成訓練班是專為棒球或壘球投手而設計的培訓課程。<br> <br> 課程內容包括：<br>  基本投球動作：學習正確的投球動作，包括抓球姿勢、步法、擲球力量控制等基本技術。<br> <br> 不同球種投球：教授各種不同的球種，如快速球、曲球、變速球等，並進行實戰模擬和技術精進。<br> <br> 技巧改進：針對每位學員的個人特點和問題，提供專業的技術改進指導，幫助他們提升投球準確性和效果。<br> <br> 录像分析和反饋：利用錄像分析技術，記錄學員的投球動作，並提供即時的反饋和指導，以便調整和改進技術。<br> <br> 體能訓練：通過專業的體能訓練課程，提高學員的力量、耐力和爆發力，以支持長時間高強度的投球訓練。<br> <br> 戰術訓練：學習如何應對不同的比賽局勢和對手打者，制定有效的投球戰術和策略。<br> <br> 投手養成訓練班旨在通過系統化的訓練和專業的指導，幫助學員提升投球技術和戰術意識，成為出色的球隊投手。', 1500, '18.jpg', '2024-03-13 10:07:04', '2024-02-04 17:00:00', '2024-07-04 18:00:00', '投球', '2', '10', '提供紮實優質的投手訓練方式，教學課程中輔以國內外知名投手的優缺點案例分析，並且運用科學化訓練工具(高速攝影機與智慧棒球) ，針對個人動作進行科學化的教學指導，加上大數據分析與名師解析，讓學員記憶正確運動姿勢、養成好的棒球技術及態度，進而提升個人專業球技', 1),
(20, '守備技術班', '守備技術班是針對棒球或壘球運動員的專業培訓課程，旨在提升他們的守備技能和戰術意識。<br> <br> 課程內容包括：<br>  基本守備姿勢：教授正確的守備姿勢，包括站位平衡、手部位置、視線方向等基本技巧。<br> <br> 守備位置和角色：介紹不同守備位置的特點和要求，包括內野手、外野手、捕手等，並強調各個位置的角色和責任。<br> <br> 接球和擲球技術：學習如何準確地接球和擲球，包括地滾球、高飛球、遠距離擲球等各種守備動作。<br> <br> 守備範圍和節奏：培養學員對守備範圍和球路的掌握，並提高守備時的節奏感和反應速度。<br> <br> 守備戰術和協作：教授守備戰術和策略，包括對不同打者的應對策略、守備轉換和協作等技巧。<br> <br> 录像分析和反饋：利用錄像分析技術，記錄學員的守備動作，並提供即時的反饋和指導，以幫助他們改進技術和提高表現水平。<br> <br> 守備技術班旨在通過系統化的訓練和專業的指導，幫助學員提升守備技能和戰術意識，成為出色的守備球員，為球隊贏得比賽做出貢獻。', 1500, '19.jpg', '2024-02-20 10:07:07', '2024-02-03 14:00:00', '2024-06-03 15:00:00', '守備', '3', '5', '系統性學科背景知識底蘊建立+紮實優質的守備訓練方式，教學課程中輔以國內不同層級守備相關數據分析，並且運用科學化訓練工具(My Jump) ，針對下肢爆發力動作中最核心的跳躍測驗進行深入探討，配合頂尖選手實務經驗相互配合，讓學員記憶正確運動姿勢、養成好的棒球技術及態度，進而提升個人專業球技。', 1),
(21, '私人教練課(投手)', '私人教練課程是為個別學員量身打造的專業培訓方案，針對棒球或壘球的投手技術進行訓練。<br> <br> 課程內容包括：<br>  技術評估：進行學員的技術評估，分析其投球動作、力量和速度等方面，找出存在的問題和改進空間。<br> <br> 個性化訓練計劃：根據學員的技術水平和目標訂製個性化的訓練計劃，針對性地進行技術和體能訓練。<br> <br> 技術矯正：通過專業的指導和矯正，改善學員的投球動作，提高投球的準確性、速度和力量。<br> <br> 录像分析和即時反饋：利用錄像分析技術記錄學員的投球動作，並給予即時的反饋和指導，幫助學員更好地理解和改進技術。<br> <br> 體能和力量訓練：通過專業的體能訓練，提高學員的力量、耐力和爆發力，從而支持長時間高強度的投球訓練。<br> <br> 戰術訓練和策略制定：學習如何制定有效的投球戰術和策略，應對不同的比賽情況和對手打者。<br> <br> 私人教練課程將為投手提供一對一的專業指導和個性化訓練，幫助他們克服技術上的障礙，提升投球水平，並在比賽中取得更好的表現。', 1500, '20.jpg', '2024-03-12 10:07:11', '2024-03-13 10:01:53', '2024-06-13 10:03:08', '投球', '2', '4', '投手專項訓練<br> 60分鐘', 1),
(22, '私人教練課(野手)', ' 私人教練課程是針對個別學員的專業培訓方案，專注於棒球或壘球的野手技術。<br> <br> 課程內容包括：<br>  基本技術評估：評估學員的野手基本技術，包括接球、擲球、移動和站位等，並確定需要改進的項目。<br> <br> 個性化訓練計劃：根據學員的技術水平和目標訂製個性化的訓練計劃，針對性地進行技術和體能訓練。<br> <br> 技術矯正：提供專業的指導和矯正，幫助學員改進野手動作，提高接球準確性和擲球力量。<br> <br> 录像分析和即時反饋：利用錄像分析技術記錄學員的野手動作，並提供即時的反饋和指導，幫助學員更好地理解和改進技術。<br> <br> 守備範圍和節奏：培養學員對守備範圍和球路的掌握，並提高守備時的節奏感和反應速度。<br> <br> 戰術訓練和協作：學習如何制定有效的守備戰術和策略，以及如何與隊友協作，應對不同的比賽局勢和對手打者。<br> <br> 私人教練課程將提供野手個人化的專業指導和訓練，幫助他們提升守備技術，增強自信心，並在場上表現出色。', 1500, '21.jpg', '2024-03-13 10:07:13', '2024-03-12 10:01:50', '2024-06-06 10:03:04', '守備', '3', '3', '野手專項訓練<br> 60分鐘', 1),
(23, '守備技術班(N4)', '守備基本姿勢與動作<br>  學習正確的守備基本姿勢，包括站位、手部位置和身體平衡。<br> 掌握基本的守備動作，如接球、擲球和移動。<br> 守備位置與角色分配<br>  介紹不同守備位置的特點和角色，包括內野手、外野手和捕手。<br> 學習如何根據局勢和對手打者分配守備角色。<br> 接球技術訓練<br>  提高接球的準確性和穩定性。<br> 學習不同球路的接球技巧，包括地滾球、高飛球和遠距離擲球。<br> 擲球技術訓練<br>  增強擲球力量和精準度。<br> 學習如何快速、準確地將球傳遞到指定目標。<br> 守備範圍與區域覆蓋<br>  培養對守備範圍和球路的掌握。<br> 提高在守備區域內的覆蓋範圍和反應速度。<br> 守備戰術與協作<br>  學習制定有效的守備戰術和策略，應對不同的比賽局勢。<br> 加強與隊友的協作，提高整個守備陣容的效率和協調性。<br>', 1500, '22.jpg', '2024-01-05 10:07:16', '2024-02-03 14:00:00', '2024-06-19 15:00:00', '守備', '3', '5', '四點守備動作指導教學<br> 星期六1400~1500', 1),
(24, '打擊初速提升班', ' 打擊初速提升班是針對棒球或壘球運動員的培訓課程，旨在提高他們的打擊速度和力量，以增強在比賽中的表現。以下是課程的主要內容：<br> <br>  打擊動作分析：透過專業的教練指導和視頻分析，評估學員的打擊動作，找出不足之處並提供改進建議。<br> <br> 提高擊球速度：通過各種訓練方法，如使用打擊機、增加反應速度等，提高學員的擊球速度和反應能力。<br> <br> 增強打擊力量：訓練學員的上肢力量和核心穩定性，以增加打擊力量，讓他們能夠擊出更遠的球。<br> <br> 心理訓練：幫助學員建立自信心，克服比賽中的壓力，提高比賽中的表現水平。<br> <br> 實戰模擬：進行各種實戰模擬訓練，讓學員在真實比賽情境下練習，提高比賽中的應變能力和表現。<br> <br> 這個課程將為學員提供專業的打擊技術指導和全面的訓練計劃，幫助他們在打擊方面取得顯著進步。通過持續的訓練和努力，學員將能夠提高打擊速度和力量，成為更加出色的棒球或壘球運動員。', 3000, '23.jpg', '2024-03-20 10:07:18', '2024-04-16 10:01:56', '2024-06-06 10:02:50', '打擊', '1', '7', '穩定提升擊球初速<br> 星期一 1900~2100<br> 星期四 1900~2100', 1),
(29, '少棒守備技術班12', '少棒守備技術班旨在為年齡在12歲以下的棒球少年提供全面的守備技術培訓。以下是課程的主要內容：<br>\n<br>\n\n守備基本姿勢：教授學員正確的守備姿勢，包括站位、手部位置、視線等，建立穩定的守備基礎。<br>\n<br>\n接球技巧：訓練學員如何準確地接住地面球、高空球和遠場飛球，並學習如何應對快速球和不規則彈跳的球。<br>\n<br>\n傳球技巧：教導學員正確的傳球姿勢和技巧，包括準確度、力量和速度的掌握，以及各種守備位置的傳球方法。<br>\n<br>\n位移和反應訓練：訓練學員在守備時的快速移動和反應能力，包括預判球路、及時調整站位和移動方向等。<br>\n<br>\n實戰模擬：透過模擬比賽情境的訓練，讓學員在真實的比賽場景中應用所學技巧，提高比賽中的守備表現。<br>\n<br>\n這個班級將由專業的教練團隊指導，結合理論教學和實際訓練，幫助學員建立自信心、技術水準和比賽意識。通過持續的訓練和精心的指導，學員將能夠在守備方面取得顯著進步，成為球隊中的優秀守備員。', 2600, '19.jpg', '2024-02-01 13:50:07', '2024-01-21 13:00:00', '2024-02-06 15:00:00', '守備,體能', '', '9', '針對守備要領強化訓練<br> 基礎守備動作加強<br> 正、反手接球動作加強', 1),
(30, '少棒守備技術班15', '少棒守備技術班旨在為年齡在15歲以下的棒球少年提供全面的守備技術培訓。以下是課程的主要內容：<br>\n<br>\n\n守備基本姿勢：教授學員正確的守備姿勢，包括站位、手部位置、視線等，建立穩定的守備基礎。<br>\n<br>\n接球技巧：訓練學員如何準確地接住地面球、高空球和遠場飛球，並學習如何應對快速球和不規則彈跳的球。<br>\n<br>\n傳球技巧：教導學員正確的傳球姿勢和技巧，包括準確度、力量和速度的掌握，以及各種守備位置的傳球方法。<br>\n<br>\n位移和反應訓練：訓練學員在守備時的快速移動和反應能力，包括預判球路、及時調整站位和移動方向等。<br>\n<br>\n實戰模擬：透過模擬比賽情境的訓練，讓學員在真實的比賽場景中應用所學技巧，提高比賽中的守備表現。<br>\n<br>\n這個班級將由專業的教練團隊指導，結合理論教學和實際訓練，幫助學員建立自信心、技術水準和比賽意識。通過持續的訓練和精心的指導，學員將能夠在守備方面取得顯著進步，成為球隊中的優秀守備員。', 2700, '19.jpg', '2024-03-13 13:55:08', '2024-04-17 13:54:00', '2024-06-01 15:54:00', '守備,體能', '', '7', '針對守備要領強化訓練<br> 基礎守備動作加強<br> 正、反手接球動作加強', 1),
(31, '打擊動力練檢核班', '\n打擊動力練檢核班是為了幫助棒球或壘球運動員提升他們的打擊技術和力量而設計的培訓課程。以下是課程的主要內容：<br>\n<br>\n\n動力擊球基礎：學習正確的揮拍姿勢、握拍方式和站位，以建立穩固的動力擊球基礎。<br>\n<br>\n擊球力量訓練：通過各種訓練方法，包括重量訓練、彈跳訓練和核心訓練，提高擊球時的力量和爆發力。<br>\n<br>\n技術檢核：對學員的打擊動作進行詳細的檢核和分析，並提供改善建議，以確保打擊動作的正確性和效率。<br>\n<br>\n打擊反應速度訓練：透過快速反應訓練和模擬比賽情境的練習，提高學員在比賽中的打擊反應速度和準確性。<br>\n<br>\n录像分析和反饋：利用錄像分析技術記錄學員的打擊動作，並通過教練的反饋和指導來幫助他們改進技術和表現。<br>\n<br>\n這個班級由專業的教練團隊指導，結合理論教學和實際訓練，旨在幫助學員全面提升其打擊技術和能力。通過持續的訓練和個性化的指導，學員將能夠提高擊球力量和準確性，以在比賽中取得更出色的表現。', 999, '1706767085.jpg', '2024-02-01 13:58:05', '2024-05-31 13:57:00', '2024-06-01 16:57:00', '打擊,知識', '', '8', '六大檢核項目', 1),
(34, '專項技術提升', '『專項技術提升』課程是針對已具備棒球基礎技能的學員設計，旨在深化特定技術領域的專業知識和技能。此課程屬於專項技術提升類，重點包括進階打擊技巧、守備策略和專門的投球技術。課程旨在通過專業教練的指導和大量的實戰練習，幫助學員在棒球的特定技術領域達到新的高度。\r\n\r\n在進階打擊技巧部分，學員將學習如何根據不同投手的投球特點選擇最佳的打擊策略，以及如何調整站位和揮棒時機以提高擊球效率。守備策略部分，則著重於提升學員在不同守備位置的反應速度和準確性，同時教授如何根據比賽情況做出快速決策。對於有志於成為投手的學員，本課程將深入探討各種投球技巧，包括速球、變速球和曲球的控制與運用，並通過模擬比賽實踐所學技術。\r\n\r\n透過『專項技術提升』課程，學員將能夠在自己選擇的專項技術領域實現突破，為高級比賽和專業發展奠定堅實的基礎。', 2500, '1715327587.png', '2024-05-10 09:53:07', '2024-04-10 15:49:00', '2024-05-31 15:50:00', '打擊,投球,守備', '', '1', '進階打擊技巧<br>\n專業級投球技術<br>\n高級防守戰術<br>\n專業跑壘技巧與策略<br>\n數據分析應用於技術提升<br>\n視覺訓練與反應速度提升<br>\n比賽心理與壓力管理<br>\n個人化訓練計劃與持續發展<br>投球技巧精進：為有志於成為投手的學員量身定制，從握球方法到各種投球技巧（如直球、變速球、曲球等）的教學。強調控球能力和策略思考', 1),
(35, '基礎技能發展', '『棒球基礎入門』課程是為初學者設計的完整入門指南，旨在從零基礎開始，全面介紹棒球的基本規則、技巧和文化。本課程屬於基礎技能發展類，涵蓋了從握棒、站位、揮棒的正確方法到基本的投球和接球技巧，並透過實戰練習加深學員的理解和技能。\r\n\r\n課程首先介紹棒球的歷史和基本規則，讓學員對這項運動有一個全面的認識。接著，專業教練將指導學員學習正確的握棒和站位方式，以及如何有效地揮棒擊球。此外，課程還著重於投球和接球的基本技巧訓練，包括不同類型的投球技巧和守備時的位置佈局。\r\n\r\n通過理論學習和大量的實踐演練，學員將能夠掌握棒球的基礎技能，為進一步的技術提升和比賽參與打下堅實的基礎。課程結束時，學員不僅能夠熟練運用學到的技巧，也將對棒球這項運動有更深的熱愛和理解。', 8800, '1715327675.png', '2024-05-10 09:54:35', '2024-03-13 15:53:00', '2024-07-04 15:53:00', '打擊,投球', '', '7', '基礎揮棒技巧<br>\n投球基本原理<br>\n基礎防守位置與技巧<br>\n跑壘技巧與策略<br>\n球場規則與遊戲流程<br>\n裝備使用與維護<br>\n團隊合作與溝通<br>\n比賽預備與心理調整<br>進階打擊技巧：專為想提升打擊表現的學員設計，深入探討如何閱讀投手動作，選擇最佳打擊時機，以及實施進階打擊策略。課程包含大量實戰練習和個人指導。', 1),
(36, '基礎規則與裁判講解', '『規則與裁判』課程專為那些對棒球規則有深入興趣，以及希望成為棒球裁判的人士設計。此課程屬於規則與裁判類，旨在全面深化學員對棒球規則的理解，並提供專業的裁判技能訓練。通過本課程，學員將學習到棒球比賽中的各項規則細節，包括但不限於比賽進行規則、球員行為規範、比賽裝備要求等。\r\n\r\n課程內容從基礎規則開始，逐步過渡到複雜的判決情況分析，並通過實際案例研究，讓學員能夠在實戰中快速準確地做出裁決。除了理論學習，學員還將有機會參與模擬比賽，實踐裁判技能，如位置擺放、手勢使用和判決溝通技巧。\r\n\r\n本課程特別強調裁判的公正性和權威性，教授學員如何在比賽中保持冷靜，公正地處理比賽中出現的各種情況，包括如何有效地解決爭議和維持比賽秩序。完成本課程的學員將獲得深厚的棒球規則知識和實踐裁判技能，為從事棒球裁判工作或更深入地了解和欣賞棒球比賽奠定堅實的基礎。', 1200, '1715327778.png', '2024-05-10 09:56:18', '2024-04-03 15:55:00', '2024-06-28 15:55:00', '知識', '', '10', '棒球規則基礎<br>\n比賽進行的結構與階段<br>\n主要規則與罰則解析<br>\n裁判的角色與職責<br>\n裁判信號與手勢學習<br>\n實際案例分析<br>\n場地布局與裁判位置<br>\n比賽管理與公正執法<br>', 1),
(37, '體能與健康', '『體能與健康』課程專為棒球運動員設計，旨在透過全面的體能訓練和健康管理，提升運動表現並預防運動傷害。此課程屬於體能與健康類，強調平衡發展運動員的身體素質，包括力量、速度、耐力、靈活性和協調性。\r\n\r\n課程內容涵蓋了有氧和無氧運動訓練、力量訓練、靈活性和伸展運動、以及專門針對棒球運動特點的體能訓練。透過科學的訓練方法和個性化的訓練計畫，幫助運動員提升體能表現，同時增強身體的抗傷害能力。\r\n\r\n除了體能訓練，本課程還特別關注運動員的飲食營養和心理健康。專業營養師將根據運動員的訓練強度和比賽需求，提供個性化的飲食建議和營養計畫，確保運動員能夠攝取足夠的營養，支持高強度的訓練和恢復。心理輔導部分，則旨在幫助運動員建立正確的運動心態，學會管理比賽壓力，提升心理韌性。\r\n\r\n『體能與健康』課程通過全方位的體能和健康管理，不僅能夠幫助運動員在場上發揮更好的表現，也能夠提高運動員的生活質量，確保他們能夠長期健康地從事棒球運動。完成本課程的運動員將在體能、營養、心理等多方面獲得顯著提升，為達成更高運動成就奠定堅實的基礎。', 4300, '1715328019.png', '2024-05-10 10:00:19', '2024-04-11 15:57:00', '2024-05-24 15:57:00', '體能', '', '8', '體能評估與個人化訓練計劃<br>\n全面的力量訓練<br>\n心肺耐力提升<br>\n柔韌性和平衡訓練<br>\n核心肌群強化<br>\n運動恢復技巧與策略<br>\n營養指導與健康飲食計劃<br>\n心理健康與壓力管理<br>', 1),
(38, '女子棒球技巧提升', '『女子棒球技巧提升』課程專門針對女性棒球運動員設計，旨在提供一個支持性和鼓勵性的學習環境，幫助女性球員在棒球領域實現技術上的突破。此課程屬於特殊群體訓練類，著重於打擊、守備和投球等核心技術的提升，同時考慮到女性運動員的特殊需求，進行針對性的訓練方法和體能鍛煉。\r\n\r\n課程從基礎技能的鞏固開始，逐步引導學員掌握更高階的技術動作，如進階打擊技巧、精準投球和靈活守備策略。專業教練將通過個別指導和團體訓練，幫助學員提升技術水平，並在實戰中應用所學技巧。\r\n\r\n此外，課程還特別強調心理素質的培養和團隊合作能力的提升。透過模擬比賽和心理輔導，學員將學會如何在比賽壓力下保持冷靜，如何與隊友有效溝通和協作，從而在比賽中發揮最佳狀態。\r\n\r\n『女子棒球技巧提升』課程不僅關注技術的提升，也致力於打造一個互相學習、相互支持的社群，讓女性球員在棒球這項運動中找到歸屬感和自信。完成本課程的學員將能夠在技術、體能和心理素質上都有顯著提升，為參與更高級別的比賽和挑戰做好準備。\r\n\r\n', 7200, '1715328241.png', '2024-05-10 10:04:01', '2024-04-11 16:02:00', '2024-06-28 16:02:00', '打擊,投球', '', '12', '基礎技能回顧與強化<br>\n專屬女性的力量與體能訓練<br>\n打擊技術和策略<br>\n防守技巧與位置訓練<br>\n投球技巧與控球訓練<br>\n比賽心理準備與壓力管理<br>\n團隊合作與溝通<br>\n比賽分析與自我評估<br>', 1),
(39, '專業球員體能管理', '體能調節\r\n高強度間歇訓練(HIIT)：提升心肺功能和耐力。\r\n力量與爆發力訓練：增強肌肉力量，提升打擊和投球的爆發力。\r\n靈活性和伸展運動：提高身體靈活性，預防運動傷害。\r\n恢復策略：包括冷療、熱療、按摩和肌肉放鬆等，加速運動後恢復。\r\n營養管理\r\n個性化飲食計劃：根據運動員的體能訓練強度和比賽需求，提供個性化的飲食建議。\r\n營養補充：指導運動員合理使用營養補充品，如蛋白粉、維生素等，以支持訓練和恢復。\r\n水分管理：教授運動員正確的水分補充時機和量，以保持最佳的身體狀態。\r\n心理調適\r\n心理韌性訓練：提升面對比賽壓力和挑戰的心理韌性。\r\n目標設定和自我激勵：幫助運動員設定實際目標，並透過正向心態保持動力。\r\n焦慮管理：教授運動員應對比賽前焦慮的策略，如深呼吸、正念冥想等。\r\n本課程結合了專業教練的實戰經驗和最新科學研究，旨在為專業球員提供一個全方位的體能管理計畫，幫助他們在高強度的比賽和訓練中保持最佳狀態，並有效預防傷害，從而達到職業生涯的巔峰。', 9000, '1715329682.png', '2024-05-10 10:28:02', '2024-03-07 16:25:00', '2024-07-11 16:25:00', '體能,知識', '', '12', '基礎體能評估<br>\n核心肌群強化<br>\n耐力與心肺訓練<br>\n柔韌性和伸展運動<br>\n爆發力訓練<br>\n恢復技術與策略<br>\n營養與飲食指導<br>\n心理素質與壓力管理<br>', 1),
(40, '高階打擊技巧班', '「高階打擊技巧班」專為有經驗的棒球選手設計，旨在提升打擊能力到專業水平。本課程深入探討先進的打擊技術，包括力量生成、擊球角度調整和打擊時機的精確把握。學員將學習如何根據不同投球類型和速度作出快速反應，並通過專業設備和高科技分析工具，實時反饋打擊效果，從而精準改善打擊姿態和技巧。\r\n\r\n此外，課程還包括心理訓練模塊，幫助選手在比賽壓力下保持冷靜，提高集中力和自信心。經過本課程的訓練，選手將能夠在比賽中更好地控制比賽節奏，有效提升打擊表現和團隊貢獻。這是一個全面提升打擊技能的絕佳機會，適合那些追求棒球高峰的選手。', 4580, '1715651239.png', '2024-05-14 03:47:19', '2024-04-09 09:45:00', '2024-06-20 09:45:00', '打擊', '', '13', '進階打擊技術<br>\n力量訓練<br>\n心理專注訓練<br>\n打擊策略與分析<br>\n視覺與反應速度訓練<br>\n對抗不同球種的打擊練習<br>\n比賽中的應用與調整<br>\n個人化打擊改善計劃<br>', 1),
(41, '投手專業訓練', '課程專為那些希望精進投球技能的棒球選手設計。這個課程涵蓋了從基本的投球機制到進階的球種掌握技巧，目的是提升選手的投球質量和效率。學員將接受全面的體能評估，包括肩膀、手臂和整體身體的力量與靈活性訓練，以確保投球時的最大力量和最小傷害。\r\n\r\n課程中，專業教練將指導如何掌控球速、改善控球能力和學習各種球種，如快速球、變速球和曲球等。此外，我們還提供高科技設備支持，例如高速攝影機和動作捕捉技術，以分析和改進投手的動作。\r\n\r\n除了技術和體能訓練外，「投手專業訓練」還強調心理和戰略訓練，教導選手如何在比賽中讀懂打者的意圖，控制比賽節奏，並在壓力下保持冷靜和集中。通過這個課程，投手將能夠提升自己在比賽中的表現，並為高水平的競爭做好準備。', 8540, '1715651713.jpeg', '2024-05-14 03:55:13', '2024-03-12 09:52:00', '2024-06-12 09:52:00', '投球', '', '8', '投球基礎與機制<br>\r\n體能與力量訓練<br>\r\n球種學習與掌握<br>\r\n控球與準確性訓練<br>\r\n比賽策略與心理準備<br>\r\n技術分析與反饋<br>\r\n健康管理與傷害預防<br>\r\n實戰模擬與比賽應用<br>', 1),
(42, '捕手工作坊', '捕手工作坊是一個專門為棒球捕手設計的全面訓練課程，旨在提升捕手在比賽中的核心技能和戰術理解。本工作坊涵蓋從基礎接球姿勢、精準傳球到比賽策略的各個方面。學員將學習如何有效地阻擋失誤球，提升傳球速度與準確性，並學會如何引導投手，控制比賽節奏。此外，課程還將教授捕手如何在高壓比賽中保持冷靜，以及如何選擇和維護個人裝備。通過實戰演練和專業教練的指導，學員將大幅提升自己作為捕手的比賽表現和戰術價值。', 11990, '1715652717.png', '2024-05-14 04:11:57', '2024-04-09 10:05:00', '2024-06-25 10:05:00', '守備', '', '16', '捕手基礎姿勢與技巧<br>\r\n接球技術與準確性提升<br>\r\n阻擋失誤球技巧<br>\r\n引導投手與比賽策略<br>\r\n傳球技巧與快速出手<br>\r\n防守布局與球員協調<br>\r\n比賽中的心理準備與應對<br>\r\n捕手裝備的選擇與維護<br>', 1),
(43, '棒球冬季訓練營 ', '棒球冬季訓練營為期數週，旨在全面提升選手的棒球技能和體能。本訓練營透過專業的體能評估，為每位選手設計個人化的訓練計劃，涵蓋打擊、投球、防守等各方面技能。除了技術與體能訓練，訓練營還特別強調心理素質的培養和營養恢復的重要性，幫助選手在冬季期間維持最佳狀態，為春季賽季做好準備。專業教練團隊將引導選手透過實戰模擬，將所學技術應用於比賽中，確保技能提升能夠轉化為實際比賽的表現。', 13999, '1715654790.jpeg', '2024-05-14 04:46:30', '2024-04-10 10:46:00', '2024-08-23 10:46:00', '打擊,投球,守備', '', '8', '全面體能評估與訓練<br>\r\n專業打擊技術提升<br>\r\n投球技巧與力量訓練<br>\r\n防守戰術與團隊合作<br>\r\n心理素質強化與比賽準備<br>\r\n營養指導與恢復策略<br>\r\n個人化訓練計劃與進度追蹤<br>\r\n實戰模擬與技術應用<br>\r\n', 1),
(44, '棒球營養與健康管理課程大綱', '棒球營養與健康管理課程專為追求卓越表現的棒球選手設計。本課程深入探討運動員的營養需求，教導如何透過合理飲食來提升體能表現和加速恢復。學習重點包括賽前後的營養策略、有效的水分補充方法、傷害預防與恢復的營養支持，以及如何管理體重和體脂比例，保持最佳競技狀態。此外，課程還將介紹適合運動員的補充品選擇，並探討心理健康與飲食之間的關聯，幫助選手在比賽和日常訓練中保持身心健康。', 7777, '1715655258.jpeg', '2024-05-14 04:51:25', '2024-04-24 10:48:00', '2024-05-31 10:48:00', '體能,知識', '', '1', '營養基礎知識<br>\r\n運動員營養需求<br>\r\n賽前與賽後營養策略<br>\r\n水分補充與電解質平衡<br>\r\n傷害預防與恢復營養<br>\r\n體重管理與體脂控制<br>\r\n補充品與天然食物選擇<br>\r\n心理健康與飲食關係<br>', 1),
(45, '棒球體能訓練', '棒球體能訓練工作坊專為那些渴望提升在場上表現的棒球選手而設計。本課程著重於增強選手的力量、爆發力、耐力、靈活性和敏捷性，透過專門針對棒球運動的體能訓練，幫助選手提高運動表現。除了體能訓練，我們還提供恢復策略、營養指導和心理素質訓練，以確保選手能夠在比賽中保持最佳狀態。透過本課程，選手將學會如何有效地利用自己的身體潛力，並將這些技能轉化為場上的優勢。', 9999, '1715655805.jpeg', '2024-05-14 05:03:25', '2024-04-30 11:02:00', '2024-06-06 11:02:00', '體能', '', '1', '全面體能評估<br>\r\n力量與爆發力訓練<br>\r\n耐力與心肺功能提升<br>\r\n靈活性與敏捷性練習<br>\r\n專門的棒球動作訓練<br>\r\n恢復策略與傷害預防<br>\r\n營養指導與體能管理<br>\r\n心理素質訓練與比賽準備<br>', 1),
(46, '棒球數據分析與運用', '\r\n棒球數據分析課程旨在教授學員如何運用數據分析技術來解析棒球比賽和球員表現。課程涵蓋數據收集、清理、分析和應用等方面。學員將通過理論學習和實踐案例，掌握數據分析工具和技術，並了解棒球數據背後的故事。本課程將啟發學員對數據的深入理解，並培養他們的數據分析能力，以應對現代棒球競爭的挑戰。', 2500, '1715666421.jpeg', '2024-05-14 08:00:21', '2024-03-13 13:55:00', '2024-06-27 13:55:00', '知識', '', '18', '1. 數據分析概述<br>\r\n2. 數據收集和處理技術<br>\r\n3. 棒球數據分析工具<br>\r\n4. 進階數據分析技術<br>\r\n5. 棒球數據分析案例研究<br>\r\n6. 未來趨勢與發展方向<br>\r\n7. 棒球數據分析應用工作坊<br>', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `favorite`
--

CREATE TABLE `favorite` (
  `id` int(5) NOT NULL,
  `user_id` int(5) NOT NULL,
  `product_id` int(5) NOT NULL,
  `class_id` varchar(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `favorite`
--

INSERT INTO `favorite` (`id`, `user_id`, `product_id`, `class_id`) VALUES
(1, 1, 2, 'P'),
(2, 1, 3, 'P'),
(3, 1, 1, 'C'),
(4, 1, 3, 'C'),
(5, 70, 2, 'R'),
(6, 70, 3, 'P'),
(7, 70, 7, 'R'),
(9, 70, 18, 'P'),
(10, 70, 14, 'R'),
(11, 70, 79, 'R'),
(12, 70, 75, 'R'),
(13, 70, 66, 'P'),
(14, 70, 63, 'R'),
(15, 70, 118, 'R'),
(16, 70, 119, 'R'),
(17, 70, 117, 'P'),
(18, 70, 114, 'P'),
(19, 70, 111, 'R'),
(20, 70, 102, 'P'),
(21, 70, 122, 'P'),
(22, 70, 126, 'R'),
(23, 70, 127, 'P'),
(24, 70, 32, 'C'),
(25, 70, 15, 'C'),
(26, 70, 13, 'C'),
(27, 77, 6, 'C'),
(28, 70, 7, 'C'),
(29, 78, 2, 'P'),
(30, 78, 6, 'P'),
(31, 78, 11, 'R'),
(32, 70, 15, 'R'),
(33, 78, 17, 'P'),
(34, 78, 20, 'P'),
(35, 70, 58, 'R'),
(36, 78, 50, 'P'),
(37, 70, 51, 'P'),
(38, 70, 42, 'R'),
(39, 70, 44, 'R'),
(40, 70, 59, 'R'),
(41, 78, 98, 'P'),
(42, 78, 100, 'R'),
(43, 78, 95, 'P'),
(44, 78, 90, 'R'),
(45, 78, 86, 'R'),
(46, 78, 87, 'P'),
(47, 77, 82, 'R'),
(48, 78, 84, 'P'),
(49, 78, 130, 'P'),
(50, 78, 126, 'R'),
(51, 78, 122, 'P'),
(52, 78, 2, 'C'),
(53, 78, 4, 'C'),
(54, 70, 6, 'C'),
(55, 78, 11, 'C'),
(57, 78, 19, 'C'),
(58, 70, 17, 'C'),
(59, 78, 28, 'C'),
(60, 78, 25, 'C'),
(61, 78, 33, 'C'),
(62, 59, 1, 'C'),
(63, 59, 14, 'R'),
(64, 70, 2, 'P'),
(68, 70, 2, 'C'),
(69, 70, 3, 'C'),
(71, 70, 1, 'P'),
(72, 70, 24, 'P'),
(73, 70, 6, 'R');

-- --------------------------------------------------------

--
-- 資料表結構 `join_team`
--

CREATE TABLE `join_team` (
  `id` int(5) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL,
  `total_member` int(4) NOT NULL,
  `activity_date` datetime NOT NULL,
  `deadline_date` datetime NOT NULL,
  `city_name` varchar(10) NOT NULL,
  `district_name` varchar(10) NOT NULL,
  `place_name` varchar(50) NOT NULL,
  `description` varchar(5000) NOT NULL,
  `image` varchar(100) NOT NULL,
  `created_at` datetime NOT NULL,
  `valid` tinyint(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `join_team`
--

INSERT INTO `join_team` (`id`, `name`, `total_member`, `activity_date`, `deadline_date`, `city_name`, `district_name`, `place_name`, `description`, `image`, `created_at`, `valid`) VALUES
(1, '台北假日投接球練習', 2, '2024-06-02 17:00:00', '2024-06-01 17:00:00', '臺北市', '萬華區', '萬華區雙園河濱公園', '北漂上來工作，大部分的球友都在南部，想找位可以一起練習投接球的人!\n有興趣的話也可以再約其他天', 'joinDefaultImg.jpg', '2024-05-16 15:45:48', 1),
(2, '來一起玩五人制棒球 ! ', 5, '2024-05-24 13:00:00', '2024-05-23 13:00:00', '臺北市', '士林區', '臺北市天母棒球場', '歡迎大家來參加 ~ 沒有捕手也不需要球棒 (球是用手掌或拳頭擊出) ，簡單好上手。主揪這邊也有提供專門的球具', '1715845992155_join.jpg', '2024-05-16 15:53:13', 1),
(3, '新手壘球團，輕鬆打快樂玩', 9, '2024-05-26 10:00:00', '2024-05-25 10:00:00', '臺北市', '中山區', '臺北市中山區迎風河濱運動公園', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715846390791_join.jpeg', '2024-05-16 15:59:52', 1),
(4, '信義區棒壘球打擊練習', 4, '2024-05-30 08:30:00', '2024-05-29 08:30:00', '臺北市', '信義區', '臺北醫學大學田徑場', '單純打擊練習 ! 已借到場地，球棒基本上自備，但如果有想嘗試看看的朋友，這邊也有多一支球棒可借，詳細可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715847846864_join.jpeg', '2024-05-16 16:24:08', 1),
(5, '新北的朋友看過來 !', 9, '2024-05-25 15:00:00', '2024-05-24 15:00:00', '新北市', '板橋區', '新北市板橋區大漢橋北面棒球場(大漢溪右岸自行車道1.95KM處)', '想要找幾個人一起打棒球，新手老手都歡迎~ 身為老玩家，這邊也可以提供一些手套、球、球棒，初次接觸棒球的人也可以借來使用，大家一起體驗一起玩 !', '1715848284271_join.jpg', '2024-05-16 16:32:22', 1),
(6, '瑞芳棒球團', 18, '2024-05-28 10:00:00', '2024-05-27 10:00:00', '新北市', '瑞芳區', '瑞芳棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', 'joinDefaultImg.jpg', '2024-05-16 16:35:49', 1),
(7, '揪團揪起來 - 基隆團', 5, '2024-05-25 10:30:00', '2024-05-24 10:30:00', '基隆市', '', '基隆市立棒球場', '無論是初學者還是資深玩家，都歡迎加入 ! 一起打打球活動筋骨，投接球或是打擊練習都 OK ! 人數夠多的話也能打場簡易比賽 ~ \n', '1715857492322_join.jpeg', '2024-05-16 19:04:53', 1),
(8, '有基隆暖暖的夥伴要一起打球嗎', 5, '2024-05-23 11:30:00', '2024-05-22 11:30:00', '基隆市', '暖暖區', '基隆市暖暖運動公園', '周圍都沒有認識喜歡打壘球的同好QQ 所以來揪揪看有沒有剛好在暖暖區附近的，假日方便的話能就近約一下，之後也還能再約 !  Line 有創匿名社群，有興趣的話也可以一起討論棒壘球相關 : https://line.me/ti/g2/TuvCleo852dswER?utM_source=invitation&utm=default', '1715860622059_join.jpeg', '2024-05-16 19:57:02', 1),
(9, '永和場次開團了 !  一起來玩 !', 10, '2024-05-22 20:00:00', '2024-05-21 20:00:00', '新北市', '永和區', '新北市永和區綠寶石公園棒球場(新店溪左岸自行車道5.9KM)', '想找志同道合的夥伴一起組團打壘球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是能和大家輕鬆打個棒球~ 不需要太拘束 !\n如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715861604659_join.jpg', '2024-05-16 20:14:56', 1),
(10, '板橋人一起來揪打 ~', 8, '2024-05-31 19:00:00', '2024-05-30 19:00:00', '新北市', '板橋區', '浮洲橋棒球場', '本身對棒壘球有極大熱忱，假日也都會定期參與學校球隊練習，21日想另約就近一起打球，如果之後有興趣可以再約。Line 匿名社群，有興趣的話也可以一起討論棒壘球相關 : https://line.me/ti/g2/TuvCleo852dswER?utM_source=invitation&utm=default', '1715862307439_join.jpg', '2024-05-16 20:25:08', 1),
(11, '想找一位朋友輕鬆練個壘球打擊', 2, '2024-05-19 11:00:00', '2024-05-18 11:00:00', '宜蘭縣', '', '三星鄉綜合運動場', '週日剛好有時間，太久沒有練習覺得手感有點生疏，想找個朋友來互相練打。大部分的週日都有時間，歡迎喜歡棒球的朋友一起定期來約。', '1715863492534_join.webp', '2024-05-16 20:44:55', 1),
(12, '台北新手歡樂團', 6, '2024-05-23 12:50:00', '2024-05-22 12:50:00', '臺北市', '', '青年公園棒球場', '剛踏入壘球這個坑，剛好有機會就來揪揪看，快樂輕鬆打就好~ 除了一般傳接球，也可以練練打擊，歡迎一起來打球!', '1715878381615_join.jpeg', '2024-05-17 00:53:10', 1),
(13, '公園棒球揪起來', 5, '2024-05-26 08:30:00', '2024-05-25 08:30:00', '臺北市', '中正區', '中正河濱公園', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715847846864_join.jpeg', '2024-05-17 02:26:27', 1),
(14, '新竹女子壘球', 2, '2024-05-23 11:00:00', '2024-05-22 11:00:00', '新竹縣', '竹北市', '頭前溪隆恩堰段高灘地右岸河濱休閒場地(簡易壘球場)', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', 'joinDefaultImg.jpg', '2024-05-17 02:27:18', 1),
(15, '短期揪個壘球團，練習一下', 2, '2024-05-28 11:00:00', '2024-05-27 11:00:00', '新竹縣', '', '竹東河濱公園棒壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715846390791_join.jpeg', '2024-05-17 02:28:12', 1),
(16, '有沒有苗栗的朋友想打棒球', 2, '2024-05-27 14:30:00', '2024-05-26 14:30:00', '苗栗縣', '', '聯合大學第二(八甲)校區壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', 'joinDefaultImg.jpg', '2024-05-17 02:28:35', 1),
(17, '平日晚上練球團', 2, '2024-05-22 20:00:00', '2024-05-21 20:00:00', '新北市', '', '中和區錦和運動公園-壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884171001_join.webp', '2024-05-17 02:29:32', 1),
(18, '大學生棒球團', 2, '2024-05-31 14:30:00', '2024-05-30 14:30:00', '桃園市', '', '體育大學棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884224693_join.jpg', '2024-05-17 02:30:25', 1),
(19, '楊梅打球好地方', 2, '2024-06-04 16:30:00', '2024-06-03 16:30:00', '桃園市', '', '桃園市楊梅區棒壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884282235_join.jpeg', '2024-05-17 02:31:22', 1),
(20, '開心打球美好時光', 2, '2024-05-28 14:30:00', '2024-05-27 14:30:00', '桃園市', '', '楊梅區富岡運動公園', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884348105_join.jpeg', '2024-05-17 02:32:28', 1),
(21, '休閒放鬆打打球', 2, '2024-06-10 13:30:00', '2024-06-09 13:30:00', '桃園市', '', '桃園市立平鎮棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715884415780_join.jpeg', '2024-05-17 02:33:36', 1),
(22, '想長期組團練習，以縣市比賽為目標', 9, '2024-05-25 11:00:00', '2024-05-24 11:00:00', '高雄市', '', '中山大學棒球場', '邀請有興趣參加比賽的棒球同好一起練習 ! 之後也會再約定期的時間組團來打(以假日為主)', '1715886686821_join.jpeg', '2024-05-17 03:11:31', 1),
(23, '已借到學校場地的打擊練習場 ~', 4, '2024-06-15 13:00:00', '2024-06-14 13:00:00', '臺北市', '', '東園國小棒球打擊場', '比起自己一個人練習，想多找幾位有興趣的夥伴組團練打擊，曾經也是場地學校的校友，也有加入棒球隊，歡迎一起加入 ! 互相交流分享棒球 ~ ', '1715847846864_join.jpeg', '2024-05-18 03:04:32', 1),
(24, '天母團++ 棒球組團還缺2人', 3, '2024-05-22 15:00:00', '2024-05-21 15:00:00', '臺北市', '', '臺北市天母棒球場', '原本已經有約好團了，但其中兩位球友臨時有事，所以來平台找找看有沒有想組團一起練習的人，目前還缺兩位，地點在天母棒球場', '1715848284271_join.jpg', '2024-05-18 03:09:57', 1),
(25, '歡迎 ! 快來加入我們 ! ', 6, '2024-05-22 18:30:00', '2024-05-21 18:30:00', '臺北市', '', '士商壘球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715973604050_join.jpg', '2024-05-18 03:20:16', 1),
(26, '台北的壘球同好來揪一下 ~', 4, '2024-05-23 16:00:00', '2024-05-22 16:00:00', '臺北市', '', '中正河濱公園', '可以一起組團參加比賽 ! 團內已有7位隊員，需要再找3位成團~ 目前28號這場暫定在中正河濱公園，往後的練習可能會再改地方，如果有想再細部了解，也可以加我的Line聯絡 (ID搜尋 baseball2024) ', '1715974136728_join.jpg', '2024-05-18 03:28:57', 1),
(27, '士林球友聚，下午來練一下打擊', 6, '2024-05-18 14:30:00', '2024-05-17 14:30:00', '臺北市', '', '士林區百齡河濱公園', '中午剛好士林這邊的棒球同好會有舉辦研習，研習結束後想要約個一群來去百齡河濱公園那邊練打擊，球棒和球我這邊可以準備，如果自己本身有習慣的球棒也可自備，手套的話因為慣用手是右手，如果是使用左手手套的同好可能也需自備。', '1715975211405_join.jpg', '2024-05-18 03:51:52', 1),
(28, '新北週五晚上練習團', 2, '2024-05-24 17:00:00', '2024-05-23 17:00:00', '新北市', '', '新北市新莊區17號越堤道圓環南面棒球場(大漢溪左岸自行車道6.5KM處)', '投接球練習，年齡與性別不拘，只要對棒球有興趣都歡迎加入 ! 之後也還能再約，時間上的話盡量以周五下午以後', '1715976141752_join.jpg', '2024-05-18 04:02:22', 1),
(29, '校友棒球隊約起來 ! 9月校友盃要開打', 9, '2024-06-08 08:00:00', '2024-06-07 08:00:00', '臺北市', '', '臺北市立建國高級中學棒球場', '9月中剛好有場校友盃，想看能不能湊成一隊參加，6/8 當天先集合一起練習，後續練習日期會盡量以週六上午為主，詳細活動辦法和報名相關連結 : https://baseball.com.tw ，或是可以加入discord群組 : https://discord.com/invite/QWER12', '1715977231482_join.jpg', '2024-05-18 04:20:32', 1),
(30, '台北 - 徵1位球友一起練習', 2, '2024-06-02 15:30:00', '2024-06-01 15:30:00', '臺北市', '', '大理高中棒壘球打擊練習場', '單純打擊練習 ! 已借到場地，球棒基本上自備，但如果有想嘗試看看的朋友，這邊也有舊球棒可借，可加 Line聯繫 : qwe123 (搜尋ID)', '1715977453787_join.jpg', '2024-05-18 04:24:31', 1),
(31, '桃園輕鬆揪團打(國際棒球場)', 7, '2024-05-22 18:30:00', '2024-05-21 18:30:00', '桃園市', '', '桃園國際棒球場', '想找志同道合的夥伴一起組團打球 ! 因本身還是新手，對於比賽制度還沒有很熟悉，主要目的是想和大家快樂輕鬆打球~ 不需要太拘束 ! 如果有興趣一起打球也可以加Discord群組討論 - https://discord.com/invite/QWER12', '1715978045986_join.jpg', '2024-05-18 04:34:06', 1),
(32, '桃園龜山非正式比賽揪團', 5, '2024-05-24 08:30:00', '2024-05-23 08:30:00', '桃園市', '', '龜山鄉棒球場', '輕鬆打 ! 無論是初學者還是資深玩家，都歡迎加入 ! 一起打打球活動筋骨~', 'joinDefaultImg.jpg', '2024-05-18 04:43:10', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `join_team_user`
--

CREATE TABLE `join_team_user` (
  `id` int(4) UNSIGNED NOT NULL,
  `join_team_id` int(4) UNSIGNED NOT NULL,
  `user_id` int(4) UNSIGNED NOT NULL,
  `is_host` tinyint(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `join_team_user`
--

INSERT INTO `join_team_user` (`id`, `join_team_id`, `user_id`, `is_host`) VALUES
(1, 1, 70, 1),
(2, 2, 3, 1),
(3, 3, 21, 1),
(4, 4, 4, 1),
(5, 5, 10, 1),
(6, 6, 55, 1),
(7, 6, 12, 0),
(8, 6, 14, 0),
(9, 6, 25, 0),
(10, 6, 30, 0),
(11, 6, 8, 0),
(12, 6, 61, 0),
(13, 6, 1, 0),
(14, 6, 50, 0),
(15, 6, 9, 0),
(16, 6, 23, 0),
(17, 6, 11, 0),
(18, 6, 44, 0),
(19, 6, 33, 0),
(20, 6, 51, 0),
(21, 6, 52, 0),
(22, 6, 53, 0),
(23, 6, 70, 0),
(25, 7, 13, 1),
(27, 8, 14, 1),
(29, 9, 31, 1),
(30, 10, 32, 1),
(31, 11, 35, 1),
(32, 12, 37, 1),
(33, 13, 39, 1),
(34, 14, 41, 1),
(35, 15, 1, 1),
(36, 16, 46, 1),
(37, 17, 32, 1),
(38, 18, 42, 1),
(39, 19, 57, 1),
(40, 20, 5, 1),
(41, 21, 24, 1),
(42, 2, 29, 0),
(43, 1, 27, 0),
(44, 2, 30, 0),
(45, 2, 17, 0),
(46, 3, 2, 0),
(47, 3, 19, 0),
(48, 3, 40, 0),
(49, 3, 38, 0),
(50, 4, 17, 0),
(51, 5, 23, 0),
(52, 5, 27, 0),
(53, 9, 26, 0),
(54, 7, 53, 0),
(55, 7, 54, 0),
(56, 7, 55, 0),
(57, 11, 37, 0),
(59, 10, 70, 0),
(60, 5, 70, 0),
(62, 22, 43, 1),
(63, 13, 69, 0),
(64, 23, 33, 1),
(65, 24, 26, 1),
(66, 25, 22, 1),
(67, 26, 18, 1),
(68, 27, 12, 1),
(69, 28, 10, 1),
(70, 29, 7, 1),
(71, 30, 1, 1),
(72, 31, 70, 1),
(73, 32, 70, 1),
(74, 32, 6, 0),
(75, 32, 7, 0),
(76, 32, 8, 0),
(77, 31, 16, 0),
(78, 31, 17, 0),
(79, 31, 18, 0),
(80, 31, 19, 0),
(81, 31, 20, 0),
(82, 30, 24, 0),
(83, 29, 26, 0),
(84, 29, 27, 0),
(85, 29, 28, 0),
(86, 29, 30, 0),
(87, 29, 31, 0),
(88, 27, 37, 0),
(89, 27, 38, 0),
(90, 27, 40, 0),
(91, 24, 46, 0),
(92, 24, 45, 0),
(93, 19, 81, 0),
(94, 26, 81, 0),
(95, 25, 41, 0),
(96, 25, 28, 0),
(97, 25, 30, 0),
(98, 25, 32, 0),
(99, 22, 34, 0),
(100, 22, 36, 0),
(101, 22, 38, 0),
(102, 23, 1, 0),
(103, 23, 11, 0),
(106, 10, 37, 0),
(107, 10, 40, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `order`
--

CREATE TABLE `order` (
  `id` int(5) NOT NULL,
  `user_id` int(5) NOT NULL,
  `coding` varchar(200) NOT NULL,
  `order_time` datetime NOT NULL,
  `status` varchar(255) NOT NULL,
  `type` varchar(255) NOT NULL,
  `name` varchar(200) NOT NULL,
  `phone` varchar(200) NOT NULL,
  `address` varchar(255) NOT NULL,
  `note` varchar(200) NOT NULL,
  `payment` varchar(255) NOT NULL,
  `delivery` varchar(200) NOT NULL,
  `total_price` varchar(255) NOT NULL,
  `coupon_code` varchar(255) DEFAULT NULL,
  `discount_price` varchar(255) DEFAULT NULL,
  `final_price` varchar(200) NOT NULL,
  `all_amount` varchar(255) NOT NULL,
  `reservation` varchar(255) NOT NULL,
  `transaction_id` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `order`
--

INSERT INTO `order` (`id`, `user_id`, `coding`, `order_time`, `status`, `type`, `name`, `phone`, `address`, `note`, `payment`, `delivery`, `total_price`, `coupon_code`, `discount_price`, `final_price`, `all_amount`, `reservation`, `transaction_id`) VALUES
(1, 70, 'GgJu7lL5Nf', '2024-05-01 22:52:25', '待付款', '課程', 'TzuYu', '0912345678', '台北市大安區大林路1號', '', '貨到付款', '宅配', '2000', 'XRH6JYLKQ1', '10', '1990', '20', '', ''),
(2, 70, 'rdys9fCvpi', '2024-05-03 22:53:59', '已付款', '課程', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請在月底寄出', 'LinePay', '宅配', '1400', 'Q1K62YN26S', '140', '1260', '7', '0000', '2024051702121068010'),
(3, 70, 'eyuNdcjMcA', '2024-05-04 22:55:07', '已付款', '課程', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請附上小卡', '信用卡', '門市自取', '3000', 'RFHUUKVXU3', '100', '2900', '3', '', ''),
(4, 70, '9yzBCa66Tk', '2024-05-06 22:56:12', '待付款', '課程', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請附上小卡', '貨到付款', '門市自取', '500', 'PRUXGMABKE', '10', '490', '5', '', ''),
(5, 70, 'tGMRc7E87J', '2024-05-09 22:58:58', '待付款', '商品', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請在月底寄出', '貨到付款', '門市自取', '9920', '48K1F7FAHN', '3968', '5952', '5', '', ''),
(6, 70, 'Oioct0ZmjS', '2024-05-10 23:01:00', '已付款', '商品', 'TzuYu', '0912345678', '台北市大安區大林路1號', '', 'LinePay', '門市自取', '7296', '7EYM3BSNQ3', '2918', '4378', '4', '0000', '2024051802121071710'),
(7, 70, 'sh2Fgya1xa', '2024-05-12 23:02:58', '已付款', '商品', 'TzuYu', '0912345678', '台北市大安區大林路1號', '', '信用卡', '門市自取', '9536', 'YM4QITZ4CK', '8582', '954', '4', '', ''),
(8, 70, 's7I3POUwe0', '2024-05-13 23:05:38', '已付款', '商品', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請附上小卡', 'LinePay', '門市自取', '6440', 'MPWEYBYFJY', '888', '5552', '23', '0000', '2024051802121073910'),
(9, 70, 'Xg8ZM1xFLn', '2024-05-14 23:07:57', '已付款', '租借', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請在月底寄出', '信用卡', '門市自取', '67200', 'YW5VW393WL', '53760', '13440', '21', '', ''),
(10, 70, 'azxUkbYCpe', '2024-05-15 23:08:56', '已付款', '租借', 'TzuYu', '0912345678', '台北市大安區大林路1號', '', '信用卡', '門市自取', '22400', 'VXJG9R71RG', '2240', '20160', '5', '', ''),
(11, 70, 'DFYS0IDTwq', '2024-05-17 23:09:54', '待付款', '租借', 'TzuYu', '0912345678', '南投縣鹿谷鄉中正路25號', '請附上小卡', '貨到付款', '宅配', '4800', 'WHJBOLO8AH', '1440', '3360', '20', '', ''),
(12, 70, '6qBmAr1DNV', '2024-05-17 23:10:51', '待付款', '租借', 'TzuYu', '0912345678', '花蓮縣吉安鄉永興一街27號', '請在月底寄出', '貨到付款', '宅配', '10400', 'NYILN1SXLI', '250', '10150', '5', '', ''),
(13, 70, 'WhbETyV25g', '2024-05-16 23:12:08', '已付款', '綜合', 'TzuYu', '0912345678', '南投縣鹿谷鄉中正路25號', '請用藍色包裝', '信用卡', '門市自取', '50532', 'DOH3Q070PJ', '15160', '35372', '15', '', ''),
(14, 70, 'gSQIqLsuAv', '2024-05-17 23:14:07', '待付款', '綜合', 'TzuYu', '0912345678', '南投縣鹿谷鄉中正路25號', '請在月底寄出', '貨到付款', '門市自取', '58336', 'F5PNSN2NRY', '2000', '56336', '37', '', ''),
(15, 70, 'fn27l94rSI', '2024-05-15 23:14:50', '待付款', '綜合', 'TzuYu', '0912345678', '南投縣鹿谷鄉中正路25號', '', '貨到付款', '宅配', '15904', '3SC4KXVOCO', '3181', '12723', '14', '', ''),
(16, 70, 'JShomlGBuN', '2024-05-17 23:16:18', '已付款', '綜合', 'TzuYu', '0912345678', '南投縣鹿谷鄉中正路25號', '請用藍色包裝', '信用卡', '宅配', '32424', NULL, '0', '32424', '21', '', ''),
(17, 70, 'ry66PtPe45', '2024-05-17 23:18:00', '已付款', '綜合', 'TzuYu', '0912345678', '花蓮縣吉安鄉永興一街27號', '', 'LinePay', '宅配', '7300', '1IP5WVMKCB', '300', '7000', '2', '0000', '2024051802121079810'),
(18, 70, 'y0QB9KS54t', '2024-05-18 12:00:17', '已付款', '綜合', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請在月底寄出', 'LinePay', '宅配', '7528', 'FFPHABCI89', '499', '7029', '6', '0000', '2024051802121336010'),
(19, 70, 'n6thpJhfNP', '2024-05-18 16:45:34', '已付款', '綜合', 'TzuYu', '0912345678', '台北市大安區大林路1號', '請用藍色包裝', 'LinePay', '宅配', '19824', 'KKT2W2Q2XO', '999', '18825', '22', '0000', '2024051802121435910');

-- --------------------------------------------------------

--
-- 資料表結構 `order_detail`
--

CREATE TABLE `order_detail` (
  `id` int(3) NOT NULL,
  `order_id` int(11) NOT NULL,
  `user_id` int(3) NOT NULL,
  `product_id` int(3) NOT NULL,
  `rent_id` int(11) NOT NULL,
  `course_id` int(11) NOT NULL,
  `p_color` varchar(255) DEFAULT NULL,
  `p_size` varchar(255) DEFAULT NULL,
  `p_price` varchar(100) NOT NULL,
  `p_total` int(5) NOT NULL,
  `p_amount` int(5) NOT NULL,
  `r_color` varchar(255) NOT NULL,
  `r_size` varchar(255) NOT NULL,
  `day_price` varchar(100) DEFAULT NULL,
  `r_total` int(5) NOT NULL,
  `r_amount` int(5) NOT NULL,
  `start_time` date DEFAULT NULL,
  `end_time` date DEFAULT NULL,
  `c_price` varchar(100) NOT NULL,
  `c_total` int(5) NOT NULL,
  `c_amount` int(5) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `order_detail`
--

INSERT INTO `order_detail` (`id`, `order_id`, `user_id`, `product_id`, `rent_id`, `course_id`, `p_color`, `p_size`, `p_price`, `p_total`, `p_amount`, `r_color`, `r_size`, `day_price`, `r_total`, `r_amount`, `start_time`, `end_time`, `c_price`, `c_total`, `c_amount`, `img`) VALUES
(1, 1, 70, 0, 0, 1, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-02-02', '2024-06-02', '100', 2000, 20, '1.jpg'),
(2, 2, 70, 0, 0, 4, NULL, NULL, '0', 0, 0, '', '', NULL, 0, 0, NULL, NULL, '200', 1400, 7, '4.jpg'),
(3, 3, 70, 0, 0, 10, NULL, NULL, '0', 0, 0, '', '', NULL, 0, 0, NULL, NULL, '1000', 3000, 3, '10.jpg'),
(4, 4, 70, 0, 0, 3, NULL, NULL, '0', 0, 0, '', '', NULL, 0, 0, NULL, NULL, '100', 500, 5, '3.jpg'),
(5, 5, 70, 2, 0, 0, '熱門色', 'S', '2480', 9920, 5, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'baseball_glove002.jpg'),
(6, 6, 70, 13, 0, 0, '熱門色', 'M', '2280', 7296, 4, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'batting_glove006.jpg'),
(7, 7, 70, 30, 0, 0, '熱門色', '31', '2980', 9536, 4, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'spiked_shoes008.jpg'),
(8, 8, 70, 94, 0, 0, '藍', '均碼', '350', 6440, 23, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, '1707118063.jpeg'),
(9, 9, 70, 0, 3, 0, NULL, NULL, '0', 0, 0, '黑', '均碼', '4000', 67200, 21, '2024-05-17', '2024-05-20', '0', 0, 0, 'wooden_bat003.jpg'),
(10, 10, 70, 0, 17, 0, NULL, NULL, '0', 0, 0, '黑', 'M', '5600', 22400, 5, '2024-05-17', '2024-05-20', '0', 0, 0, '1707117058.jfif'),
(11, 11, 70, 0, 20, 0, NULL, NULL, '0', 0, 0, '黑', '均碼', '300', 4800, 20, '2024-05-17', '2024-05-22', '0', 0, 0, '1707119632.jfif'),
(12, 12, 70, 0, 12, 0, NULL, NULL, '0', 0, 0, '黑', '28', '2600', 10400, 5, '2024-05-17', '2024-05-18', '0', 0, 0, 'spiked_shoes004.jpg'),
(13, 13, 70, 0, 0, 1, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-02-02', '2024-02-02', '100', 100, 1, '1.jpg'),
(14, 13, 70, 6, 0, 0, '熱門色', 'L', '2780', 17792, 8, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'baseball_glove006.jpg'),
(15, 13, 70, 0, 16, 0, NULL, NULL, '0', 0, 0, '黑', 'M', '6800', 32640, 6, '2024-05-17', '2024-05-20', '0', 0, 0, '1707116996.jpg'),
(16, 14, 70, 0, 0, 3, NULL, NULL, '0', 0, 0, '', '', NULL, 0, 0, NULL, NULL, '100', 800, 8, '3.jpg'),
(17, 14, 70, 8, 0, 0, '熱門色', 'L', '2480', 57536, 29, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'batting_glove001.jpg'),
(18, 15, 70, 0, 0, 4, NULL, NULL, '0', 0, 0, '', '', NULL, 0, 0, NULL, NULL, '200', 1600, 8, '4.jpg'),
(19, 15, 70, 4, 0, 0, '熱門色', 'M', '2980', 14304, 6, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'baseball_glove004.jpg'),
(20, 16, 70, 0, 0, 1, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-02-02', '2024-02-02', '100', 1400, 14, '1.jpg'),
(21, 16, 70, 123, 0, 0, '熱門色', '均碼', '5540', 31024, 7, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, '1707130540.jfif'),
(22, 17, 70, 0, 0, 10, NULL, NULL, '0', 0, 0, '', '', NULL, 0, 0, NULL, NULL, '1000', 1000, 1, '10.jpg'),
(23, 17, 70, 126, 0, 0, '熱門色', '均碼', '7875', 6300, 1, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, '1707131166.jpg'),
(24, 18, 70, 0, 0, 1, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-02-02', '2024-06-02', '100', 200, 2, '1.jpg'),
(25, 18, 70, 2, 0, 0, '綠', 'S', '2480', 3968, 2, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'baseball_glove002.jpg'),
(26, 18, 70, 0, 6, 0, NULL, NULL, '0', 0, 0, '藍', '均碼', '2100', 3360, 2, '2024-05-18', '2024-05-20', '0', 0, 0, '1707123306.jfif'),
(30, 19, 70, 0, 0, 1, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-02-02', '2024-06-02', '100', 1200, 12, '1.jpg'),
(31, 19, 70, 2, 0, 0, '熱門色', 'S', '2480', 1984, 1, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'baseball_glove002.jpg'),
(32, 19, 70, 8, 0, 0, '熱門色', 'M', '2480', 9920, 5, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'batting_glove001.jpg'),
(33, 19, 70, 0, 6, 0, NULL, NULL, '0', 0, 0, '黑', '均碼', '2100', 6720, 4, '2024-05-18', '2024-05-20', '0', 0, 0, '1707123306.jfif'),
(34, 20, 70, 0, 0, 9, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-04-11', '2024-05-22', '2500', 30000, 12, '9.jpg'),
(35, 20, 70, 0, 0, 34, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-04-10', '2024-05-31', '2500', 2500, 1, '1715327587.png'),
(36, 20, 70, 1, 0, 0, '綠', 'L', '2480', 3968, 2, '', '', NULL, 0, 0, NULL, NULL, '0', 0, 0, 'baseball_glove001.jpg'),
(37, 20, 70, 0, 6, 0, NULL, NULL, '0', 0, 0, '綠', '均碼', '7000', 11200, 2, '2024-05-20', '2024-05-29', '0', 0, 0, '1707123306.jfif'),
(38, 21, 70, 0, 0, 2, NULL, NULL, '0', 0, 0, '', '', '0', 0, 0, '2024-01-29', '2024-05-31', '200', 200, 1, '2.jpg');

-- --------------------------------------------------------

--
-- 資料表結構 `otp`
--

CREATE TABLE `otp` (
  `id` int(11) UNSIGNED NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `token` int(200) DEFAULT NULL,
  `exp_timestamp` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `otp`
--

INSERT INTO `otp` (`id`, `user_id`, `email`, `token`, `exp_timestamp`) VALUES
(17, 61, 'boy2285256@gmail.com', 372585, 1714322194356);

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `id` int(6) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL,
  `price` int(6) UNSIGNED NOT NULL,
  `class` varchar(20) NOT NULL,
  `other` varchar(20) NOT NULL,
  `brand` varchar(20) NOT NULL,
  `color` varchar(20) NOT NULL,
  `size` varchar(50) NOT NULL,
  `description` varchar(2000) NOT NULL,
  `image_url` varchar(1000) NOT NULL,
  `red` varchar(1000) NOT NULL,
  `green` varchar(1000) NOT NULL,
  `blue` varchar(1000) NOT NULL,
  `yellow` varchar(1000) NOT NULL,
  `sizepic` varchar(100) NOT NULL,
  `created_at` datetime NOT NULL,
  `valid` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`id`, `name`, `price`, `class`, `other`, `brand`, `color`, `size`, `description`, `image_url`, `red`, `green`, `blue`, `yellow`, `sizepic`, `created_at`, `valid`) VALUES
(1, 'mizuno || 壘球手套 FRIENDSHIP', 2480, '手套', '左手', 'MIZUNO', '藍', 'M,L', '材質- \r\n面,指背/裡:豬皮\r\n穿帶:牛皮\r\n\r\n球擋- CROSS 1\r\n\r\n守備位置- 內野手\r\n\r\n※耐用全皮仕樣:掌面,內裡,指背採用全豬皮\r\n※指背採用豬皮，適合初階球友使用，柔軟好上手。\r\n\r\n產地- 中國\r\n\r\n上市月份- 2023年 3月', 'baseball_glove001.jpg', 'baseball_glove001red.jpg', 'baseball_glove001green.jpg', 'baseball_glove001blue.jpg', 'baseball_glove001yellow.jpg', 'sizehands.jpg', '2024-01-31 15:31:00', 1),
(2, 'mizuno || 壘球手套 FRIENDSHIP PRO', 2480, '手套', '左手', 'MIZUNO', '橘', 'S,M,L', '材質- \r\n面,指背/裡:豬皮\r\n穿帶:牛皮\r\n\r\n球擋- CROSS 1\r\n\r\n守備位置- 內野手\r\n\r\n※耐用全皮仕樣:掌面,內裡,指背採用全豬皮\r\n※指背採用豬皮，適合初階球友使用，柔軟好上手。\r\n\r\n產地- 中國\r\n\r\n上市月份- 2023年 3月', 'baseball_glove002.jpg', 'baseball_glove002red.jpg', 'baseball_glove002green.jpg', 'baseball_glove002blue.jpg', 'baseball_glove002yellow.jpg', 'sizehands.jpg', '2024-02-04 18:24:00', 1),
(3, 'mizuno || 壘球手套 MVP', 2980, '手套', '左手', 'MIZUNO', '黃', 'M,L', '材質- \r\n面:高級牛皮 \r\n裡:豬皮 \r\n指背.穿帶:牛皮\r\n\r\n球擋- DEEP 1\r\n\r\n守備位置- 內野手\r\n\r\n※外皮全牛皮，內裏採用厚芯豬皮，舒適性提升。\r\n※適合慢壘進階球友使用。\r\n※美規式樣，姆指內側尺寸剛印，指背刺繡MRB logo，更顯質感。\r\n\r\n產地- 日本\r\n\r\n上市月份- 2023年 2月', 'baseball_glove003.jpg', 'baseball_glove003red.jpg', 'baseball_glove003green.jpg', 'baseball_glove003blue.jpg', 'baseball_glove003yellow.jpg', 'sizehands.jpg', '2024-02-05 12:19:00', 1),
(4, 'mizuno || 壘球手套 MVP V2', 2980, '手套', '左手', 'MIZUNO', '黃', 'M,L', '材質- \r\n面:高級牛皮 \r\n裡:豬皮 \r\n指背.穿帶:牛皮\r\n\r\n球擋- SA2\r\n\r\n守備位置- 外野手\r\n\r\n※外皮全牛皮，內裏採用厚芯豬皮，舒適性提升。\r\n※適合慢壘進階球友使用。\r\n※美規式樣，姆指內側尺寸剛印，指背刺繡MRB logo，更顯質感。\r\n\r\n產地- 日本\r\n\r\n上市月份- 2023年 2月', 'baseball_glove004.jpg', 'baseball_glove004red.jpg', 'baseball_glove004green.jpg', 'baseball_glove004blue.jpg', 'baseball_glove004yellow.jpg', 'sizehands.jpg', '2024-02-05 12:19:00', 1),
(5, 'mizuno || 壘球手套 FRIENDSHIP', 2480, '手套', '左手', 'MIZUNO', '紅', 'M,L', '材質- \r\n面,指背/裡:豬皮\r\n穿帶:牛皮\r\n\r\n球擋- CROSS 1\r\n\r\n守備位置- 內野手\r\n\r\n※耐用全皮仕樣:掌面,內裡,指背採用全豬皮\r\n※指背採用豬皮，適合初階球友使用，柔軟好上手。\r\n\r\n產地- 泰國\r\n\r\n上市月份- 2023年 9月', 'baseball_glove005.jpg', 'baseball_glove005purple.jpg', 'baseball_glove005green.jpg', 'baseball_glove005blue.jpg', 'baseball_glove005yellow.jpg', 'sizehands.jpg', '2024-02-05 12:49:00', 1),
(6, 'mizuno || 壘球手套', 2780, '手套', '左手', 'MIZUNO', '黑', 'M,L', '材質- \r\n面:指背:牛皮 \r\n內裏:PU 穿帶:PU\r\n\r\n球擋- TARTAN SHOCK\r\n\r\n守備位置- 通用\r\n\r\n\r\n1.立即好上手的摔花牛皮 2.Droll構造:在承受來球衝擊最大的球檔下緣加強穿繩設計。 3.球檔與拇指交叉部位皮革強化。\r\n\r\n產地- 泰國\r\n\r\n上市月份- 2023年 9月', 'baseball_glove006.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:01:00', 1),
(7, 'mizuno || 壘球手套 MVP', 2980, '手套', '左手', 'MIZUNO', '橘', 'M,L', '材質- \r\n面:高級牛皮 \r\n裡:豬皮 \r\n指背.穿帶:牛皮\r\n\r\n球擋- DEEP 1\r\n\r\n守備位置- 內野手\r\n\r\n※外皮全牛皮，內裏採用厚芯豬皮，舒適性提升。\r\n※適合慢壘進階球友使用。\r\n※美規式樣，姆指內側尺寸剛印，指背刺繡MRB logo，更顯質感。\r\n\r\n產地- 台灣\r\n\r\n上市月份- 2023年 7月', 'baseball_glove007.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:01:00', 1),
(8, 'mizuno || 打擊手套 (雙)', 2480, '手套', '打擊手套', 'MIZUNO', '黑', 'M,L', '材質- 掌面:山羊皮 指背:山羊皮.聚酯纖維\r\n\r\n※全羊皮手套:山羊皮採用MIZUNO特殊揉製技術,訴求柔舒手感及耐用性\r\n※3D THUMB FIT:拇指立體剪裁更合手舒適\r\n※更扎實服貼腕帶:採用射出成型材料,穿戴更順手舒適\r\n※設計感提升:彈性布採用數位印花\r\n\r\n產地- 越南\r\n\r\n上市月份- 2023年 5月', 'batting_glove001.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:01:00', 1),
(9, 'mizuno || 打擊手套 (雙) PROSW', 2480, '手套', '打擊手套', 'MIZUNO', '紅', 'M,L', '材質- 掌面:山羊皮 指背:山羊皮.聚酯纖維\n\n※全羊皮手套:山羊皮採用MIZUNO特殊揉製技術,訴求柔舒手感及耐用性\n※3D THUMB FIT:拇指立體剪裁更合手舒適\n※更扎實服貼腕帶:採用射出成型材料,穿戴更順手舒適\n※設計感提升:彈性布採用數位印花\n\n產地- 越南\n\n上市月份- 2023年 5月', 'batting_glove002.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(10, 'mizuno || 打擊手套 (雙) WILLDRIVE RED', 1580, '手套', '打擊手套', 'MIZUNO', '黑', 'M,L', '材質- 掌面:合成皮革 指背:合成皮革.聚酯纖維\n\n※POWER DRIVE：長打型掌面設計提升擊球瞬間力道,掌面雙面向止滑皮車縫\n※.3D立體剪裁:更服貼更合手\n※掌面超寬補強片:耐用&超止滑\n※舒適服貼腕帶:採用高張力透氣超寬扣帶設計穿戴更舒適\n※可水洗\n\n產地- 台灣\n\n上市月份- 2023年 5月', 'batting_glove003.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(11, 'mizuno || 打擊手套 (雙) WILLDRIVE SARED', 1580, '手套', '打擊手套', 'MIZUNO', '藍', 'M,L', '材質- 掌面:合成皮革 指背:合成皮革.聚酯纖維\n\n※POWER DRIVE：長打型掌面設計提升擊球瞬間力道,掌面雙面向止滑皮車縫\n※.3D立體剪裁:更服貼更合手\n※掌面超寬補強片:耐用&超止滑\n※舒適服貼腕帶:採用高張力透氣超寬扣帶設計穿戴更舒適\n※可水洗\n\n產地- 越南\n\n上市月份- 2023年 6月', 'batting_glove004.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(12, 'mizuno || 打擊手套 (雙) WILLDRIVE REDAQES', 1580, '手套', '打擊手套', 'MIZUNO', '紅', 'M,L', '材質- 掌面:合成皮革 指背:合成皮革.聚酯纖維\n\n※POWER DRIVE：長打型掌面設計提升擊球瞬間力道,掌面雙面向止滑皮車縫\n※.3D立體剪裁:更服貼更合手\n※掌面超寬補強片:耐用&超止滑\n※舒適服貼腕帶:採用高張力透氣超寬扣帶設計穿戴更舒適\n※可水洗\n\n產地- 柬埔寨\n\n上市月份- 2023年 7月', 'batting_glove005.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(13, 'mizuno || 打擊手套(2雙入)', 2280, '手套', '打擊手套', 'MIZUNO', '黑', 'M,L', '材質- 合成皮革 指背:合成皮革.聚酯纖維\n\n※Flex Cutting穿戴舒適新版型\n※.超止滑,耐用與輕柔掌面皮\n\n產地- 越南\n\n上市月份- 2023年 5月', 'batting_glove006.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(14, 'mizuno || 打擊手套 (雙)', 1380, '手套', '打擊手套', 'MIZUNO', '黑', 'M,L', '材質- 掌面:羊皮 指背:人工皮革.聚酯纖維\n\n※超舒適: 掌面MIZUNO特殊輮製烙紋山羊皮,手感佳+耐用\n※.透氣+服貼: 指背MIZUNO Flexmesh獨特透氣高張力塗佈彈性布\n※後帶:QuickAdjust 成型片後帶更扎實穿戴\n※腕部FIT: 柔軟舒適熱成型發泡材+ PNP 個人名牌織標\n\n產地- 印尼\n\n上市月份- 2023年 2月', 'batting_glove007.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(15, 'mizuno || 打擊手套 (雙) 2.0', 1380, '手套', '打擊手套', 'MIZUNO', '藍', 'M,L', '材質- 掌面:羊皮 指背:人工皮革.聚酯纖維\n\n※超舒適: 掌面MIZUNO特殊輮製烙紋山羊皮,手感佳+耐用\n※.透氣+服貼: 指背MIZUNO Flexmesh獨特透氣高張力塗佈彈性布\n※後帶:QuickAdjust 成型片後帶更扎實穿戴\n※腕部FIT: 柔軟舒適熱成型發泡材+ PNP 個人名牌織標\n\n產地- 柬埔寨\n\n上市月份- 2023年 2月', 'batting_glove008.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(16, 'mizuno || 打擊手套 (雙) V3', 1380, '手套', '打擊手套', 'MIZUNO', '紅', 'M,L', '材質- 掌面:羊皮 指背:人工皮革.聚酯纖維\n\n※超舒適: 掌面MIZUNO特殊輮製烙紋山羊皮,手感佳+耐用\n※.透氣+服貼: 指背MIZUNO Flexmesh獨特透氣高張力塗佈彈性布\n※後帶:QuickAdjust 成型片後帶更扎實穿戴\n※腕部FIT: 柔軟舒適熱成型發泡材+ PNP 個人名牌織標\n\n產地- 柬埔寨\n\n上市月份- 2023年 2月', 'batting_glove009.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(17, 'mizuno || 打擊手套 (雙) ESP', 1080, '手套', '打擊手套', 'MIZUNO', '黑', 'M,L', '材質- 掌面:人工皮革 指背:人工皮革.聚酯纖維(彈性布)\n\n※超透氣又止滑::掌面採用新透氣合成皮表面特殊樹酯止滑加工\n※,服貼包覆性+透氣性：數位印花彈性布+超寬雙色腕帶\n※剪裁設計:合手化剪裁,指關節靈活操作\n※耐用:掌面超寬補強片\n\n產地- 柬埔寨\n\n上市月份- 2023年 1月', 'batting_glove010.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(18, 'mizuno || 打擊手套 (雙) EXP', 1080, '手套', '打擊手套', 'MIZUNO', '藍', 'M,L', '材質- 掌面:人工皮革 指背:人工皮革.聚酯纖維(彈性布)\n\n※超透氣又止滑::掌面採用新透氣合成皮表面特殊樹酯止滑加工\n※,服貼包覆性+透氣性：數位印花彈性布+超寬雙色腕帶\n※剪裁設計:合手化剪裁,指關節靈活操作\n※耐用:掌面超寬補強片\n\n產地- 柬埔寨\n\n上市月份- 2023年 2月', 'batting_glove011.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(19, 'mizuno || 打擊手套 (雙) QWE', 1280, '手套', '打擊手套', 'MIZUNO', '藍', 'M,L', '材質- 掌面:羊皮 指背:人工皮革.聚酯纖維(速乾彈性布)\n\n※耐用:掌面山羊皮＋補強片 2,服貼包覆性+透氣性：數位印花彈性布+超寬雙色腕帶\n※剪裁設計:合手化剪裁,指關節靈活操作\n\n產地- 柬埔寨\n\n上市月份- 2024年 1月', 'batting_glove012.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(20, 'mizuno || 打擊手套 (雙) SAP', 1280, '手套', '打擊手套', 'MIZUNO', '黑', 'M,L', '材質- 掌面:羊皮 指背:人工皮革.聚酯纖維(速乾彈性布)\n\n※耐用:掌面山羊皮＋補強片 2,服貼包覆性+透氣性：數位印花彈性布+超寬雙色腕帶\n※剪裁設計:合手化剪裁,指關節靈活操作\n\n產地- 日本\n\n上市月份- 2024年 1月', 'batting_glove013.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(21, 'mizuno || 打擊手套 (雙) DPE', 1580, '手套', '打擊手套', 'MIZUNO', '黑', 'M,L', '材質- 掌面:合成皮革 指背:合成皮革.聚酯纖維\n\n※POWER DRIVE：長打型掌面設計 提升擊球瞬間力道,掌面雙面向止滑皮車縫\n※W BELT:指背強化包覆拉帶\n※3D立體剪裁:更服貼更合手\n※掌面超寬補強片:耐用&超止滑\n※舒適服貼腕帶:採用高張力透氣超寬扣帶設計穿戴更舒適\n\n產地- 越南\n\n上市月份- 2023年 12月', 'batting_glove014.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(22, 'mizuno || 打擊手套 (雙) SAD', 1580, '手套', '打擊手套', 'MIZUNO', '藍', 'M,L', '材質- 掌面:合成皮革 指背:合成皮革.聚酯纖維\n\n※POWER DRIVE：長打型掌面設計 提升擊球瞬間力道,掌面雙面向止滑皮車縫\n※W BELT:指背強化包覆拉帶\n※3D立體剪裁:更服貼更合手\n※掌面超寬補強片:耐用&超止滑\n※舒適服貼腕帶:採用高張力透氣超寬扣帶設計穿戴更舒適\n\n產地- 越南\n\n上市月份- 2023年 12月', 'batting_glove015.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:10:00', 1),
(23, 'mizuno || 棒球釘鞋 CUSHIONREVO PRO', 4580, '球鞋', '釘鞋', 'MIZUNO', '藍', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 340g(28.0cm)\n\n※追求裸足感的厚底設計。\n※提升彎曲的大底溝槽設計與內藏高反發發泡材質。\n※Enerzy鞋墊\n\n\n產地- 柬埔寨\n\n上市月份- 2023年 2月', 'spiked_shoes001.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:10:00', 1),
(24, 'mizuno || 棒球釘鞋 CUSHIONREVO PRO2', 4580, '球鞋', '釘鞋', 'MIZUNO', '紅', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 340g(28.0cm)\n\n※追求裸足感的厚底設計。\n※提升彎曲的大底溝槽設計與內藏高反發發泡材質。\n※Enerzy鞋墊\n\n\n產地- 柬埔寨\n\n上市月份- 2023年 2月', 'spiked_shoes002.jpg', 'spiked_shoes002red.jpg', 'spiked_shoes002green.jpg', 'spiked_shoes002blue.jpg', 'spiked_shoes002yellow.jpg', 'sizeeshoe.JPG', '2024-02-05 13:10:00', 1),
(25, 'mizuno || 棒球釘鞋 LIGHTREVO ELITE 2', 3980, '球鞋', '釘鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 230g(27.0cm)\n\n※量販史上最輕量釘鞋。\n\n產地- 柬埔寨\n\n上市月份- 2024年 1月', 'spiked_shoes003.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(26, 'mizuno || 棒球釘鞋 LIGHTREVO BUDDY 2', 2980, '球鞋', '釘鞋', 'MIZUNO', '黑', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 260g(27.0cm)\n\n※輕量、柔軟，強化耐久性的鞋頭補強。\n\n產地- 柬埔寨\n\n上市月份- 2024年 1月', 'spiked_shoes004.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(27, 'mizuno || 棒球釘鞋 LIGHTREVO BUDDY 3', 2980, '球鞋', '釘鞋', 'MIZUNO', '紅', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 260g(27.0cm)\n\n※輕量、柔軟，強化耐久性的鞋頭補強。\n\n產地- 柬埔寨\n\n上市月份- 2024年 1月', 'spiked_shoes005.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(28, 'mizuno || 棒球釘鞋 LIGHTREVO PRO GS TPU', 4680, '球鞋', '釘鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約285g(27.0cm 單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 8月', 'spiked_shoes006.jpg', 'spiked_shoes006red.jpg', 'spiked_shoes006green.jpg', 'spiked_shoes006blue.jpg', 'spiked_shoes006yellow.jpg', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(29, 'mizuno || 棒球釘鞋 9-SPIKE AMBITON 3', 3180, '球鞋', '釘鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：合成纖維＋人工皮革\n大底：射出成型大底\n\n重量- 約350g(27.0cm 單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 7月', 'spiked_shoes007.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(30, 'mizuno || 棒球釘鞋 MIZUNO AMBITON 3 TPU', 2980, '球鞋', '釘鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約305g(27.0cm 單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 6月', 'spiked_shoes008.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(31, 'mizuno || 棒球釘鞋 MIZUNO DOMINANT 4', 3880, '球鞋', '釘鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：合成纖維＋人工皮革\n大底：射出成型大底\n\n重量- 約305g(27.0cm單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 6月', 'spiked_shoes009.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(32, 'mizuno || 棒壘球鞋 WAVE LIGHTREVO Jr.', 1780, '球鞋', '跑鞋', 'MIZUNO', '黑', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約185g(21.0cm單腳)\n\n產地- 泰國\n\n上市月份- 2023年 3月', 'baseball_shoes001.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(33, 'mizuno || 棒壘球鞋 WAVE LIGHTREVO Jr2.', 1780, '球鞋', '跑鞋', 'MIZUNO', '紅', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約185g(21.0cm單腳)\n\n產地- 泰國\n\n上市月份- 2023年 3月', 'baseball_shoes002.jpg', 'baseball_shoes002red.jpg', 'baseball_shoes002green.jpg', 'baseball_shoes002blue.jpg', 'baseball_shoes002yellow.jpg', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(34, 'mizuno || 棒壘球鞋 WAVE LIGHTREVO', 1880, '球鞋', '跑鞋', 'MIZUNO', '黑', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約290g(27.0cm單腳)\n\n產地- 越南\n\n上市月份- 2023年 2月', 'baseball_shoes003.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(35, 'mizuno || 棒壘球鞋 WAVE LIGHTREVO PRO', 1880, '球鞋', '跑鞋', 'MIZUNO', '黃', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約270g(27.0cm單腳)\n\n※輕量、柔軟，強化耐久性的鞋頭補強。\n\n產地- 泰國\n\n上市月份- 2023年 1月', 'baseball_shoes004.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(36, 'mizuno || 棒壘球鞋 WAVE LIGHTREVO BLT', 2180, '球鞋', '跑鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約285g(27.0cm單腳)\n\n※輕量、柔軟，強化耐久性的鞋頭補強。\n\n產地- 柬埔寨\n\n上市月份- 2024年 1月', 'baseball_shoes005.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(37, 'mizuno || 棒壘球鞋 WAVE LIGHTREVO', 1880, '球鞋', '跑鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約290g(27.0cm單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 8月', 'baseball_shoes006.jpg', 'baseball_shoes006red.jpg', 'baseball_shoes006green.jpg', 'baseball_shoes006blue.jpg', 'baseball_shoes006yellow.jpg', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(38, 'mizuno || 棒壘球鞋 LIGHTREVO BUDDY ∞', 2680, '球鞋', '跑鞋', 'MIZUNO', '單一顏色', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約270g (27.0cm單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 6月', 'baseball_shoes007.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(39, 'mizuno || 棒壘球鞋 LIGHTREVO ELITE TPU', 3680, '球鞋', '跑鞋', 'MIZUNO', '藍', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約285g(27.0cm單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 1月', 'baseball_shoes008.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(40, 'mizuno || 棒壘球鞋 LIGHTREVO ELITE TPU PRO', 3680, '球鞋', '跑鞋', 'MIZUNO', '白', '24,25,26,27,28,29,30,31', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約285g(27.0cm單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 1月', 'baseball_shoes009.jpg', 'baseball_shoes009red.jpg', 'baseball_shoes009green.jpg', 'baseball_shoes009blue.jpg', 'baseball_shoes009yellow.jpg', 'sizeeshoe.JPG', '2024-02-05 13:11:00', 1),
(41, 'mizuno || 日製成人硬式楓木棒 HIGHCLASS STYLE', 4980, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 楓木\n\n尺寸- 84cm870g直徑?64m/m\n\n顏色- 火烤x原木\n\n※TS8-安定握把部設計，確實帶出棒頭長打型設計。\n\n產地- 越南\n\n上市月份- 2023年 4月', 'wooden_bat001.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(42, 'mizuno || 日製成人硬式楓木棒 MIZUNO PRO', 6980, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 楓木\n\n尺寸- 84cm840g直徑?63.5m/m\n\n顏色- 黑色/原木\n\n※鈴木一朗棒型，講究的輕量化設計，棒頭設計有利於用棒頭發力的長打型球棒。\n\n產地- 越南\n\n上市月份- 2023年 4月', 'wooden_bat002.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(43, 'mizuno || 日製教練棒 MIZUNO PRO KNOCK', 3280, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 朴木+楓木\n\n尺寸- 91cm 約550g 直徑?56m/m\n\n顏色- 白/深藍\n\n※朴木與楓木合木，兼具輕量與耐用。\n\n產地- 台灣\n\n上市月份- 2023年 3月', 'wooden_bat003.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(44, 'mizuno || 成人硬式木棒 MZP 271 PRO LIMITED MAPLE', 3980, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 楓木\n\n尺寸- 84cm.平均約850g..86cm約880g\n\n顏色- 黑色 & 咖啡x黑色\n\n※職棒選手型\n※使用高級硬楓，創造出更硬的打感，擊球聲更清脆。\n※家具等級高級烤漆。<>MZP271型\n\n產地- 越南\n\n上市月份- 2023年 3月', 'wooden_bat004.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(45, 'mizuno || 成人硬式木棒 MZP 110 PRO SELECT MAPLE', 3280, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 楓木\n\n尺寸- 84cm.平均約880g..86cm約900g\n\n顏色- 黑色 & 咖啡x黑色\n\n※職棒選手型\n※使用高級硬楓，創造出更硬的打感，擊球聲更清脆。\n※家具等級高級烤漆。MZM110\n\n產地- 中國\n\n上市月份- 2023年 3月', 'wooden_bat005.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(46, 'mizuno || 日製教練棒', 3280, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 朴木+楓木\n\n尺寸- 90cm 約570g 直徑ψ57m/m\n\n顏色- 深藍/水藍\n\n※朴木與楓木合木，兼具輕量與耐用。\n\n產地- 日本\n\n上市月份- 2023年 9月', 'wooden_bat006.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(47, 'mizuno || 日製成人硬式白樺木棒', 5180, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 白樺木\n\n尺寸- 84cm870g直徑ψ64.5m/m\n\n顏色- 火烤x黑色\n\n※TS8-安定握把部設計，確實帶出棒頭長打型設計。 HC5-偏細握把整體喇叭型安打棒型設計。\n\n產地- 日本\n\n上市月份- 2023年 9月', 'wooden_bat007.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(48, 'mizuno || 日製成人硬式楓木棒 GLOBAL ELITE', 4980, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 楓木\n\n尺寸- 84cm870g直徑ψ64.5m/m\n\n顏色- 原木\n\n※SU51-好操控，適合安打也可設定長打用。\n※SU7-安定度高握把，一般打者好發揮的安打棒型。\n\n產地- 日本\n\n上市月份- 2023年 3月', 'wooden_bat008.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(49, 'mizuno || 日製成人硬式黃樺木棒 GLOBAL ELITE', 3680, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 楓木\n\n尺寸- 84cm870g直徑?64m/m\n\n顏色- 赤褐/原木\n\n※TO55-細棒尾形狀以利跟球點，加寬擊球甜蜜區\n※適合長打型。\n\n產地- 日本\n\n上市月份- 2023年 3月', 'wooden_bat009.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(50, 'mizuno || 日製教練棒 MIZUNO PRO KNOCK', 3280, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 朴木+楓木\n\n尺寸- 90cm 約570g 直徑ψ57m/m\n\n顏色- 朴木+楓木\n\n※朴木與楓木合木，兼具輕量與耐用。\n\n產地- 日本\n\n上市月份- 2023年 3月', 'wooden_bat010.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(51, 'mizuno || 日製重量訓練棒 PROFESSIONAL W', 3280, '球棒', '木棒', 'MIZUNO', '單一顏色', '均碼', '材質- 木\n\n尺寸- 84cm 約950g 直徑?65m/m\n\n顏色- 黑/紅色\n\n※日本展示會限定顏色，職業選手型。\n\n產地- 越南\n\n上市月份- 2023年 3月', 'wooden_bat011.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(52, 'mizuno || 日製成人軟式金屬棒 WILL DRIVE RED', 4980, '球棒', '鋁棒', 'MIZUNO', '單一顏色', '均碼', '材質- 超鋁合金\n\n尺寸- 84cm 700g 直徑?68m/m\n\n顏色- 紅色\n\n\n※安打型設計(M BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 越南\n\n上市月份- 2023年 4月', 'metallic_bat001.jpg', 'metallic_bat001red.jpg', 'metallic_bat001green.jpg', 'metallic_bat001blue.jpg', 'metallic_bat001yellow.jpg', 'bat.jpg', '2024-02-05 13:12:00', 1),
(53, 'mizuno || 日製成人軟式金屬棒 WILL DRIVE BLUE', 4980, '球棒', '鋁棒', 'MIZUNO', '單一顏色', '均碼', '材質- ZX70\n\n尺寸- 84cm 580g 直徑?69m/m\n\n顏色- 藍色\n\n\n※安打型設計(T BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 越南\n\n上市月份- 2023年 4月', 'metallic_bat002.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(54, 'mizuno || 日製成人軟式金屬棒', 4980, '球棒', '鋁棒', 'MIZUNO', '單一顏色', '均碼', '材質- 超鋁合金\n\n尺寸- 84cm 700g 直徑ψ68m/m\n\n顏色- 銀色\n\n※安打型設計(M BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 9月', 'metallic_bat003.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(55, 'mizuno || 日製成人軟式訓練金屬棒', 4980, '球棒', '鋁棒', 'MIZUNO', '單一顏色', '均碼', '材質- ZX70\n\n尺寸- 84cm 570g 直徑ψ69m/m\n\n顏色- 金色\n\n\n※長打型設計(T BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 9月', 'metallic_bat004.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(56, 'mizuno || 日製成人軟式金屬棒 WILL DRIVERED', 4980, '球棒', '鋁棒', 'MIZUNO', '單一顏色', '均碼', '材質- 超鋁合金\n\n尺寸- 84cm 710g 直徑ψ68m/m\n\n顏色- 紅色\n\n※長打型設計(T BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 3月', 'metallic_bat005.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(57, 'mizuno || 日製成人軟式金屬棒 WILL DRIVEBLUE', 4980, '球棒', '鋁棒', 'MIZUNO', '單一顏色', '均碼', '材質- ZX70\n\n尺寸- 84cm 600g 直徑ψ69m/m\n\n顏色- 藍色\n\n\n※安打型設計(M BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 3月', 'metallic_bat006.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(58, 'mizuno || 少年軟式金屬棒 WILL DRIVE RED', 4280, '球棒', '鋁棒', 'MIZUNO', '單一顏色', '均碼', '材質- 超鋁合金\n\n尺寸- 78cm 約540g 直徑ψ66m/m\n\n顏色- 紅色\n\n※安打型設計(M BALANCE)，縱向研磨。\n※日本軟式球新規格J號球對應。\n\n產地- 中國\n\n上市月份- 2023年 3月', 'metallic_bat007.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:12:00', 1),
(59, 'SLUGGER 久保田 || KUBOTA KSG-L5 硬式最高階 內野手套 棒球手套 壘球手套', 11500, '手套', '左手', '久保田Slugger', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：橘色 (如照片)\n\n2. 尺寸：11.8吋\n\n3. 重量：560克\n\n4. 款式：內野 (硬式)\n\n5. 材質：TOP GRAIN STEERHIDE 高階牛皮\n\n6. 產地：日本 (日本進口)\n\n-\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n\n接球面『???』 機能設計，手套開合自由度較高。', 'baseball_glove008.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:12:00', 1),
(60, 'SLUGGER 久保田 || KUBOTA KSG-24PS 硬式最高階 內野手套 棒球手套 壘球手', 11000, '手套', '左手', '久保田Slugger', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：橘色 (如照片)\n\n2. 尺寸：11.8吋\n\n3. 重量：530克\n\n4. 款式：內野 (硬式)\n\n5. 材質：TOP GRAIN STEERHIDE 高階牛皮\n\n6. 產地：日本 (日本進口)\n\n-\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n\n24PS 從下方土手部延伸到上方整體球袋都非常寬闊，為棒壘都適用的尺寸，\n\n另一個特徵為其帶有特殊造型十字球擋，頂級內野手首選好套！', 'baseball_glove009.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:12:00', 1),
(61, 'SLUGGER 久保田 || KUBOTA KSG-SPS 硬式最高階 外野手套 棒球手套 壘球手套', 10000, '手套', '左手', '久保田Slugger', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：黑色 (如照片)\n\n2. 尺寸：12.25吋\n\n3. 重量：615克\n\n4. 款式：外野 (硬式)\n\n5. 材質：TOP GRAIN STEERHIDE 高階牛皮\n\n6. 產地：日本 (日本進口)\n\n-\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n\n*球擋上緣 SE 關節機能 / 井字球擋 / 掌根逆穿芯 / 12.25\" 壘球內外野工具人適用尺寸', 'baseball_glove010.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:12:00', 1),
(62, 'SLUGGER 久保田 || KUBOTA KSG-L7 硬式最高階 內野手套 棒球手套 壘球手套 ', 11000, '手套', '左手', '久保田Slugger', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：黑色 (如照片)\n\n2. 尺寸：11.9吋\n\n3. 重量：570克\n\n4. 款式：內野 (硬式)\n\n5. 材質：TOP GRAIN STEERHIDE 高階牛皮\n\n6. 產地：日本 (日本進口)\n\n-\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n\n萬年經典款松井稼頭央仕樣，久保田的紮實做工及絕佳手感，內野首選！', 'baseball_glove011.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:12:00', 1),
(63, 'SLUGGER 久保田 || KUBOTA EGS-90 江頭重利90歲紀念版 KSG-24MS ', 15000, '手套', '左手', '久保田Slugger', '黃', 'M,L', '產品特點：\r\n\r\n1. 顏色：橘色\r\n\r\n2. 尺寸：11.25吋\r\n\r\n3. 重量：570克\r\n\r\n4. 款式：內野 (硬式)\r\n\r\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\r\n\r\n6. 產地：日本 (日本進口)\r\n\r\n-\r\n江頭重利為手套湯揉界的知名資深職人，也是久保田這個品牌中的代表性象徵之一，\r\n\r\n此記念手套拇指有『江頭重利』鋼印，小指也有『EGS-90』鋼印，型號鋼印則置於掌心。\r\n\r\n手口標也不是一般市售款，為早期復古的顏色式樣，可實戰也可蒐藏的經典手套。\r\n\r\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\r\n\r\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！', 'baseball_glove012.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-01 12:33:00', 1),
(64, 'SLUGGER 久保田 || KUBOTA KSG-TA6 廣島東洋鯉魚 安部友裕 硬式最高階 內野', 11000, '手套', '左手', '久保田Slugger', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：橘紅 (如照片)\n\n2. 尺寸：11.75吋\n\n3. 重量：560克\n\n4. 款式：內野 (硬式)\n\n5. 材質：TOP GRAIN STEERHIDE 高階牛皮\n\n6. 產地：日本 (日本進口)\n\n-\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n\n廣島鯉魚內野手 - 安部友裕 (Abe Tomohiro) 型號，拇指 Thumb Holder 補強設計。\n', 'baseball_glove013.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:12:00', 1),
(65, 'ZETT || PROSTATUS SPECIAL EDITION 頂級金標 硬式最高階 反手 投手', 9000, '手套', '右手', 'ZETT', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：橘色\n\n2. 尺寸：12吋\n\n3. 重量：550克\n\n4. 款式：投手 (硬式)\n\n5. 材質：PROSTATUS KIP 歐洲牛革\n\n6. 產地：日本\n\n-\n皮革採用量少質精的  PROSTATUS KIP 歐洲牛革，\n\n無論是定價或是皮革本身的細緻度都與一般量產最高階款式不同，值得入手！\n\n*刺繡風格矽膠手口標', 'baseball_glove014.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(66, 'ZETT || PROSTATUS 頂級金標 硬式最高階 反手 投手手套 左投', 8000, '手套', '右手', 'ZETT', '單一顏色', 'M,L', '產品特點：\n　\n1. 顏色：黃色\n\n2. 尺寸：12.25吋\n\n3. 重量：640克\n\n4. 款式：投手 (硬式)\n\n5. 材質：JAPAN LEATHER 高階牛革\n\n6. 產地：日本\n\n-\nZETT PROSTATUS 硬式手套目前仍由日本的職人團隊進行製作，\n\n皮革材料維持著水準之上的要求，做工也屬於高階手套中的前段班，\n\n每年也不斷的在刀模型號外型上更為精進，日製手套中的優質選擇！', 'baseball_glove015.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(67, 'ZETT || PROSTATUS 頂級金標 軟式最高階 反手 投手手套 棒球手套 壘球手套 左投', 5400, '手套', '右手', 'ZETT', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：紅色 (如照片)\n\n2. 尺寸：12.25吋\n\n3. 重量：625克\n\n4. 款式：反手投手 (軟式)\n\n5. 材質：PC PATTERN 高階牛皮\n\n6. 產地：越南 (日本進口)\n\n-\nZETT PROSTATUS 頂級軟式手套作工，處處細節都是水準以上，\n\nJapanese Tanned Leather 日本鞣製皮革的質感也非常不錯，\n\n絕非一般低階入門軟式手套可以相提並論，值得球友入手一試！', 'baseball_glove016.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(68, 'WILSON 威爾森 || D-MAX DUAL 95型 反手 軟式內野手套 左投', 4000, '手套', '右手', 'Wilson', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：皇家藍\n\n2. 尺寸：12吋\n\n3. 重量：560克\n\n4. 款式：內野\n\n5. 材質：天然皮革 + 手背 Super Skin\n\n6. 產地：越南', 'baseball_glove017.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(69, 'WILSON 威爾森 || A2K Juan Soto JS22 2023 GAME MODEL 反', 7000, '手套', '右手', 'Wilson', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：奶油 x 深藍\n\n2. 尺寸：12.75吋\n\n3. 重量：730克\n\n4. 款式：外野 (美規硬式)\n\n5. 材質：PRO-STOCK SELECT Leather\n\n6. 產地：日本\n\n-\n經典 Juan Soto 外野井字球擋，皮革紮實手感舒適，刀模服貼手掌，\n\nA2K 為 WILSON 旗下頂級系列，除了厚實舒適之外，產地為日本製！', 'baseball_glove018.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(70, 'ZETT || PROSTATUS SPECIAL EDITION 頂級金標 硬式最高階 反手 外野', 9000, '手套', '右手', 'ZETT', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：紅色\n\n2. 尺寸：12.8吋\n\n3. 重量：620克\n\n4. 款式：外野 (硬式)\n\n5. 材質：PROSTATUS KIP 歐洲牛革\n\n6. 產地：日本\n\n-\n皮革採用量少質精的  PROSTATUS KIP 歐洲牛革，\n\n無論是定價或是皮革本身的細緻度都與一般量產最高階款式不同，值得入手！\n\n*刺繡風格矽膠手口標', 'baseball_glove019.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(71, 'ASICS 亞瑟士 || GOLD STAGE i-Pro 大A標 硬式最高階 反手 外野手套 小指', 9000, '手套', '右手', 'asics', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：黑色\n\n2. 尺寸：12.5吋\n\n3. 重量：610克\n\n4. 款式：外野 (硬式)\n\n5. 材質：Special Over kip-Leather 高階小牛革\n\n6. 產地：日本\n\n-\n亞瑟士新款 i-Pro 頂級系列，雙夾條紮實度佳，整體球袋深度夠！\n\n*小指二本入機能，可退指使用。', 'baseball_glove020.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(72, 'SSK || PROBRAIN Master Build Edition 硬式最高階 反手 外野手套', 11000, '手套', '右手', 'SSK', '單一顏色', 'M,L', '產品特點：\n　\n1. 顏色：黑色\n\n2. 尺寸：13吋\n\n3. 重量：580克\n\n4. 款式：外野 (硬式)\n\n5. 材質：高階牛革\n\n6. 產地：日本 (日本進口)\n\n-\n目前少見的 PROBRAIN Master Build Edition 等級，皮革光滑細緻綿密，\n\n手口為金色綠邊的刺繡布標，產地為日本製，罕見的 SSK 頂級手套！', 'baseball_glove021.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(73, 'NIKE || DIAMOND ELITE SIXTY.6 朋系列 反手 硬式外野手套 左投', 10000, '手套', '右手', 'NIKE', '單一顏色', 'M,L', '產品特點：\n\n1. 顏色：黑色\n\n2. 尺寸：12.75吋\n\n3. 重量：600克\n\n4. 款式：外野 (硬式)\n\n5. 材質：Premium Moist Touch Leather 高階牛革\n\n6. 產地：日本\n\n-\n目前已不多見的日本製 NIKE DIAMOND ELITE 硬式系列，手感紮實服貼！\n\n*手套為全新未使用，已型付處理，即戰力可馬上使用。', 'baseball_glove022.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(74, 'SSK || 獨家訂製 棒壘手套 內野 密網 藍白 左投', 3700, '手套', '右手', 'SSK', '單一顏色', 'M,L', '型號：SSK-880-3 TOG0011\n\n尺寸 : 約 12 吋\n\n款式 : 內野 左投\n\n球檔 : 密網\n\n材質 : 硬式牛皮  \n\n顏色 : 藍白 (如圖示)\n\n-\n\n採用硬式牛皮製造，耐用耐接，戴起來透氣且手感舒適', 'baseball_glove023.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(75, 'ZETT║少年伸縮打擊手套BBGT-114(雙)', 640, '手套', '打擊手套', 'ZETT', '單一顏色', 'M,L', '★材質：高級壓紋合成皮革／聚脂纖維\n★尺寸：單一尺寸(適用於16~21cm)\n★原產地：台灣', 'batting_glove016.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(76, 'SSK || WING FIELD 棒壘手套 黑X萊姆黃 外野 雙十字 左投', 2500, '手套', '右手', 'SSK', '單一顏色', 'M,L', '型號 : TRG51G-9040R\n\n球檔 : 雙十字 (如圖示)\n\n款式 : 外野\n\n尺寸 : 約 13 吋 左投\n\n 顏色 : 黑X萊姆黃 (如圖示)\n\n材質 : 表皮-硬式牛皮 裡皮-天然皮革 帶皮-透心牛皮\n\n-\n採用硬式牛皮，輕量化設計，搶眼新潮配色鎖定球場焦點目光\n\n耐久度高，內裡天然皮革穿戴舒適', 'baseball_glove024.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(77, 'SSK || 棒壘手套 內野 密網 紅白 左投', 3700, '手套', '右手', 'SSK', '單一顏色', 'M,L', '型號：TOG777\n\n尺寸 : 約 12 吋 左投\n\n款式 : 內野\n\n球檔 : 密網\n\n材質 : 硬式牛皮  \n\n顏色 : 紅白 (如圖示)\n\n-\n採用硬式牛皮製造，耐用耐接\n戴起來透氣且手感舒適', 'baseball_glove025.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(78, 'ZETT || 棒壘手套 棋盤編網 硬式 投手 粉紅愛心 左投', 3200, '手套', '右手', 'ZETT', '單一顏色', 'M,L', '型號：BPGT-3SP2301\n\n尺寸 : 約 12 吋 左投\n\n材質 : 硬式 訂製牛皮\n\n顏色 : 粉紅愛心 (如圖示)', 'baseball_glove026.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(79, 'SSK || 棒壘手套 內野 密網 紫黑白 左投', 3700, '手套', '右手', 'SSK', '單一顏色', 'M,L', '型號：880\n\n尺寸 : 約 12 吋\n\n款式 : 內野 左投\n\n球檔 : 密網\n\n材質 : 硬式牛皮  \n\n顏色 : 紫黑白 (如圖示)', 'baseball_glove027.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 13:13:00', 1),
(80, 'Louisville Slugger║ALL-STAR IV 楓木慢壘木棒-深藍25OZ', 1350, '球棒', '木棒', 'LouisvilleSlugger', '單一顏色', '均碼', '●材質：楓木 \n●挖洞：有 \n●長度：34\" \n●重量：25oz', 'wooden_bat012.jpg', '', '', '', '', 'bat.jpg', '2024-02-05 13:13:00', 1),
(81, '法蘭絨棒球帽', 1090, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '◆  單一尺寸\n◆ 50%縲縈/50%羊毛\n◆ 一體成型帽簷\n◆ 後側黏扣帶設計\n◆ 電繡細節\n◆ 六分割結構', '1707115398.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 14:44:00', 1),
(82, '舒適棉質棒球帽', 299, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '◆ 棉\r\n◆ 中弧度預成型帽檐\r\n◆ 可調節後束帶\r\n◆ 刺繡徽標\r\n◆ 舒適面料\r\n\r\n戴上這款經典adidas棒球帽，為你的造型添上“點睛一筆”。採用棉質斜紋布面料打造，質感舒適。立體的刺繡LOGO，展現學院風氣質。帽檐採用弧形設計，力求為你遮擋陽光。', '1707115615.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 14:46:00', 1),
(83, '全天候棒球帽', 759, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '- 單一尺寸\r\n- 100% 再生聚酯平紋布\r\n- RAIN.RDY\r\n- 一體成型帽簷\r\n- 反光細節\r\n- 六分割結構\r\n- 背面可調式設計\r\n\r\n在雨中跑步的感覺超棒。這款 adidas RAIN.RDY 帽款採用先進科技，可排除頭部的雨水，讓你在潮濕環境保持專注。採用棒球風六分割結構，搭配一體成型帽簷，反光細節則在光線昏暗處提升能見度。', '1707116480.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:01:00', 1),
(84, 'LOGO 運動帽', 600, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '- 100% 棉質斜紋布\r\n- 一體成型帽簷\r\n- 背面可調式設計\r\n\r\n想要打造極簡造型？這款 adidas 棒球帽就是正解。採用純棉斜紋布製成，質感柔軟舒適，適合全天候佩戴。可調式後側束帶可自行調整貼合度。一體成型帽簷讓你隨時蓄勢待發。', '1707116597.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:03:00', 1),
(85, '燈芯絨棒球帽', 800, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '- 100% 棉質燈芯絨\r\n- 一體成型帽簷\r\n- 背面可調式設計\r\n\r\n這款 adidas 帽子充滿懷舊風格，無論你來自哪個世代，都能輕鬆駕馭。採用棉質燈芯絨製成，搭配可調式後側束帶，可自行調整貼合度，忠於 90 年代風格。帽簷採弧型設計，隨時蓄勢待發。', '1707116684.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:04:00', 1),
(86, '硬式棒球打擊頭盔', 1500, '帽子', '打擊頭盔', 'BRETT', '黑,紅,藍', 'S,M,L', '高性能ABS塑料外殼\r\n戰略通風系統\r\n衝擊吸收發泡緩衝襯墊\r\n擴大顴骨及腦幹覆蓋範圍\r\n面罩/下顎護罩預裝孔位', '1707116912.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:08:00', 1),
(87, '職業級調整式打擊頭盔', 1500, '帽子', '打擊頭盔', 'BRETT', '紅', 'S,M,L', '可調式頭圍', '1707116996.jpg', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:09:00', 1),
(88, 'GLADIATOR美式打擊頭盔', 1260, '帽子', '打擊頭盔', 'BRETT', '單一顏色', 'S,M,L', '全覆式頭圍鬆緊帶設計', '1707117058.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:10:00', 1),
(89, 'Hello Kitty 聯名款棒球帽', 890, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '- 100% 棉質斜紋布\r\n- 三麗鷗股份有限公司版權所有，2022 年\r\n\r\n這款 adidas 兒童棒球帽讓造型和個人特色閃耀全場。Hello Kitty 和姐妹淘們攜手合作，啟發創意，歡迎日常冒險。俏皮設計搭配 Hello Kitty 的招牌蝴蝶結和 adidas Originals 圖案。材質為柔軟的棉質斜紋布，提供全天候舒適著感，同時兼顧時尚感。', '1707117216.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:13:00', 1),
(90, 'ADICOLOR 棒球帽', 1090, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '- 100% 棉質斜紋布\r\n- 可調式後扣設計\r\n- 石洗處理\r\n- 採用 Better Cotton 材質製成\r\n\r\n這款風格經典的棒球帽可駕馭各種場合，具有招牌 adidas 精神，適合搭配各種造型。經過石洗處理，外觀休閒復古，別出心裁。背面可調式設計，便於隨心調整貼合度。', '1707117329.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:15:00', 1),
(91, '日常棒球帽', 900, '帽子', '球帽', 'adidas', '單一顏色', '均碼', '- 100% 再生聚酯平紋布\r\n- 加厚帽頂\r\n- 一體成型帽簷\r\n- 背面可調式設計\r\n\r\n這款 adidas 帽子讓人百戴不厭，無論是為球隊加油或在陽光下放鬆都合適。質感輕盈低調，可搭配所有單品。配有加厚帽頂和吸濕排汗內緣，讓你在戶外長時間保持舒適。背面配有可調式束帶，便於自行調整貼合度。', '1707117446.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:17:00', 1),
(92, 'Isochill Armourvent 棒球帽', 980, '帽子', '球帽', 'UNDERARMOUR', '單一顏色', '均碼', '- ArmourVent? 網布鑲面，輕量、彈性且耐用，並給予極佳的透氣度與快乾\r\n- 吸濕排汗面料，快乾不悶濕\r\n- Iso-Chill 吸汗帶有助於驅散身體熱量，帶來涼爽體驗\r\n- 可調式背帶\r\n- 54%尼龍/31%聚脂纖維/15%彈性纖維', '1707117736.jfif', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:22:00', 1),
(93, 'Curry X Bruce Lee 後扣棒球帽', 1380, '帽子', '球帽', 'UNDERARMOUR', '單一顏色', '均碼', 'UA Storm科技除了防潑水之外且具有透氣性\r\n輕量的彈性平織面料，提供良好的耐用性與舒適感\r\n可調式後扣設計\r\nUA Siro 吸汗帶提供更佳的彈性和恢復性、柔軟的手感和更透氣的表現\r\n刺繡標誌\r\nUA Classic Fit：曲簷遮陽帽構造，正面結構化設計幫助定型，以低調的貼合度維持形狀', '1707117831.webp', '', '', '', '', 'sizehat.jpg', '2024-02-05 15:23:00', 1),
(94, '【TeamJoined】會員聯名球衣款紀念棒球', 350, '球', '硬式', '統一獅', '單一顏色', '均碼', '集結6家質感品牌來場華麗的聯名\r\n將年度會員球衣樣式印製在球身上極具收藏意義\r\n\r\n材質：PVC\r\n尺寸:  直徑7cm', '1707118063.jpeg', '', '', '', '', 'bal.JPG', '2024-02-05 15:27:00', 1),
(95, '快速壘球 (12入裝)', 4560, '球', '硬式', 'MIZUNO', '單一顏色', '均碼', '材質: 合成皮革\r\n特性: \r\n※軟木球心\r\n※比賽球\r\n\r\n產地: 台灣', '1707118349.jpg', '', '', '', '', 'bal.JPG', '2024-02-05 15:32:00', 1),
(96, '棒球 (12入裝)', 3360, '球', '硬式', 'MIZUNO', '單一顏色', '均碼', '材質: 天然皮革\r\n產地: 中國', '1707118424.jpg', '1707118424red.jpg', '1707118424green.jpg', '1707118424blue.jpg', '1707118424yellow.jpg', 'bal.JPG', '2024-02-05 15:33:00', 1),
(97, 'MIZUNO 美津濃 紅線 硬式 棒球 練習用', 160, '球', '硬式', 'MIZUNO', '單一顏色', '均碼', '型號 :1BJBH44600\r\n\r\n顏色 : (如圖示)\r\n\r\n材質 : 人工皮革\r\n\r\n特色 : 硬度一級棒,穩定性高不易變形\r\n\r\n表皮防水，不適用發球機。\r\n\r\n此款為人工皮革製成之棒球不變形耐打', '1707119020.jpg', '', '', '', '', 'bal.JPG', '2024-02-05 15:43:00', 1),
(98, 'Louisville Slugger TPX 壘球 比賽專用球', 170, '球', '硬式', 'LouisvilleSlugger', '單一顏色', '均碼', '尺寸 : 一般壘球尺寸\r\n\r\n顏色 : (如圖示)\r\n\r\n材質 : 牛皮.PU.二榔皮材質等', '1707119218.jpg', '', '', '', '', 'bal.JPG', '2024-02-05 15:46:00', 1),
(99, '標準比賽用球 (12顆)', 2835, '球', '硬式', 'BRETT', '單一顏色', '均碼', '單位：12顆 / 盒 \r\n型號：S4101 \r\n顏色：白色 \r\n規格：約直徑7.2cm \r\n材質：聚氯乙烯、軟木、人造纖維 \r\n特色： 球心採用標準工序，將整塊軟木刨切而成，耐用度高，可吸收打擊時的衝擊力 一般市售多以木屑加壓黏合製成，打擊2、30次即碎裂，耐用度差', '1707119385.jfif', '', '', '', '', 'bal.JPG', '2024-02-05 15:49:00', 1),
(100, 'M BALL 專用球 (12顆)', 1700, '球', '軟式', 'BRETT', '單一顏色', '均碼', '型號：EXP-M\r\n材質：橡膠\r\n直徑：72±0.5mm\r\n重量：138±1g\r\n反彈高度：80±10cm', '1707119473.jfif', '', '', '', '', 'bal.JPG', '2024-02-05 15:51:00', 1),
(101, '棒球打擊練習球', 1260, '球', '軟式', 'BRETT', '單一顏色', '均碼', '型號：BB-P1\r\n材質：橡膠\r\n規格：9” / 5oz', '1707119632.jfif', '', '', '', '', 'bal.JPG', '2024-02-05 15:53:00', 1),
(102, '投擲訓練用扁平球', 450, '球', '硬式', 'BRETT', '單一顏色', '均碼', '型號：AC-31\r\n規格：9\" / 5oz', '1707120334.jfif', '', '', '', '', 'bal.JPG', '2024-02-05 16:05:00', 1),
(103, '職業用運動七分袖緊身衣', 1240, '球衣', '長袖', 'BRETT', '單一顏色', 'S,M,L,XL', '- 肌肉機能縫線\r\n- 四面彈性涼感布\r\n- 吸溼快乾', '1707122123.jfif', '', '', '', '', 'sizecloths.jpg', '2024-02-05 16:35:00', 1),
(104, '冬季保暖長袖運動緊身衣', 1575, '球衣', '長袖', 'BRETT', '單一顏色', 'S,M,L,XL', '型號：T-980\r\n材質：聚酯纖維\r\n內裏刷毛', '1707122215.jfif', '', '', '', '', 'sizecloths.jpg', '2024-02-05 16:36:00', 1),
(105, '防護型滑壘褲', 935, '球褲', '短褲', 'BRETT', '單一顏色', 'M,L,XL', '型號：BP-SP11\r\n材質：聚酯纖維\r\n規格：M~XL\r\n訂價：935\r\n備註：可裝護檔蓋', '1707122288.jfif', '', '', '', '', 'pant.JPG', '2024-02-05 16:38:00', 1),
(106, '全色長筒運動襪', 200, '襪子', '長筒', 'BRETT', '黑,白,紅,藍,綠', '均碼', '型號：SO-00\r\n材質：85%棉 / 8%聚酯纖維 / 4%彈性纖維 / 3%橡膠絲', '1707122396.jfif', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 16:39:00', 1),
(107, 'GLADIATOR運動後背包', 3025, '裝備', '裝備袋', 'BRETT', '單一顏色', '均碼', '寬敞的主隔層\r\n兩側球棒帶袋\r\n獨立頭盔透氣收納室設計\r\n分離式鞋袋\r\n\"J \"型吊環及魔鬼氈條設計\r\n技術塗層背包表面，提升耐候性與抗水性\r\n多功能柔軟內襯隔層，適合各種運動等用途\r\n前置貴重物品袋\r\n人體工學加襯可調節肩帶\r\n發泡加襯背板', '1707122485.jpg', '', '', '', '', 'bag1.JPG', '2024-02-05 16:41:00', 1),
(108, 'GLADIATOR亮皮捕手裝備袋', 2000, '裝備', '裝備袋', 'BRETT', '單一顏色', '均碼', '型號：B-B02\r\n材質：亮皮\r\n規格：84cm X 36cm X 36cm', '1707122528.jfif', '', '', '', '', 'bag1.JPG', '2024-02-05 16:42:00', 1),
(109, '雙側袋遠征裝備袋', 1890, '裝備', '裝備袋', 'BRETT', '單一顏色', '均碼', '型號：SD-00047\r\n材質：亮皮\r\n規格：60cm X 35cm X 28cm', '1707122595.jfif', '', '', '', '', 'bag1.JPG', '2024-02-05 16:43:00', 1),
(110, '打擊護脛', 630, '護具', '打擊護具', 'BRETT', '單一顏色', '均碼', '型號：EQP-9/01\r\n材質：ABS', '1707123129.jfif', '', '', '', '', 'size.jpg', '2024-02-05 16:52:00', 1),
(111, '職業級GLADIATOR成人用捕手護胸', 2310, '護具', '捕手護具', 'BRETT', '紅', '均碼', '型號：LBP-302\r\n材質：發泡棉\r\n\r\n一體成型16mmPU發泡棉\r\n萊卡布表面\r\n背面為透氣孔\r\n鐵扣穿戴增強耐用性', '1707123306.jfif', '1707123306red.jpg', '1707123306green.jpg', '1707123306blue.jpg', '1707123306yellow.jpg', 'size.jpg', '2024-02-05 16:55:00', 1),
(112, '職業級GLADIATOR成人用捕手護膝', 2940, '護具', '捕手護具', 'BRETT', '紅', '均碼', '型號：LG-332\r\n材質：ABS膠殼\r\n\r\n膝蓋處氣墊式設計衝擊防護\r\nABS外殼\r\n三明治透氣網布\r\n快拆式鐵扣穿戴增強耐用性', '1707123380.jpg', '', '', '', '', 'size.jpg', '2024-02-05 16:56:00', 1),
(113, 'GLADIATOR訓練運動衫', 820, '球衣', '短袖', 'BRETT', '單一顏色', 'L,XL', '型號：GB-TS103\r\n材質：聚酯纖維', '1707123507.jfif', '', '', '', '', 'sizecloths.jpg', '2024-02-05 16:58:00', 1),
(114, '運動長袖緊身衣', 890, '球衣', '長袖', 'BRETT', '單一顏色', 'S,M,L,XL', '型號：T-909\r\n材質：聚酯纖維', '1707123855.jpg', '', '', '', '', 'sizecloths.jpg', '2024-02-05 17:04:00', 1),
(115, '職業用運動緊身長褲', 1280, '球褲', '長褲', 'BRETT', '單一顏色', 'S,M,L,XL', '型號：BP-SP13\r\n材質：聚酯纖維', '1707123938.jfif', '', '', '', '', 'pant.JPG', '2024-02-05 17:05:00', 1),
(116, '超輕量成人用捕手面罩', 1680, '護具', '捕手護具', 'BRETT', '單一顏色', '均碼', '型號：B-M01\r\n材質：中空鋼\r\n規格：W28*H29cm', '1707124046.jpg', '', '', '', '', 'size.jpg', '2024-02-05 17:07:00', 1),
(117, '全罩式成人用捕手頭盔', 3480, '護具', '捕手護具', 'BRETT', '單一顏色', '均碼', '型號：B-CH06\r\n材質：ABS/鐵\r\n規格：成人用\r\n\r\n附臉頰側調整泡棉片\r\n經濟部標準檢驗局檢驗合格', '1707125122.jpg', '', '', '', '', 'size.jpg', '2024-02-05 17:25:00', 1),
(118, '流線型調整式捕手頭盔', 1260, '護具', '捕手護具', 'BRETT', '單一顏色', '均碼', '型號：CH-02/01\r\n材質：ABS\r\n- 可調式頭圍 -', '1707129961.jfif', '', '', '', '', 'size.jpg', '2024-02-05 18:46:00', 1),
(119, 'GB5輕量型打擊護肘', 630, '護具', '打擊護具', 'BRETT', '黑,紅,藍', '均碼', '型號：EQP-1', '1707130174.jpg', '', '', '', '', 'size.jpg', '2024-02-05 18:49:00', 1),
(120, 'BRETT 雙手羊皮打擊手套', 895, '手套', '打擊手套', 'BRETT', '單一顏色', 'S,M,L', '型號：B-G-56\r\n備註：雙手用', '1707130249.jfif', '', '', '', '', 'sizehands.jpg', '2024-02-05 18:50:00', 1),
(121, 'GB5 雙手羊皮打擊手套', 1310, '手套', '打擊手套', 'BRETT', '單一顏色', 'S,M,L,XL', '型號：B-G-60\r\n備註：雙手用共三色\r\n\r\nPittards皮塔士細柔羊皮材質\r\n無車縫鑽面掌心透氣不乾硬\r\n墊片加層補強止滑減振提升耐用性\r\n指間透氣孔保持手部乾燥\r\n指關節3D彈性透氣萊卡布保持手指靈活度\r\n寬版黏扣腕帶能緊固手腕避免傷害\r\n40mm山形腕口方便迅速穿戴', '1707130345.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 18:52:00', 1),
(122, '硬式和牛皮棒球手套', 7875, '手套', '左手', 'BRETT', '單一顏色', '均碼', '型號：GB-HO20-CM\r\n材質：和牛皮\r\n規格：捕手用', '1707130481.jfif', '', '', '', '', 'sizehands.jpg', '2024-02-05 18:54:00', 1),
(123, 'GB5系列硬式棒球手套', 5540, '手套', '左手', 'BRETT', '單一顏色', '均碼', '型號：GB-17-1250/109\r\n材質：牛皮\r\n規格：12.5\"', '1707130540.jfif', '', '', '', '', 'sizehands.jpg', '2024-02-05 18:55:00', 1),
(124, '即戰型棒球手套', 1980, '手套', '左手', 'BRETT', '單一顏色', '均碼', '型號：JP-24-115\r\n\r\n材質：聚氨酯/牛皮 \r\n\r\n尺寸：11.5\"', '1707130636.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 18:57:00', 1),
(125, '頂級藍標棒球手套 11.5吋', 4500, '手套', '左手', 'BRETT', '單一顏色', '均碼', '型號：GB-BL-115\r\n\r\n材質：硬式牛皮\r\n\r\n尺寸：11.5\"', '1707130717.jfif', '', '', '', '', 'sizehands.jpg', '2024-02-05 18:58:00', 1),
(126, '硬式和牛皮棒球手套', 7875, '手套', '左手', 'BRETT', '單一顏色', '均碼', '型號：GB-HO20-1126\r\n材質：和牛皮\r\n規格：12.75\"', '1707131166.jpg', '', '', '', '', 'sizehands.jpg', '2024-02-05 19:06:00', 1),
(127, '亮皮六支裝球棒袋', 1365, '裝備', '球具袋', 'BRETT', '單一顏色', '均碼', '型號：SP-PRO060\r\n材質：亮皮\r\n規格：90cm X 24cm X 24cm\r\n\r\n可裝六支棒球棒', '1707131309.jfif', '', '', '', '', 'bag1.JPG', '2024-02-05 19:08:00', 1),
(128, '可坐式硬殼置球袋', 1890, '裝備', '球袋', 'BRETT', '單一顏色', '均碼', '型號：SD-00067\r\n材質：尼龍/塑膠\r\n規格：90cm X 35cm X 35cm\r\n\r\n可裝五打棒球/三打壘球\r\n硬殼內裏不變型\r\n可當椅子坐', '1707131395.jfif', '', '', '', '', 'bag1.JPG', '2024-02-05 19:09:00', 1),
(129, '三支裝球棒袋', 580, '裝備', '球具袋', 'BRETT', '單一顏色', '均碼', '型號：SP-00055\r\n材質：聚酯纖維\r\n規格：38” X 12”\r\n\r\n可裝三支棒球棒或四支壘球棒', '1707131446.jfif', '', '', '', '', 'bag1.JPG', '2024-02-05 19:10:00', 1),
(130, 'MP棒球褲', 2580, '球褲', '長褲', 'MIZUNO', '單一顏色', 'S,M,L,XL', '材質: 聚酯纖維87%、彈性纖維13%\r\n特性: \r\n※腳背背號窗：方便選手寫背號\r\n※90度腳跟設計、襪身鬆緊強化\r\n※全腳底舒適毛巾組織\r\n※襪頭與跟部耐磨強化', '1707131689.jpg', '', '', '', '', 'pant.JPG', '2024-02-05 19:14:00', 1),
(131, '長統彩色棒壘襪(6雙/1袋)', 2100, '襪子', '長筒', 'MIZUNO', '單一顏色', '均碼', '材質 : 棉28% 彈性纖維37% 尼龍35%\r\n特性 : \r\n※腳背背號窗：方便選手寫背號\r\n※90度腳跟設計、襪身鬆緊強化\r\n※全腳底舒適毛巾組織\r\n※襪頭與跟部耐磨強化', '1707132114.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 19:21:00', 1),
(132, '長統棒壘襪(6雙/1袋)', 1680, '襪子', '長筒', 'MIZUNO', '單一顏色', '均碼', '材質 : 精梳棉72% 尼龍25% 橡膠2%彈性纖維1%\r\n特性 : \r\n※全方位強化鬆緊:腳背,足弓&腳踝\r\n※背號窗:方便選手寫背號\r\n※90度腳跟設計,\r\n※90度腳跟設計,', '1707132184.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-02-05 19:23:00', 1),
(133, 'asics 亞瑟士 3121A349-601 日本進口 棒壘 打擊手套', 750, '手套', '打擊手套', 'ASICS', '黑', 'S,M,L,XL', '材質 : 手心-合成皮革 手背-合成皮革  \r\n特色 : 包覆緊身剪裁設計，具有高度舒適感，適用於各種手型的最佳利器。\r\n服貼性採用雙向透氣彈性布，手部更服貼握把力指部特殊剪裁設計，提升握把力& 擊球舒適感手感佳掌面採用高級質感防水透氣在手掌彎曲位置採用彈性材質，提供自然的抓握力。 \r\n指部採用特殊剪裁設計提升握把力及擊球的舒適感覺 增加掌面補強素材且外型酷炫超級屌\r\n', '132.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:31:00', 1),
(134, '日本製 NIKE 謝道 SHADO ELITE J 硬式最高階 內野手套', 3499, '手套', '左手', 'NIKE', '紅', 'S,M,L,XL', '日本製 NIKE 謝道 SHADO ELITE J 硬式最高階 內野手套\nNIKE 於美國市場限定發售的『日本製 謝道』ELITE J 硬式手套，皮革質地綿密，手感紮實服貼，\n值得入手蒐藏品味或實戰使用！  \n*限量發售 150 個  \n產品特點：  \n1. 顏色：棕色  \n2. 尺寸：11.75吋  \n3. 重量：560克  \n4. 款式：內野 (硬式)  \n5. 材質：高階牛革  \n6. 產地：日本', '800x.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:39:00', 1),
(135, '日本製 ASICS 亞瑟士 GOLD STAGE i-Pro 大A標 硬式最高階 外野手套', 5555, '手套', '右手', 'ASICS', '紅', 'S,M,L,XL', '日本製 ASICS 亞瑟士 GOLD STAGE i-Pro 硬式最高階 外野手套\n亞瑟士新款 i-Pro 頂級系列，雙夾條紮實度佳，整體球袋深度夠！\n*小指二本入機能，可退指使用。\n產品特點：\n1. 顏色：紅棕\n2. 尺寸：12.6吋\n3. 重量：630克\n4. 款式：外野 (硬式)\n5. 材質：JAPAN-HEART Leather 和牛革\n6. 產地：日本', '135.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:47:00', 1),
(136, '日本製 NIKE 謝道 SHADO ELITE J 硬式最高階 內野手套', 4444, '手套', '左手', 'NIKE', '藍', 'S,M,L,XL', '日本製 NIKE 謝道 SHADO ELITE J 硬式最高階 內野手套\nNIKE 於美國市場限定發售的『日本製 謝道』ELITE J 硬式手套，\n皮革質地綿密，手感紮實服貼，值得入手蒐藏品味或實戰使用！\n*限量發售 150 個\n產品特點：\n1. 顏色：奶油 x 天藍\n2. 尺寸：11.75吋\n3. 重量：560克\n4. 款式：內野 (硬式)\n5. 材質：高階牛革\n6. 產地：日本', '136.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:48:00', 1),
(137, '日本製 NIKE 謝道 SHADO ELITE J 硬式最高階 內野手套', 2999, '手套', '右手', 'NIKE', '黃', 'S,M,L,XL', '日本製 NIKE 謝道 SHADO ELITE J 硬式最高階 內野手套\nNIKE 於美國市場限定發售的『日本製 謝道』ELITE J 硬式手套，\n皮革質地綿密，手感紮實服貼，值得入手蒐藏品味或實戰使用！\n產品特點：\n1. 顏色：黃色\n2. 尺寸：11.5吋\n3. 重量：560克\n4. 款式：內野 (硬式)\n5. 材質：高階牛革\n6. 產地：日本', '137.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:49:00', 1),
(138, '日本製 NIKE DAISUKE 松?大輔 大聯盟紅襪 2012 球季 支給品 實使用 親筆簽名 硬', 6666, '手套', '左手', 'NIKE', '黑', 'M,L,XL', '日本製 NIKE DAISUKE 松?大輔 大聯盟紅襪 2012 球季 支給品 實使用 親筆簽名 硬式投手手套\n產品特點：\n1. 顏色：黑色\n2. 尺寸：12吋\n3. 重量：590克\n4. 款式：投手 (硬式)\n5. 材質：天然皮革\n6. 產地：日本', '138.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:50:00', 1),
(139, '日本製 NIKE DIAMOND ELITE PLUS 克系列 硬式內野手套', 3999, '手套', '右手', 'NIKE', '黑', 'L,XL', '日本製 NIKE DIAMOND ELITE PLUS 克系列 硬式內野手套\n目前已不多見的日本製 NIKE DIAMOND PLUS 硬式系列，手感紮實服貼！\n產品特點：\n1. 顏色：黑色\n2. 尺寸：11.2吋\n3. 重量：520克\n4. 款式：內野 (硬式)\n5. 材質：Alpha Plus Kips 小牛革\n6. 產地：日本', '139.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:51:00', 1),
(140, '日本製 NIKE DIAMOND HEROES JAPAN 硬式內野手套', 2999, '手套', '左手', 'NIKE', '橘', 'M,L', '日本製 NIKE DIAMOND HEROES JAPAN 硬式內野手套\n目前已不多見的日本製 NIKE HEROES 硬式系列，手感紮實服貼！\n產品特點：\n1. 顏色：橘色\n2. 尺寸：12吋\n3. 重量：530克\n4. 款式：內野 (硬式)\n5. 材質：State-of Art Steer Plus Leather\n6. 產地：日本', '140.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:52:00', 1),
(141, '日本製 NIKE SIGNATURE MODEL 7 松井稼頭央 K.Matsui 日職支給 硬式內', 5999, '手套', '右手', 'NIKE', '橘', 'M,L', '日本製 NIKE SIGNATURE MODEL 7 松井稼頭央 K.Matsui 日職支給 硬式內野手套\n日本職棒球員『松井稼頭央』支給用手套，職棒球員專屬鋼印，具蒐藏價值！\n產品特點：\n1. 顏色：橘色\n2. 尺寸：11.75吋\n3. 重量：530克\n4. 款式：內野 (硬式)\n5. 材質：天然皮革\n6. 產地：日本', '141.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:53:00', 1),
(142, '日本製 ASICS 亞瑟士 GOLD STAGE 大A標 硬式最高階 內野手套', 3999, '手套', '左手', 'ASICS', '黑', 'S,M,L', '日本製 ASICS 亞瑟士 GOLD STAGE 硬式最高階 內野手套\n亞瑟士內野系列大A標，紮實度佳！\n產品特點：\n1. 顏色：黑色\n2. 尺寸：11.6吋\n3. 重量：540克\n4. 款式：內野 (硬式)\n5. 材質：JAPAN-HEART Leather 高階牛革\n6. 產地：日本', '142.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:54:00', 1),
(143, '日本進口 ASICS 亞瑟士 GOLD STAGE ZERO 大A金標 硬式最高階 投手手套', 5999, '手套', '左手', 'ASICS', '紅', 'S,M', '日本進口 ASICS 亞瑟士 GOLD STAGE 硬式最高階 投手手套\n亞瑟士硬式最高階 ZERO 系列，大A斜標，穿戴手感佳，重量輕好操控的日本手套。\n產品特點：\n1. 顏色：紅棕\n2. 尺寸：12吋\n3. 重量：540克\n4. 款式：投手 (硬式)\n5. 材質：GS. GRAND-Leather 高階牛革\n6. 產地：菲律賓', '143.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:55:00', 1),
(144, '日本製 ASICS 亞瑟士 GOLD STAGE i-Pro 大A標 硬式最高階 外野手套 小指二本', 5000, '手套', '右手', 'ASICS', '紅', 'S,M,L', '日本製 ASICS 亞瑟士 GOLD STAGE i-Pro 硬式最高階 外野手套\n亞瑟士新款 i-Pro 頂級系列，雙夾條紮實度佳，整體球袋深度夠！\n*小指二本入機能，可退指使用。\n產品特點：\n1. 顏色：紅棕\n2. 尺寸：12.6吋\n3. 重量：630克\n4. 款式：外野 (硬式)\n5. 材質：JAPAN-HEART Leather 和牛革\n6. 產地：日本', '144.webp', '', '', '', '', 'sizehands.jpg', '2024-05-09 15:59:00', 1),
(145, '日本製 UNDER ARMOUR MLB 紅襪隊 吉田正尚 球員版 硬式外野手套', 6000, '手套', '右手', 'UNDER ARMOUR', '黑', 'S,M', '日本製 UNDER ARMOUR MLB 紅襪隊 吉田正尚 球員版 硬式外野手套\n目前效力於 MLB 紅襪隊『吉田正尚』球員版手套，\n拇指吉田專屬背號圖騰刺繡、內裏『頂』漢字刺繡 & 食指 UA Logo 刺繡，\n非一般市售版手套，極為稀有並具蒐藏價值的頂級逸品。\n產品特點：\n1. 顏色：深藍\n2. 尺寸：12.7吋\n3. 重量：610克\n4. 款式：外野 (硬式)\n5. 材質：天然皮革\n6. 產地：日本', '145.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 15:59:00', 1),
(146, '日本製 UNDER ARMOUR (UA) 硬式最高階 反手 投手手套 左投', 8000, '手套', '左手', 'UNDER ARMOUR', '紅', 'S,M,L', '日本製 UNDER ARMOUR 硬式最高階 反手 投手手套\n日本限定款 UNDER ARMOUR 日製頂級硬式手套，\n皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！\n產品特點：\n1. 顏色：紅色\n2. 尺寸：12.25吋\n3. 重量：565克\n4. 款式：投手 (反手硬式)\n5. 材質：天然皮革 (牛皮)\n6. 產地：日本', '146.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 15:58:00', 1),
(147, '日本製 UNDER ARMOUR (UA) 硬式最高階 T字球擋 反手 外野手套 棒球手套 壘球手套', 7000, '手套', '左手', 'UNDER ARMOUR', '紅', 'S,M,L', '日本製 UNDER ARMOUR 硬式最高階 反手 外野手套\n日本限定款 UNDER ARMOUR 日製頂級硬式手套，\n皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！\n產品特點：\n1. 顏色：紅色\n2. 尺寸：13吋\n3. 重量：620克\n4. 款式：外野 (反手硬式)\n5. 材質：天然皮革\n6. 產地：日本', '147.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 16:58:00', 1),
(148, '日本製 UNDER ARMOUR (UA) 硬式最高階 工字球擋 QBB0239 內野手套', 5999, '手套', '左手', 'UNDER ARMOUR', '橘', 'M,L', '日本製 UNDER ARMOUR 硬式最高階 工字球擋 QBB0239 內野手套\n日本限定款 UNDER ARMOUR 日製硬式內野手套，\n皮面非常紮實漂亮，搭配 UA 立體刺繡手口標，極致經典！\n*早期的 UA 日本製 QBB 系列，目前全新品已稀有難尋。\n產品特點：\n1. 顏色：橘色\n2. 尺寸：11.75吋\n3. 重量：570克\n4. 款式：內野 (硬式)\n5. 材質：天然皮革\n6. 產地：日本', '148.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 16:59:00', 1),
(149, '日本製 UNDER ARMOUR (UA) 硬式最高階 投手手套 棒球手套 壘球手套', 4999, '手套', '左手', 'UNDER ARMOUR', '紅', 'M,L,XL', '日本製 UNDER ARMOUR 硬式最高階 投手手套\n日本限定款 UNDER ARMOUR 日製頂級硬式手套，\n皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！\n產品特點：\n1. 顏色：紅色\n2. 尺寸：12吋\n3. 重量：580克\n4. 款式：投手 (硬式)\n5. 材質：天然皮革\n6. 產地：日本 (日本進口)', '149.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 17:51:00', 1),
(150, '日本製 UNDER ARMOUR (UA) 硬式最高階 T字球擋 外野手套 棒球手套 壘球手套', 8999, '手套', '右手', 'UNDER ARMOUR', '紅', 'M,L', '日本製 UNDER ARMOUR 硬式最高階 外野手套\n日本限定款 UNDER ARMOUR 日製硬式外野手套，\n皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！\n產品特點：\n1. 顏色：紅色\n2. 尺寸：13吋\n3. 重量：620克\n4. 款式：外野 (硬式)\n5. 材質：天然皮革 (牛皮)\n6. 產地：日本', '150.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 17:52:00', 1),
(151, '日本製 UNDER ARMOUR (UA) 金子千尋 硬式最高階 投手手套 棒球手套 壘球手套', 8000, '手套', '右手', 'UNDER ARMOUR', '紅', 'M,L', '日本製 UNDER ARMOUR 金子千尋 硬式最高階 投手手套\n日本限定款 UNDER ARMOUR 日製頂級硬式手套，\n皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！\n產品特點：\n1. 顏色：紅色\n2. 尺寸：12吋\n3. 重量：580克\n4. 款式：投手 (硬式)\n5. 材質：天然皮革\n6. 產地：日本', '151.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 17:52:00', 1),
(152, '日本製 UNDER ARMOUR (UA) 硬式最高階 傳統十字球擋 內野手套 棒球手套 壘球手套', 7000, '手套', '右手', 'UNDER ARMOUR', '紅', 'M,L,XL', '日本製 UNDER ARMOUR 硬式最高階 內野手套\n日本限定款 UNDER ARMOUR 日製硬式內野手套，\n皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！\n產品特點：\n1. 顏色：紅色\n2. 尺寸：12吋\n3. 重量：530克\n4. 款式：內野 (硬式)\n5. 材質：天然皮革 (牛皮)\n6. 產地：日本', '152.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 17:53:00', 1),
(153, '美國進口 New Balance 大谷翔平 球員版 硬式投手手套 超夢幻蒐藏逸品', 10000, '手套', '右手', 'New Balance', '橘', 'M', '美國進口 New Balance 大谷翔平 球員版 硬式投手手套 超夢幻蒐藏逸品\n美國限定發售的 New Balance 大谷翔平球員版手套，也是目前 New Balance 大谷翔平的首款手套，\n小指背號 17 刺繡、拇指 NB Logo、手口 NB 球鞋刺繡，低調奢華又特別的 MVP 明星級選擇，同時也極具蒐藏價值。\n產品特點：\n1. 顏色：原皮 x 黑色\n2. 尺寸：12.75吋\n3. 重量：660克\n4. 款式：投手 (硬式)\n5. 材質：高階牛革\n6. 產地：日本', '153.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 17:53:00', 1),
(154, 'FILA 素色經典六片帽/棒球帽', 900, '帽子', '球帽', 'FILA', '藍', 'M', '◆  單一尺寸\n◆ 50%縲縈/50%羊毛\n◆ 一體成型帽簷\n◆ 後側黏扣帶設計\n◆ 電繡細節\n◆ 六分割結構', '154.jpg', '', '', '', '', 'sizehat.jpg', '2024-05-10 17:53:00', 1),
(155, 'New Balance NB L4040TB5 2E 寬 棒壘球鞋 鐵釘', 2990, '球鞋', '釘鞋', 'New Balance', '藍', '24,25,26,27,28,29,30,31', '材質：輕量透氣網布 TPU 棒球專用大底 Fresh Foam 一體成型中大底\n特色 : 採根據實驗數據設計之360度鞋釘配置。FANTOM FIT加強鞋面貼合及包覆性。拇指球部位PRO MOTION 提供更順暢的足部推進力，REVLITE 輕量EVA 中底提升回彈力。\n外底TPU 擁有絕佳的自然曲折度。\n高級材質製造  鞋面防潑水  鞋底穿著柔軟舒適透氣 鞋底採避震彈性設計可有效保護腳部 彈性佳可增加靈活性 在世界上最知名的品牌之一，new balance繼續成為領先的鞋業品牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。\nnew balance 棒壘球鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。\n外底與防滑板配置環境優選橡膠。\n可提供更多的表面與地面接觸的。\n給你一個全方位的運動  整體設計不同於市場棒壘球鞋設計兼具功能與造型超強', '155.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-05-10 17:54:00', 1),
(156, '日本製 EASTON KUBOTA KSG-L7 硬式最高階 內野手套', 1000, '手套', '右手', 'EASTON', '橘', 'M,L,XL', '日本製 EASTON KUBOTA KSG-L7 硬式最高階 內野手套\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n萬年經典款松井稼頭央仕樣，久保田的紮實做工及絕佳手感，內野首選！\n產品特點：\n1. 顏色：橘色\n2. 尺寸：11.9吋\n3. 重量：570克\n4. 款式：內野 (硬式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本', '156.webp', '', '', '', '', 'sizehands.jpg', '2024-05-10 17:56:00', 1),
(157, '日本製 EASTON KUBOTA KSG-BR2 硬式最高階 內野手套', 2000, '手套', '右手', 'EASTON', '橘', 'M,L,XL', '日本製 EASTON KUBOTA KSG-BR2 硬式內野手套\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n*開指設計 / 掌根逆穿芯\n產品特點：\n1. 顏色：橘色\n2. 尺寸：11.8吋\n3. 重量：560克\n4. 款式：內野 (硬式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本', '157.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 17:56:00', 1),
(158, '日本製 EASTON KUBOTA KSG-M00 鳥谷敬 引退記念手套 職業球員限定鋼印 硬式內野', 999, '手套', '左手', 'EASTON', '橘', 'M,L,XL', '日本製 EASTON KSG-M00 鳥谷敬 引退記念手套 職業球員限定鋼印 硬式內野手套\n鳥谷敬為使用久保田的日職選手中具有代表性的人物之一，此記念手套除了有職業限定鋼印外，\n大拇指側也有鳥谷敬本人仕樣的 ToriTani 金色刺繡，可實戰也可蒐藏的經典手套。\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\n產品特點：\n1. 顏色：棕黃 (如照片)\n2. 尺寸：11.25吋\n3. 重量：570克\n4. 款式：內野 (硬式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛皮\n6. 產地：日本 (日本進口)', '158.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 17:57:00', 1),
(159, '日本製  EASTON  KUBOTA KSG-SPL 硬式最高階 外野手套', 1000, '手套', '右手', 'EASTON', '橘', 'M,L,XL', '日本製 久保田 SLUGGER KUBOTA KSG-SPL 硬式外野手套\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\nSPL 為中型外野手套，尺寸約 12.4 英吋，操控性比一般大型外野更佳。\n產品特點：\n1. 顏色：橘色\n2. 尺寸：12.4吋\n3. 重量：680克\n4. 款式：外野 (硬式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本', '159.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 17:58:00', 1),
(160, '日本製 EASTON PRO ORDER 大M金標 礒部公一 硬式最高階 外野手套', 5555, '手套', '左手', 'EASTON', '黃', 'M,L,XL', '日本製 美津濃 MIZUNO PRO ORDER 大M金標 礒部公一 硬式最高階 外野手套\n目前市面上已絕版難尋的 MIZUNO PRO 大M金標硬式最高等級，\n與一般型號的量產手套相比，球員仕樣的大M金標更具蒐藏價值。\n產品特點：\n1. 顏色：黃色\n2. 尺寸：13吋\n3. 重量：630克\n4. 款式：外野 (硬式)\n5. 材質：CREST HIDE SUPREME ELITE\n6. 產地：日本', '160.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 17:59:00', 1),
(161, '日本製 EASTON PRO ORDER 大M金標 Tsuboi 坪井智哉 硬式最高階 外野手套', 3333, '手套', '左手', 'EASTON', '橘', 'M,L,XL', '日本製 EASTON PRO ORDER 大M金標 Tsuboi 坪井智哉 硬式最高階 外野手套\n目前市面上已絕版難尋的 MIZUNO PRO 大M金標硬式最高等級，\n與一般型號的量產手套相比，球員仕樣的大M金標更具蒐藏價值。\n產品特點：\n1. 顏色：棕黑\n2. 尺寸：13吋\n3. 重量：710克\n4. 款式：外野 (硬式)\n5. 材質：North European Kip\n6. 產地：日本', '161.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 17:59:00', 1),
(162, 'New Balance NB PL4040R5 2E 寬 棒壘球鞋 膠釘 紅 特2400', 2222, '球鞋', '釘鞋', 'New Balance', '紅', '24,25,26,27,28,29,30,31', '材質：透氣網布+TPU 棒球專用釘鞋底 Fresh Foam 一體成型中大底\n特色 : 舌特製Lace cage 可收納鞋帶，免去綁鞋帶困擾-Fresh Foam 中底，柔軟舒適-棒球壘球皆適用-12只TPU鞋釘，抓地力加乘-鞋頭TPU 保護裝置，防止腳指衝擊受傷-鞋內襯環繞泡棉，有效包款覆腳後跟在世界上最知名的品牌之一，new balance繼續成為領先的鞋業品牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。\nnew balance 棒壘球鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。\n外底與防滑板配置環境優選橡膠。\n可提供更多的表面與地面接觸的。給你一個全方位的運動  整體設計不同於市場棒壘球鞋設計兼具功能與造型超強', '162.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(163, 'New Balance NB T3000BY5 2E 寬 棒壘球鞋 多功能 裁判 訓練 教練鞋 黑黃', 1111, '球鞋', '釘鞋', 'New Balance', '黃', '24,25,26,27,28,29,30,31', '材質：合成皮 耐磨橡膠 高強度EVA中底 Turf 大底\n特色 : 棒球鞋練習鞋。顆粒型大底，適應不同場地型態。\n高級材質製造鞋面防潑水鞋底穿著柔軟舒適透氣 鞋底採避震彈性設計可有效保護腳部 \n彈性佳可增加靈活性在世界上最知名的品牌之一，new balance繼續成為領先的鞋業品牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。\nnew balance 棒壘球鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。\n外底與防滑板配置環境優選橡膠。可提供更多的表面與地面接觸的。\n給你一個全方位的運動 整體設計不同於市場棒壘球鞋設計兼具功能與造型超強', '163.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(164, 'New Balance NB T3000BY4 2E 寬 棒壘球鞋 多功能 裁判 訓練 教練鞋 黑黃', 1555, '球鞋', '釘鞋', 'New Balance', '黃', '24,25,26,27,28,29,30,31', '材質：合成皮 耐磨橡膠 高強度EVA中底 Turf 大底\n特色 : 棒球鞋練習鞋。顆粒型大底，適應不同場地型態。\n高級材質製造 鞋面防潑水  鞋\n底穿著柔軟舒適透氣 鞋底採避震彈性設計可有效保護腳部 彈性佳可增加靈活性在世界上最\n知名的品牌之一，new balance繼續成為領先的鞋業品牌，部分原因是由於他們推出的新\n能源，盡可能做出最好的鞋。\nnew balance 棒壘球鞋提供了一個時尚，低筒的設計，提供\n一個成型的棒球夾板驚人的牽引。\n外底與防滑板配置環境優選橡膠。\n可提供更多的表面與地面接觸的。\n給你一個全方位的運動  整體設計不同於市場棒壘球鞋設計兼具功能與造型超強', '164.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1);
INSERT INTO `product` (`id`, `name`, `price`, `class`, `other`, `brand`, `color`, `size`, `description`, `image_url`, `red`, `green`, `blue`, `yellow`, `sizepic`, `created_at`, `valid`) VALUES
(165, 'New Balance NB PL4040O5 2E 寬 棒壘球鞋 膠釘 黑橘', 2666, '球鞋', '釘鞋', 'New Balance', '橘', '24,25,26,27,28,29,30,31', '材質：透氣網布+TPU 棒球專用釘鞋底 Fresh Foam 一體成型中大底\n特色 : 舌特製Lace cage 可收納鞋帶，免去綁鞋帶困擾-Fresh Foam 中底，柔軟舒適-棒球壘球皆適用-12只TPU鞋釘，\n抓地力加乘-鞋頭TPU 保護裝置，防止腳指衝擊受傷-鞋\n內襯環繞泡棉，有效包款覆腳後跟在世界上最知名的品牌之一，new balance繼續成為領先\n的鞋業品牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。\nnew balance 棒壘球鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。\n外底與防滑板配置環境優選橡膠。\n可提供更多的表面與地面接觸的。\n給你一個全方位的運動整體設計不同於市場棒壘球鞋設計兼具功能與造型超強', '165.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(166, 'New Balance NB 3000v5 L3000TB5 2E 寬 棒壘球鞋 鐵釘', 5559, '球鞋', '釘鞋', 'New Balance', '藍', '24,25,26,27,28,29,30,31', '材質：輕量透氣網布 TPU 棒球專用大底 Fresh Foam 一體成型中大底\n特色 : 無論您是衝刺到本壘板比賽還是在野外比賽以取得超級英雄成績，Fresh Foam 3000v5男士棒球防滑釘都能為高壓比賽提供所需的牽引力和支撐。 \n網眼鞋面具有舒適的衣領和基於運動數據的反應擴散設計。 \n為了增加舒適度，FRESH FOAM EVA中底確保了最佳的舒適度，即使是進入多餘場地的遊戲也是如此。\n8釘外底在野外提供出色的牽引力 Comfort Collar有助於防止刺激並緊貼踝部，以達到最佳貼合度 FRESH \nFOAM中底減震器經過精心設計，可提供超緩衝，輕便的乘坐體驗鞋舌位於鞋舌上，可在遊戲過程中保護和固定鞋帶 採用基於真實數據的反應擴散設計的低切合成TPU /\n聚二合一網眼鞋面，可增強棒球運動 合成和TPU / Poly組合網狀材料 在世界上最知\n名的品牌之一，new balance繼續成為領先的鞋業品牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。\nnew balance 棒壘球鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。\n外底與防滑板配置環境優選橡膠。可提供更多的表面與地面接觸的。\n給你一個全方位的運動  整體設計不同於市場棒壘球鞋設計兼具功能與造型超強', '166.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(167, 'New Balance NB L4040BO5 2E 寬 棒壘球鞋 鐵釘', 5566, '球鞋', '跑鞋', 'New Balance', '橘', '24,25,26,27,28,29,30,31', '材質：輕量透氣網布 TPU 棒球專用大底 Fresh Foam 一體成型中大底\n特色 : 採根據實驗數據設計之360度鞋釘配置。FANTOM FIT加強鞋面貼合及包覆性。\n拇指球部位PRO MOTION 提供更順暢的足部推進力，REVLITE 輕量EVA 中底提升回彈力。\n外底TPU 擁有絕佳的自然曲折度。高級材質製造  鞋面防潑水  鞋底穿著柔軟舒適透氣鞋底採避震彈性設計可有效保護腳部 \n彈性佳可增加靈活性 在世界上最知名的品牌之一，new balance繼續成為領先的鞋業品牌，\n部分原因是由於他們推出的新能源，盡可能做出最好的鞋。\nnew balance 棒壘球鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。\n外底與防滑板配置環境優選橡膠。可提供更多的表面與地面接觸的。\n給你一個全方位的運動  整體設計不同於市場棒壘球鞋設計兼具功能與造型超強', '167.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(168, 'New Balance NB 3000v5 PL3000R5 2E 寬 棒壘球鞋 膠釘', 6655, '球鞋', '跑鞋', 'New Balance', '紅', '24,25,26,27,28,29,30,31', '材質：透氣網布+TPU 棒球專用釘鞋底 Fresh Foam 一體成型中大底\n特色 : 無論您是衝刺到本壘板比賽還是在野外比賽以取得超級英雄成績，\nFresh Foam 3000v5 TPU男式棒球鞋都可提供高壓比賽所需的牽引力和支撐。網眼鞋面坐在\n成型的TPU板上，具有舒適的衣領和基於運動數據的反應擴散設計。\n為了增加舒適度，FRESH FOAM EVA中底確保了最佳的舒適度，即使是進入多餘場地的遊戲也是如\n此。Comfort Collar有助於防止刺激並緊貼踝部，以達到最佳貼合度FRESH FOAM中\n底減震器經過精心設計，可提供超緩衝，輕便的乘坐體驗鞋舌位於鞋舌上，可在遊戲\n過程中保護和固定鞋帶低切合成網眼鞋面，具有基於真實數據的反應擴散設計，可增\n強棒球運動 合成和TPU / Poly組合網狀材料TPU模壓防滑鞋底在草皮和自然表面上均\n具有出色的附著力在世界上最知名的品牌之一，new balance繼續成為領先的鞋業品\n牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。new balance 棒壘球\n鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。外底與防滑\n板配置環境優選橡膠。可提供更多的表面與地面接觸的。給你一個全方位的運動 整體\n設計不同於市場棒壘球鞋設計兼具功能與造型超強', '168.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(169, 'New Balance NB 3000v5 PL3000K5 2E 寬 棒壘球鞋 膠釘', 2266, '球鞋', '跑鞋', 'New Balance', '黑', '24,25,26,27,28,29,30,31', '材質：透氣網布+TPU 棒球專用釘鞋底 Fresh Foam 一體成型中大底\n特色 : 無論您是衝刺到本壘板比賽還是在野外比賽以取得超級英雄成績，Fresh Foam 3000v5 TPU男式棒球鞋都可提供高壓比賽所需的牽引力和支撐。網眼鞋面坐在\n成型的TPU板上，具有舒適的衣領和基於運動數據的反應擴散設計。為了增加舒適\n度，FRESH FOAM EVA中底確保了最佳的舒適度，即使是進入多餘場地的遊戲也是如\n此。Comfort Collar有助於防止刺激並緊貼踝部，以達到最佳貼合度FRESH FOAM中\n底減震器經過精心設計，可提供超緩衝，輕便的乘坐體驗鞋舌位於鞋舌上，可在遊戲\n過程中保護和固定鞋帶低切合成網眼鞋面，具有基於真實數據的反應擴散設計，可增\n強棒球運動 合成和TPU / Poly組合網狀材料TPU模壓防滑鞋底在草皮和自然表面上均\n具有出色的附著力在世界上最知名的品牌之一，new balance繼續成為領先的鞋業品\n牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。new balance 棒壘球\n鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。外底與防滑\n板配置環境優選橡膠。可提供更多的表面與地面接觸的。給你一個全方位的運動 整體\n設計不同於市場棒壘球鞋設計兼具功能與造型超強', '169.webp', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(170, 'New Balance NB PL4040K6 2E 寬 棒壘球鞋 膠釘 黑白', 4422, '球鞋', '跑鞋', 'New Balance', '黑', '24,25,26,27,28,29,30,31', '材質：透氣網布+TPU 棒球專用釘鞋底 Fresh Foam 一體成型中大底\n特色 : 舌特製Lace cage 可收納鞋帶，免去綁鞋帶困擾-Fresh Foam 中底，\n柔軟舒適-棒球壘球皆適用-12只TPU鞋釘\n，抓地力加乘-鞋頭TPU 保護裝置，防止腳指衝擊受傷-鞋內襯環繞泡棉，\n有效包款覆腳後跟在世界上最知名的品牌之一，new balance繼續成為領先\n的鞋業品牌，部分原因是由於他們推出的新能源，盡可能做出最好的鞋。new balance 棒\n壘球鞋提供了一個時尚，低筒的設計，提供一個成型的棒球夾板驚人的牽引。外底與防滑板\n配置環境優選橡膠。可提供更多的表面與地面接觸的。給你一個全方位的運動  整體設計不\n同於市場棒壘球鞋設計兼具功能與造型超強', '170.jpg', '', '', '', '', 'sizeeshoe.JPG', '2024-05-11 17:59:00', 1),
(171, 'EASTON EMKC-1150RHT 棒壘手套 內野 工字 黑灰', 3311, '手套', '左手', 'EASTON', '黑', 'M,L,XL', '型號：EMKC-1150RHT\n尺寸 : 約11.5吋\n款式 : 工字 (如圖示)\n材質 : 美國天然牛皮\n顏色 : 黑灰 (如圖示)\n特色 : \nEASTON MAKO COMP系列棒壘手套，採用美國天然牛皮製成，柔軟卻耐用，任何設計都符合人體工學，超柔軟的襯裡，使用更舒適。', '171.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 17:59:00', 1),
(172, 'EASTON FUTURE ELITE 未來之星 即戰力 牛皮 兒童 少年 棒壘手套 ', 2288, '手套', '右手', 'EASTON', '藍', 'M,L,XL', '型號：FUTURE ELITE\n尺寸 : 約11吋\n款式 : 工字 (如圖示)\n材質 : 即戰力牛皮\n顏色 : 寶藍紅 (如圖示)\n特色 : \n專為十一歲以下青少年球員設計，Future Elite的Flex Notch閉合系統使這款手套易於上手，柔軟舒適的即戰力牛皮，可以隨時調整手套的開闔大小，確保每位球員都能獲得牢固、可控的貼合感。內裡還加入了一層超柔軟的掌心襯裡，能夠承受一次又一次的撞擊。', '172.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 17:59:00', 1),
(173, 'EASTON MAPLE A110164734 加拿大 楓木 壘球棒 耐打 彈性佳 銀X黑', 1900, '球棒', '鋁棒', 'EASTON', '黑', '均碼', '編號 : A110164734\n重量 : 平均約24.5OZ~25.5OZ\n尺寸 : 約34吋  \n顏色 : 銀X黑 (如圖示) \n材質 : 加拿大 楓木\n特色 : 加拿大楓木打造而成 耐打度強 彈性超佳 握感極佳棒頭有挖洞 適合各種需求的打者選用 整體設計不論棒型顏色與材質均屬一流完全不輸職業級', '173.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 19:56:59', 1),
(174, 'EASTON PRO MAPLE A11016434 頂級 北美 楓木 壘球棒 彈性佳 黃', 2555, '球棒', '木棒', 'EASTON', '黃', '均碼', '型號 : A11016434\n重量 : 平均約25.5OZ~26OZ ±10G\n尺寸 : 約34吋  \n顏色 : 黃X黑 (如圖示) \n材質 : 頂級 北美 楓木\n特色 : 頂級 北美 楓木打造而成  耐打度強  彈性\n超佳 握感極佳  棒頭有挖洞 適合各種需求的打者選用 整體\n設計不論棒型 顏色與材質均屬一流   完全不輸職業級', '10.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 19:57:59', 1),
(175, 'EASTON MAKO TORQ YB16MK10 -10 綠黑白 兒童 少年 球棒', 6666, '球棒', '鋁棒', 'EASTON', '綠', '均碼', '型號：YB16MK10\n顏色 : 綠黑白 (如圖示)\n材質：TCT複合設計鋁合金+CXN雙截式設計\n規格：31吋/21OZ 2-1/4“直徑頭\n特色 : 採用EASTON新一代360 TORQ專利握把設計能增加打者揮棒速度\nTCT專利熱複合設計鋁合金 專利雙截式CXN製程技術能 減少擊球時的震動將\n擊球效能最大化 超薄舒適的軟墊握手把材質 專利技術提供球棒更大擊球甜蜜點及耐用\n性 耐用的鋁合金端蓋 超薄29/32“帶軟墊握手柄 2-1/4“直徑棒頭USSSA認證 -12長度\n重量比率之棒頭設計 無消音蓋設計 手感舒適緩衝效果佳  耐用的鋁合金。均勻平衡設計\n揮桿重量更輕重量輕適合揮桿的兒童 少年選手', '1.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 19:59:47', 1),
(176, 'EASTON A1101642 職業級 加拿大 嚴選 頂級 加硬 實心 楓木 壘球棒', 1111, '球棒', '木棒', 'EASTON', '黃', '均碼', '型號 : A1101642 \n重量 : 平均約710~740克±10\n尺寸 : 約34吋  \n顏色 : 原木色 (如圖示) \n材質 : 加拿大 嚴選 頂級 加硬 實心 楓木\n特色 : 加拿大 嚴選 頂級 加硬 實心 楓木 打造而成  耐打度強  彈性\n超佳 握感極佳  棒頭有挖洞 適合各種需求的打者選用 整體\n設計不論棒型 顏色與材質均屬一流   完全不輸職業級', '14.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 20:00:47', 1),
(177, 'EASTON A1101642 職業級 加拿大 嚴選 頂級 加硬 實心 楓木 壘球棒', 1000, '球棒', '木棒', 'EASTON', '黑', '均碼', '型號 : A1101642 \n重量 : 平均約710~740克±10\n尺寸 : 約34吋  \n顏色 : 琥珀黑 (如圖示) \n材質 : 加拿大 嚴選 頂級 加硬 實心 楓木\n特色 : 加拿大 嚴選 頂級 加硬 實心 楓木 打造而成  耐打度強  彈性\n超佳 握感極佳  棒頭有挖洞 適合各種需求的打者選用 整體\n設計不論棒型 顏色與材質均屬一流   完全不輸職業級', '177.webp', '', '', '', '', 'bat.jpg', '2024-05-11 20:01:47', 1),
(178, 'EASTON MAPLE 318A A1102262 頂級 北美 楓木 棒球棒 黑原木', 888, '球棒', '木棒', 'EASTON', '黑', '均碼', '型號 : A1102262\n規格 : 33.5吋 (有挖洞)\n重量 : 約870~910克±10\n顏色 : 黑原木 (如圖示)\n材質 : 北美 楓木\n注意事項 : 請勿以球棒敲擊地面或打擊石頭\n特色 : 採用頂級北美楓木 耐用握感好彈性佳 超輕量設計 職業等級材質製造  系\n列是採用專業級的，精心挑選的楓木製成。楓木作為一個緻密的木材更大的表面\n硬度，由於其密實木材，楓木球棒是不容易剝落。由於楓的密實木材，帶來更多\n的動力和耐用性，以每一次揮擊選擇楓木其擊球面和更持久耐用。楓樹是一個密\n實的木材，成為突出的，通過使用的球員驅使推動下 品質深受肯定 價格 平民化\n不論材質 重量或外型設計堪稱一流  與PRO級球棒同等級', '5.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 20:02:47', 1),
(179, 'EASTON B60 北美楓木 + 孟宗竹 楓竹 合成 棒球棒 耐打 彈性佳 不易斷', 2222, '球棒', '木棒', 'EASTON', '白', '均碼', '型號 : B60\n重量 : 平均約860~870G±10\n尺寸 : 約34吋  \n顏色 : 白X黑 (如圖示)\n材質 : 北美楓木 + 孟宗竹\n特色 : 北美楓木 + 孟宗竹打造而成 不易斷 耐打度強  彈性\n超佳 握感極佳  棒頭有挖洞 適合各種需求的打者選用 整體\n設計不論棒型 顏色與材質均屬一流   完全不輸職業級', '6.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 20:05:47', 1),
(180, '日本製 FILA PRO 日本職棒 NPB 歐力士猛牛', 4441, '帽子', '打擊頭盔', 'FILA', '黑', 'S,M,L', '日本進口 FILA PRO 日本職棒 NPB 歐力士猛牛 T-岡田 親筆簽名 硬式單耳頭盔\nFILA PRO 日本職棒 NPB 單耳打擊頭盔，\n超輕量設計，可蒐藏也可實戰配戴質感遠勝一般台灣頭盔！\n產品特點：\n1. 顏色：消光黑 (如照片)\n2. 尺寸 (頭圍)：M (56 ~ 57 cm)\n3. 重量：355 g\n4. 材質：高強度 ABS 樹脂\n5. 產地：中國', '180.webp', '', '', '', '', 'sizehat.jpg', '2024-05-11 20:15:47', 1),
(181, '日本製 FILA GOLD STAGE 成人用 硬式捕手護胸', 2265, '護具', '捕手護具', 'FILA', '黑', '均碼', '日本製 FILA GOLD STAGE 成人用 硬式捕手護胸 3123A467\n產品特點：\n1. 顏色：黑色\n2. 尺寸：47 x 51 cm (成人用)\n3. 重量：930 g\n4. 材質：聚酯纖維\n5. 產地：日本', '181.webp', '', '', '', '', 'size.jpg', '2024-05-11 20:16:47', 1),
(182, '日本製 ZETT PROSTATUS 小林誠司 JSBB 軟式最高階 BLP3238C 成人用 捕手', 3346, '護具', '捕手護具', 'ZETT', '黑', '均碼', '日本製 ZETT PROSTATUS 小林誠司 JSBB 軟式最高階 BLP3238C 成人用 捕手護胸\nZETT PROSTATUS 軟式最高階護胸，配戴舒適質感佳。\n產品特點：\n1. 顏色：深藍 x 金色\n2. 尺寸：47 x 47 cm (成人用)\n3. 重量：670 g\n4. 材質：合成皮革\n5. 產地：日本', '182.webp', '182red.jpg', '182green.jpg', '182blue.jpg', '182yellow.jpg', 'size.jpg', '2024-05-11 20:17:47', 1),
(183, 'FILA 羅林斯 MLB OFFICIAL BASEBALL 大聯盟正式比賽用球 ROMLB', 6654, '球', '硬式', 'FILA', '白', '均碼', 'FILA 羅林斯 MLB OFFICIAL BASEBALL 大聯盟正式比賽用球 ROMLB\n耐用好投', '183.webp', '', '', '', '', 'bal.JPG', '2024-05-11 20:18:47', 1),
(184, '日本製 FILA (pro) 日本大阪職人手作 硬式最高階 內野手套', 5524, '手套', '右手', 'FILA', '橘', 'S,M,L', '日本製 ALEGRIA (?????) 硬式最高階 內野手套 \n日本大阪職人手作 ALEGRIA (?????) 硬式手套，皮革品質及作工細節都秉持著傳統日本製的高要求，\n手口標 & 鋼印 LOGO 等細節透露出巧思美感，紮實耐用度也頗有水準，為整體內外兼具的優質小品牌日製手套。\n產品特點：\n1. 顏色：橘色\n2. 尺寸：12吋\n3. 重量：540克\n4. 款式：內野 (硬式)\n5. 材質：天然皮革\n6. 產地：日本大阪', '184.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 20:19:47', 1),
(185, '日本製 FILA (prov2) 日本大阪職人手作 吉見一起聯名款 硬式最高階 投手手套 棒球手套 ', 1132, '手套', '左手', 'FILA', '藍', 'S,M,L', '日本製 ALEGRIA (?????) 吉見一起聯名款 硬式最高階 投手手套 \n日本大阪職人手作 ALEGRIA (?????) 硬式手套，皮革品質及作工細節都秉持著傳統日本製的高要求，\n手口標 & 鋼印 LOGO 等細節透露出巧思美感，紮實耐用度也頗有水準，為整體內外兼具的優質小品牌日製手套。\n*吉見一起聯名款，手口吉見投球剪影刺繡 & 球擋特殊設計。\n產品特點：\n1. 顏色：黑色\n2. 尺寸：12.25吋\n3. 重量：560克\n4. 款式：投手 (硬式)\n5. 材質：天然皮革\n6. 產地：日本大阪', '185.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 20:20:47', 1),
(186, '日本製 FILA (maxstr) 日本大阪職人手作 硬式最高階 內野手套 棒球手套 壘球手套', 9966, '手套', '左手', 'FILA', '黑', 'S,M,L', '日本製 ALEGRIA (?????) 硬式最高階 內野手套 \n日本大阪職人手作 ALEGRIA (?????) 硬式手套，皮革品質及作工細節都秉持著傳統日本製的高要求，\n手口標 & 鋼印 LOGO 等細節透露出巧思美感，紮實耐用度也頗有水準，為整體內外兼具的優質小品牌日製手套。\n產品特點：\n1. 顏色：深藍\n2. 尺寸：11.75吋\n3. 重量：540克\n4. 款式：內野 (硬式)\n5. 材質：天然皮革\n6. 產地：日本大阪', '186.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 20:21:47', 1),
(187, '日本製 OAKLEY 目錄外限定版 軟式內野手套', 5588, '手套', '左手', 'OAKLEY', '橘', 'S,M,L', '日本製 OAKLEY 目錄外限定版 軟式內野手套\nOAKLEY 為日本當地質感出眾的小品牌，皮革及紮實度都還不錯。\n產品特點：\n1. 顏色：橘色\n2. 尺寸：11.8吋\n3. 重量：480克\n4. 款式：內野 (軟式)\n5. 材質：天然皮革\n6. 產地：日本', '187.webp', '187red.jpg', '187green.jpg', '187blue.jpg', '187yellow.jpg', 'sizehands.jpg', '2024-05-11 20:23:47', 1),
(188, '日本製 OAKLEY NATIONAL LINE 軟式內野手套', 8844, '手套', '右手', 'OAKLEY', '黑', 'S,M,L', '日本製 OAKLEY NATIONAL LINE 軟式內野手套\n 為日本OAKLEY當地質感出眾的小品牌，皮革及紮實度都還不錯。\n產品特點：\n1. 顏色：黑色\n2. 尺寸：11.25吋\n3. 重量：530克\n4. 款式：內野 (軟式)\n5. 材質：天然皮革\n6. 產地：日本', '188.webp', '188red.jpg', '188green.jpg', '188blue.jpg', '188yellow.jpg', 'sizehands.jpg', '2024-05-11 20:25:47', 1),
(189, 'OAKLEY Prime Maple LC243M33.5RGC 職業級 選手 特製款 頂級楓木 棒', 6631, '球棒', '木棒', 'OAKLEY', '紅', '均碼', '型號 : LC243M33.5RGC\n棒形 : C243\n尺寸 : 33.5吋 ~~有挖洞~~\n顏色 : 紅 (如圖示) \n重量 : 約900克±10\n材質 : 北美頂級楓木 職業等級 Prime Maple  \n特色 : 採用路易斯維爾公司。自豪地介紹了MLB Prime Maple 系列有史以來路易斯\n維爾  這是最高品質的木材用阿米甚工藝，360度的壓縮和先進的表面處理系統創建，零\n軟點和更令人滿意。C271棒型是由像辛辛那提紅人的布蘭頓菲利普斯，比賽中最多才多\n藝的擊球手之一使用。這翻模有中等桶和15/16“處理一個平衡的擺\n動 MLB Prime Maple正是你所看到的美國職棒大聯盟球員整個賽季都在野外使用長  耐\n用 握感好彈性佳  超輕量設計 職業等級材質製造 楓之緻密，堅硬的木材使它成為一個強\n大的棒球棒不易剝落和一個最佳屬性，楓樹的密實剛度和硬度結合更輕的重量和更廣泛\n的車削灰模型。質量最好的單板木材和使用阿米甚方形切割工藝，360度的壓縮過程優\n於骨摩擦，以及先進的加工系統，保證9H硬度 - 在21級可用的最高級萬能硬度標尺 力\n和耐用性，以每一次揮擊其擊球面和更持久耐用。在過去的十年中，通過使用的美國職\n棒大聯盟球員驅使推動下 品質深受肯定 不論材質 重量或外型設計堪稱一流', '3.webp', '', '', '', '', 'bat.jpg', '2024-05-11 20:26:47', 1),
(190, 'OAKLEY TRAINING TRB2015C-1025 進口 楓木 加重 重量 訓練棒 白', 5263, '球棒', '鋁棒', 'OAKLEY', '白', '均碼', '型號：TRB2015C-1025\n尺寸 : 約 85 cm.\n重量 : 平均約1000g\n顏色 : 白X粉紅 (如圖示)\n材質：楓木\n特色 : 採用進口 楓木材質 可打擊 重量訓\n練棒的最佳選擇棒身顏色設計 別有另種造型風格', '12.webp', '', '', '', '', 'bat.jpg', '2024-05-11 20:27:47', 1),
(191, 'OAKLEY WTLWBPL271-UF34C C271 火烤色 白樺木', 3456, '球棒', '木棒', 'OAKLEY', '黃', '均碼', '型號 : WTLWBPL271-UF34C\n尺寸 : 約34吋~~有挖洞~~\n顏色 : 火烤色 (如圖示)  \n重量 : 約880~900克 -+5\n材質 : 北美優質白樺木\n特色 : 採用路易斯維爾公司  耐用握感好彈性佳  超輕量設計 職業等級\n材質製造 是採用專業級的，是你所看到的美國職棒大聯盟球員整個賽季都\n在野外使用長  耐用 握感好彈性佳  超輕量設計 職業等級材質製造 匯集白樺\n木和灰的最佳屬性，重量更輕，更大的甜蜜點，重量輕灰和形式，它成為\n一個真正強大的棒球棒具有更大更靈活的甜蜜點  更輕的重量更廣泛的車削\n灰模型。質量最好的單板木材和使用阿米甚方形切割工藝， 360度的壓縮\n優於骨摩擦，以及先進的加工系統，在過去的十年中，通過使用的美國職\n棒大聯盟球員驅使推動下 品質深受肯定 價格 平民化不論材質 重量或外型設\n計堪稱一流  與PRO級球棒同等級', '10.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 20:28:47', 1),
(192, 'OAKLEY MASTER 麥斯特 復仇者系列 楓木 棒球棒 黑豹', 8521, '球棒', '木棒', 'OAKLEY', '黑', '均碼', '尺寸 : 約34吋(有挖頭)\n顏色 : 黑 (如圖示)\n重量 : 約860~880G±10\n材質 : 楓木\n注意事項 : 請勿以球棒敲擊地面或打擊石頭\n特色 : 平衡棒型 小喇叭細握把 小手也能輕鬆握住的喇叭棒型 可推可拉好\n上手棒型 採用楓木耐用握感好彈性佳 超輕量設計 職業等級材質製造 是採\n用專業級的，精心挑選的楓木製成。由於楓的密實木材，帶來更多的動力\n和耐用性，以每一次揮擊選擇楓木其擊球面和更持久耐用。楓樹是一個密\n實的木材，成為突出的  耐用彈性佳  重量適中 一般人適用可選擇  可依個\n人需求與喜好選擇  球場上展威力 不論 材質 重量或外型設計堪稱一流絕不\n輸PRO級球棒喔 ', '11.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 20:29:47', 1),
(193, 'OAKLEY INFINITY POPULAR 特製款 DAI2 戴培峰 使用型 北美 楓木 實心 ', 6543, '球棒', '木棒', 'OAKLEY', '紅', '均碼', '棒型 : DAI2 戴培峰 使用型 (平衡微重頭型)\n尺寸 : 約33.5吋 (有挖洞)\n顏色 : 紅原木 (如圖示)\n重量 : 平均約860~880克±10\n材質 : 北美楓木\n注意事項 : 請勿以球棒敲擊地面或打擊石頭\n特色 : DAI2 戴培峰 使用型 (平衡微重頭型) 採用北美楓\n木製造 耐用彈性佳 重量適中 一般人適用 可依個人需求\n與喜好選擇球場上展威力 不論材質重量或外型設計堪稱\n一流 絕不輸PRO級球棒', '3.webp', '', '', '', '', 'bat.jpg', '2024-05-11 20:30:47', 1),
(194, 'New Balance Slugger LTTB18BLRD 棒壘 楓木 單手 訓練棒', 6985, '球棒', '鋁棒', 'New Balance', '紅', '均碼', '型號：LTTB18BLRD\n尺寸 : 約 28吋\n重量 : 平均約640g ±10\n顏色 : 紅黑 (如圖示)\n材質：楓木\n注意事項 : 請勿以球棒敲擊地面或打擊石頭\n特色 : 採用楓木製造  耐用彈性佳  重量適中 一般人適用可選擇  可依個人需\n求與喜好選擇  球場上展威力 不論 材質 重量或外型設計堪稱一流\n訓練棒的最佳選擇', 'wooden_bat009.jpg', '', '', '', '', 'bat.jpg', '2024-05-11 20:31:47', 1),
(195, 'New Balance PRO500P-P89 22 職業級 楓木 棒球棒 P89 棒型 酒紅 ', 2563, '球棒', '鋁棒', 'New Balance', '紅', '均碼', '型號：PRO500P-P89 22\n棒型 : P89\n尺寸 : 約33.5吋\n重量 : 約870~880±10\n材質 : 職業用 楓木\n顏色 : 酒紅\n特色 : 採用職業用楓木製成  耐打度強彈性佳  價格超\n優 值得一試  硬度加強 甜蜜點加大 超有質感品質堪稱一流絕\n佳的棒型與材質任您選擇!市場壘球棒中絕對是值得推薦', 'metallic_bat005.jpg', '195red.jpg', '195green.jpg', '195blue.jpg', '195yellow.jpg', 'bat.jpg', '2024-05-11 20:30:47', 1),
(196, 'New Balance HATAKEYAMA HUF9100 北美 奧奇戈產 職業級 硬 楓木 棒球', 1524, '球棒', '木棒', 'New Balance', '綠', '均碼', '型號 : HUF9100\n棒型 : 271\n尺寸 : 約85CM(約33.5吋)\n重量 : 平均約850~880克±10\n顏色 : 寶石綠 (如圖示)\n材質 : 北美 奧奇戈產 職業級 硬 楓木\n特色 : 北美 奧奇戈產 職業級 硬 楓木 北美奧奇戈產職業級楓木材質，職\n人手工精製，較大擊球甜蜜區，喇叭棒尾 中等棒頭 平衡型 好打握感佳\n耐打強度高 彈性佳 棒球棒絕佳的選擇 PRO級的品質平民的價格絕對\n值得購買', '13.webp', '196red.jpg', '196green.jpg', '196blue.jpg', '196yellow.jpg', 'bat.jpg', '2024-05-11 20:31:47', 1),
(197, 'FILA RAWLINGS PRO PREFERRED CUSTOM ORDER 訂製款 PROS2', 1235, '手套', '左手', 'FILA', '綠', 'S,M,L', '美國進口 羅林斯 RAWLINGS PRO PREFERRED CUSTOM ORDER 訂製款 PROS205 硬式投手手套\n美規 PRO PREFERRED 為 RAWLINGS 品牌中的頂級之作，\n本體小牛皮細緻度非常高，內裡採用綿羊皮 SHEEPSKIN，舒適感也是極佳。\nPROS205W 型號刀模，客製化配色及刺繡，紮實度有一定水準！\n產品特點：\n1. 顏色：客製化配色\n2. 尺寸：11.75吋\n3.重量：650克\n4. 款式：投手 (美規硬式)\n5. 材質：PP 頂級小牛革 + 綿羊革內裡\n6. 產地：菲律賓', '197.webp', '197red.jpg', '197green.jpg', '197blue.jpg', '197yellow.jpg', 'sizehands.jpg', '2024-05-11 20:32:47', 1),
(198, '日本製 FILA  KUBOTA SPECIAL ORDER KSG-L7S 硬式內野手套', 2587, '手套', '右手', 'FILA', '白', 'S,M,L', '日本製 FILA KUBOTA SPECIAL ORDER KSG-L7S 硬式內野手套\n正日製久保田 SPECIAL ORDER，非一般量產手套配色！\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\nSLUGGER 以自家刀模的接球穩定感而聞名，體驗正日製經典就選 SLUGGER！\n產品特點：\n1. 顏色：客製化配色\n2. 尺寸：11.7吋\n3. 重量：550克\n4. 款式：內野 (硬式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本\n7. 附 SLUGGER 手套袋 & 專用紙箱', '198.webp', '', '', '', '', 'sizehands.jpg', '2024-05-11 20:33:47', 1),
(199, '日本製 FILA KUBOTA SPECIAL ORDER KSN-L7S 軟式內野手套', 6395, '手套', '右手', 'FILA', '白', 'S,M,L', '日本製 FILA KUBOTA SPECIAL ORDER KSN-L7S 軟式內野手套\n正日製久保田 SPECIAL ORDER，非一般量產手套配色！\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\nSLUGGER 以自家刀模的接球穩定感而聞名，體驗正日製經典就選 SLUGGER！\n產品特點：\n1. 顏色：客製化配色\n2. 尺寸：11.7吋\n3. 重量：550克\n4. 款式：內野 (軟式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本\n7. 附 SLUGGER 手套袋 & 專用紙箱', '199.webp', '199red.jpg', '199green.jpg', '199blue.jpg', '199yellow.jpg', 'sizehands.jpg', '2024-05-11 20:34:47', 1),
(200, 'EASTON 3558-ICHIRO-OS19IMG 2019 MLB 開幕賽 鈴木一朗 人像 紀念', 2000, '球', '硬式', 'EASTON', '白', '均碼', '材質 : 天然皮革\n特色 : 西雅圖水手隊一郎前往日本！美國職業棒球大聯盟日本開幕紀念球緊\n急進貨！MLB官方的復製品球。含OPENING SERIES 2019 TOKYO JAPAN\n的印刷。在MLB闖蕩的鈴木一朗 Rawlings特別推出了這顆限量紀念球！在比\n賽用球上印製了一朗的專屬紀念 LOGO 奠定了他的歷史定位，讓我們一起享\n受這歷史性的一刻吧！採用優良材質製造 中獨具一格 極具收藏價值 可收藏亦\n可給球員簽名錯過可惜 收藏這一刻的瞬間紀念非此款紀念球莫屬 超特別極具\n保存價值 數量超少想搶趁現在', '200.webp', '', '', '', '', 'bal.JPG', '2024-05-11 20:44:47', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `product_info`
--

CREATE TABLE `product_info` (
  `ID` int(5) UNSIGNED NOT NULL,
  `class` varchar(255) NOT NULL,
  `other` varchar(255) NOT NULL,
  `size` varchar(255) NOT NULL,
  `brand` varchar(255) NOT NULL,
  `color` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  `valid` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `product_info`
--

INSERT INTO `product_info` (`ID`, `class`, `other`, `size`, `brand`, `color`, `created_at`, `valid`) VALUES
(1, '球棒', '鋁棒,木棒', '均碼,26,27,28,29,30,31,32,33,34', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:12:01', 1),
(2, '球', '硬式,軟式', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:13:45', 1),
(3, '帽子', '球帽,打擊頭盔', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:14:40', 1),
(4, '球衣', '長袖,短袖', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:15:01', 1),
(5, '手套', '左手,右手,打擊手套', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:15:30', 1),
(6, '球褲', '長褲,短褲', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:16:50', 1),
(7, '襪子', '長筒,短筒', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:18:02', 1),
(8, '球鞋', '跑鞋,釘鞋', '24,25,26,27,28,29,30,31,32,33', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:19:20', 1),
(9, '裝備', '裝備袋,球袋,球具袋,鞋袋', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:22:21', 1),
(10, '護具', '捕手護具,打擊護具', '均碼,XS,S,M,L,XL', 'MIZUNO,久保田Slugger,ZETT,SSK,LouisvilleSlugger,EASTON,BRETT,Wilson,UNDERARMOUR,NIKE,adidas,創信,MLB,統一獅,asics', '單一顏色,黑,白,紅,黃,藍,綠,橘', '2024-01-27 09:22:49', 1),
(11, '測試1', '1', '1', 'MIZUNO,久保田Slugger,ZETT', '黑,白', '2024-02-06 14:06:07', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `rent`
--

CREATE TABLE `rent` (
  `id` int(10) NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` int(10) NOT NULL,
  `image_url` varchar(255) NOT NULL,
  `img` varchar(100) NOT NULL,
  `black` varchar(100) NOT NULL,
  `red` varchar(100) NOT NULL,
  `green` varchar(100) NOT NULL,
  `blue` varchar(100) NOT NULL,
  `yellow` varchar(100) NOT NULL,
  `description` varchar(1000) NOT NULL,
  `class_id` varchar(255) NOT NULL,
  `sizes` varchar(255) NOT NULL,
  `brand_id` varchar(255) NOT NULL,
  `colors` varchar(255) NOT NULL,
  `other_id` varchar(255) NOT NULL,
  `rent_start` datetime NOT NULL,
  `rent_end` datetime NOT NULL,
  `created_at` datetime NOT NULL,
  `mode` varchar(255) NOT NULL,
  `valid` int(3) NOT NULL,
  `introduce` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `rent`
--

INSERT INTO `rent` (`id`, `name`, `price`, `image_url`, `img`, `black`, `red`, `green`, `blue`, `yellow`, `description`, `class_id`, `sizes`, `brand_id`, `colors`, `other_id`, `rent_start`, `rent_end`, `created_at`, `mode`, `valid`, `introduce`) VALUES
(1, 'mizuno || 日製成人硬式楓木棒 HIGHCLASS STYLE', 1000, 'assets/img/rent_product_img/木棒-23.jpg', 'wooden_bat001.jpg', '', '', '', '', '', '材質- 楓木\n\n尺寸- 84cm870g直徑?64m/m\n\n顏色- 火烤x原木\n\n※TS8-安定握把部設計，確實帶出棒頭長打型設計。\n\n產地- 越南\n\n上市月份- 2023年 4月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:17:00', '上架', 0, 'bat.jpg'),
(2, 'mizuno || 日製成人硬式楓木棒 MIZUNO PRO', 1000, 'assets/img/rent_product_img/木棒-21.jpg', 'wooden_bat002.jpg', '', '', '', '', '', '材質- 楓木\n\n尺寸- 84cm840g直徑?63.5m/m\n\n顏色- 黑色/原木\n\n※鈴木一朗棒型，講究的輕量化設計，棒頭設計有利於用棒頭發力的長打型球棒。\n\n產地- 越南\n\n上市月份- 2023年 4月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 14:05:32', '下架', 1, 'bat.jpg'),
(3, 'mizuno || 日製教練棒 MIZUNO PRO KNOCK', 1000, 'assets/img/rent_product_img/木棒-21.jpg', 'wooden_bat003.jpg', '', '', '', '', '', '材質- 朴木+楓木\n\n尺寸- 91cm 約550g 直徑?56m/m\n\n顏色- 白/深藍\n\n※朴木與楓木合木，兼具輕量與耐用。\n\n產地- 台灣\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 14:05:38', '下架', 1, 'bat.jpg'),
(4, 'mizuno || 成人硬式木棒 MZP 271 PRO LIMITED MAPLE', 1000, 'assets/img/rent_product_img/木棒-19.jpg', 'wooden_bat004.jpg', '', '', '', '', '', '材質- 楓木\n\n尺寸- 84cm.平均約850g..86cm約880g\n\n顏色- 黑色 & 咖啡x黑色\n\n※職棒選手型\n※使用高級硬楓，創造出更硬的打感，擊球聲更清脆。\n※家具等級高級烤漆。<>MZP271型\n\n產地- 越南\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 11:43:00', '上架', 1, 'bat.jpg'),
(5, 'mizuno || 成人硬式木棒 MZP 110 PRO SELECT MAPLE', 800, 'assets/img/rent_product_img/木棒-18.jpg', 'wooden_bat005.jpg', '', '', '', '', '', '材質- 楓木\n\n尺寸- 84cm.平均約880g..86cm約900g\n\n顏色- 黑色 & 咖啡x黑色\n\n※職棒選手型\n※使用高級硬楓，創造出更硬的打感，擊球聲更清脆。\n※家具等級高級烤漆。MZM110\n\n產地- 中國\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:26:00', '上架', 0, 'bat.jpg'),
(6, '職業級GLADIATOR成人用捕手護胸', 700, 'assets/img/rent_product_img/木棒-29.jpg', '1707123306.jfif', '', '1707123306red.jpg', '1707123306green.jpg', '1707123306blue.jpg', '1707123306yellow.jpg', '型號：LBP-302\n材質：發泡棉\n\n一體成型16mmPU發泡棉\n萊卡布表面\n背面為透氣孔\n鐵扣穿戴增強耐用性', '護具', '均碼', 'BRETT', '紅', '捕手護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:31:00', '上架', 0, 'size.jpg'),
(7, 'mizuno || 壘球手套 FRIENDSHIP', 500, 'assets/img/rent_product_img/木棒-27.jpg', 'baseball_glove001.jpg', '', 'baseball_glove001red.jpg', 'baseball_glove001green.jpg', 'baseball_glove001blue.jpg', 'baseball_glove001yellow.jpg', '材質- \n面,指背/裡:豬皮\n穿帶:牛皮\n\n球擋- CROSS 1\n\n守備位置- 內野手\n\n※耐用全皮仕樣:掌面,內裡,指背採用全豬皮\n※指背採用豬皮，適合初階球友使用，柔軟好上手。\n\n產地- 中國\n\n上市月份- 2023年 3月', '手套', 'M,L', 'MIZUNO', '紅', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:31:00', '上架', 0, 'sizehands.jpg'),
(8, 'mizuno || 壘球手套 MVP', 900, 'assets/img/rent_product_img/木棒-26.jpg', 'baseball_glove003.jpg', '', 'baseball_glove003red.jpg', 'baseball_glove003green.jpg', 'baseball_glove003blue.jpg', 'baseball_glove003yellow.jpg', '材質- \n面:高級牛皮 \n裡:豬皮 \n指背.穿帶:牛皮\n\n球擋- DEEP 1\n\n守備位置- 內野手\n\n※外皮全牛皮，內裏採用厚芯豬皮，舒適性提升。\n※適合慢壘進階球友使用。\n※美規式樣，姆指內側尺寸剛印，指背刺繡MRB logo，更顯質感。\n\n產地- 日本\n\n上市月份- 2023年 2月', '手套', 'M,L', 'MIZUNO', '藍,黃,綠,紅', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 11:43:00', '上架', 1, 'sizehands.jpg'),
(9, 'mizuno || 壘球手套 MVP2', 800, 'assets/img/rent_product_img/木棒-16.jpg', 'baseball_glove004.jpg', '', 'baseball_glove004red.jpg', 'baseball_glove004green.jpg', 'baseball_glove004blue.jpg', 'baseball_glove004yellow.jpg', '材質- \n面:高級牛皮 \n裡:豬皮 \n指背.穿帶:牛皮\n\n球擋- SA2\n\n守備位置- 外野手\n\n※外皮全牛皮，內裏採用厚芯豬皮，舒適性提升。\n※適合慢壘進階球友使用。\n※美規式樣，姆指內側尺寸剛印，指背刺繡MRB logo，更顯質感。\n\n產地- 日本\n\n上市月份- 2023年 2月', '手套', 'M,L', 'MIZUNO', '藍,黃,綠,紅', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:32:00', '上架', 1, 'sizehands.jpg'),
(10, 'mizuno || 壘球手套', 1200, 'assets/img/rent_product_img/鋁棒-13.jpg', 'baseball_glove006.jpg', '', '', '', '', '', '材質- \n面:指背:牛皮 \n內裏:PU 穿帶:PU\n\n球擋- TARTAN SHOCK\n\n守備位置- 通用\n\n\n1.立即好上手的摔花牛皮 2.Droll構造:在承受來球衝擊最大的球檔下緣加強穿繩設計。 3.球檔與拇指交叉部位皮革強化。\n\n產地- 泰國\n\n上市月份- 2023年 9月', '手套', 'M,L', 'MIZUNO', '黑', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:36:00', '上架', 1, 'sizehands.jpg'),
(11, 'mizuno || 棒球釘鞋 CUSHIONREVO PRO', 1300, 'assets/img/rent_product_img/鋁棒-12.jpg', 'spiked_shoes001.jpg', 'spiked_shoes001.jpg', 'spiked_shoes002.jpg', '', '', '', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 340g(28.0cm)\n\n※追求裸足感的厚底設計。\n※提升彎曲的大底溝槽設計與內藏高反發發泡材質。\n※Enerzy鞋墊\n\n\n產地- 柬埔寨\n\n上市月份- 2023年 2月', '球鞋', '24,25,26,27,28,29,30,31', 'MIZUNO', '黃,藍', '釘鞋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:37:00', '上架', 1, 'sizeeshoe.JPG'),
(12, 'mizuno || 棒球釘鞋 LIGHTREVO BUDDY 2', 1300, 'assets/img/rent_product_img/鋁棒-10.jpg', 'spiked_shoes004.jpg', 'spiked_shoes004.jpg', 'spiked_shoes005.jpg', '', '', '', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 260g(27.0cm)\n\n※輕量、柔軟，強化耐久性的鞋頭補強。\n\n產地- 柬埔寨\n\n上市月份- 2024年 1月', '球鞋', '24,25,26,27,28,29,30,31', 'MIZUNO', '黑', '釘鞋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 11:43:00', '上架', 1, 'sizeeshoe.JPG'),
(13, 'mizuno || 棒球釘鞋 9-SPIKE AMBITON 3', 1400, 'assets/img/rent_product_img/鋁棒-5.jpg', 'spiked_shoes007.jpg', 'spiked_shoes007.jpg', '', '', '', '', '材質- \n鞋面：合成纖維＋人工皮革\n大底：射出成型大底\n\n重量- 約350g(27.0cm 單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 7月', '球鞋', '24,25,26,27,28,29,30,31', 'MIZUNO', '黑', '釘鞋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:38:00', '上架', 1, 'sizeeshoe.JPG'),
(14, 'ASICS 亞瑟士 || GOLD STAGE i-Pro 大A標 硬式最高階 反手 外野手套 小指', 1450, 'assets/img/rent_product_img/鋁棒-3.jpg', 'baseball_glove020.jpg', '', '', '', '', '', '產品特點：\n\n1. 顏色：黑色\n\n2. 尺寸：12.5吋\n\n3. 重量：610克\n\n4. 款式：外野 (硬式)\n\n5. 材質：Special Over kip-Leather 高階小牛革\n\n6. 產地：日本\n\n-\n亞瑟士新款 i-Pro 頂級系列，雙夾條紮實度佳，整體球袋深度夠！\n\n*小指二本入機能，可退指使用。', '手套', 'M,L', 'asics', '黑,黃', '右手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:38:00', '上架', 1, 'sizehands.jpg'),
(15, '硬式棒球打擊頭盔', 1320, 'assets/img/rent_product_img/鋁棒-2.jpg', '1707116912.jfif', '', '', '', '', '', '高性能ABS塑料外殼\n戰略通風系統\n衝擊吸收發泡緩衝襯墊\n擴大顴骨及腦幹覆蓋範圍\n面罩/下顎護罩預裝孔位', '帽子', 'S,M,L', 'BRETT', '紅,黃', '打擊頭盔', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:39:00', '上架', 1, 'sizehat.jpg'),
(16, '職業級調整式打擊頭盔', 1700, 'assets/img/rent_product_img/鋁棒-0.jpg', '1707116996.jpg', '', '', '', '', '', '可調式頭圍', '帽子', 'S,M,L', 'BRETT', '紅', '打擊頭盔', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 13:39:00', '上架', 1, 'sizehat.jpg'),
(17, 'GLADIATOR美式打擊頭盔', 1400, 'assets/img/rent_product_img/鋁棒-1.jpg', '1707117058.jfif', '', '', '', '', '', '全覆式頭圍鬆緊帶設計', '帽子', 'S,M,L', 'BRETT', '單一顏色', '打擊頭盔', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-01-31 14:40:00', '上架', 1, 'sizehat.jpg'),
(18, '標準比賽用球 (12顆)', 800, 'assets/img/rent_product_img/木棒-23.jpg', '1707119385.jfif', '', '', '', '', '', '單位：12顆 / 盒 \n型號：S4101 \n顏色：白色 \n規格：約直徑7.2cm \n材質：聚氯乙烯、軟木、人造纖維 \n特色： 球心採用標準工序，將整塊軟木刨切而成，耐用度高，可吸收打擊時的衝擊力 一般市售多以木屑加壓黏合製成，打擊2、30次即碎裂，耐用度差', '球', '均碼', 'BRETT', '單一顏色', '硬式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 10:55:00', '上架', 1, 'bal.JPG'),
(19, 'M BALL 專用球 (12顆)', 800, 'assets/img/rent_product_img/木棒-19.jpg', '1707119473.jfif', '', '', '', '', '', '型號：EXP-M\n材質：橡膠\n直徑：72±0.5mm\n重量：138±1g\n反彈高度：80±10cm', '球', '均碼', 'BRETT', '單一顏色', '軟式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 10:57:00', '上架', 1, 'bal.JPG'),
(20, '棒球打擊練習球', 50, 'assets/img/rent_product_img/DALL·E 2024-01-31 14.56.28 - Create a fourth realistic image of a soft baseball with a distinct color. The ball should be designed for softer play, featuring a less dense core and.png', '1707119632.jfif', '', '', '', '', '', '型號：BB-P1\n材質：橡膠\n規格：9” / 5oz', '球', '均碼', 'BRETT', '單一顏色', '軟式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 15:21:00', '上架', 1, 'bal.JPG'),
(21, '投擲訓練用扁平球', 70, 'assets/img/rent_product_img/硬式-8.jpg', '1707120334.jfif', '', '', '', '', '', '型號：AC-31\n規格：9\" / 5oz', '球', '均碼', 'BRETT', '單一顏色', '硬式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 23:44:00', '上架', 1, 'bal.JPG'),
(22, 'GLADIATOR運動後背包', 80, 'assets/img/rent_product_img/硬式-7.jpg', '1707122485.jpg', '', '', '', '', '', '寬敞的主隔層\n兩側球棒帶袋\n獨立頭盔透氣收納室設計\n分離式鞋袋\n\"J \"型吊環及魔鬼氈條設計\n技術塗層背包表面，提升耐候性與抗水性\n多功能柔軟內襯隔層，適合各種運動等用途\n前置貴重物品袋\n人體工學加襯可調節肩帶\n發泡加襯背板', '裝備', '均碼', 'BRETT', '單一顏色', '裝備袋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 23:45:00', '上架', 1, 'bag1.JPG'),
(23, 'GLADIATOR亮皮捕手裝備袋', 456, 'assets/img/rent_product_img/硬式-5.jpg', '1707122528.jfif', '', '', '', '', '', '型號：B-B02\n材質：亮皮\n規格：84cm X 36cm X 36cm', '裝備', '均碼', 'BRETT', '單一顏色', '裝備袋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 23:46:00', '上架', 1, 'bag1.JPG'),
(24, '雙側袋遠征裝備袋', 90, 'assets/img/rent_product_img/硬式-4.jpg', '1707122595.jfif', '', '', '', '', '', '型號：SD-00047\n材質：亮皮\n規格：60cm X 35cm X 28cm', '裝備', '均碼', 'BRETT', '單一顏色', '裝備袋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 23:46:00', '上架', 1, 'bag1.JPG'),
(25, '打擊護脛', 80, 'assets/img/rent_product_img/硬式-3.jpg', '1707123129.jfif', '', '', '', '', '', '型號：EQP-9/01\n', '護具', '均碼', 'BRETT', '單一顏色', '打擊護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 23:47:00', '上架', 1, 'size.jpg'),
(26, 'mizuno || 日製教練棒', 80, 'assets/img/rent_product_img/硬式-0.jpg', 'wooden_bat006.jpg', '', '', '', '', '', '材質- 朴木+楓木\n\n尺寸- 90cm 約570g 直徑ψ57m/m\n\n顏色- 深藍/水藍\n\n※朴木與楓木合木，兼具輕量與耐用。\n\n產地- 日本\n\n上市月份- 2023年 9月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-01 23:47:00', '上架', 1, 'bat.jpg'),
(27, '職業級GLADIATOR成人用捕手護膝', 60, 'assets/img/rent_product_img/軟式-13.jpg', '1707123380.jpg', '', '', '', '', '', '型號：LG-332\n材質：ABS膠殼\n\n膝蓋處氣墊式設計衝擊防護\nABS外殼\n三明治透氣網布\n快拆式鐵扣穿戴增強耐用性', '護具', '均碼', 'BRETT', '紅', '捕手護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 00:02:00', '上架', 1, 'size.jpg'),
(28, '快速壘球 (12入裝)', 50, 'assets/img/rent_product_img/軟式-4.jpg', '1707118349.jpg', '', '', '', '', '', '材質: 合成皮革\n特性: \n※軟木球心\n※比賽球\n\n產地: 台灣', '球', '均碼', 'MIZUNO', '單一顏色', '硬式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 00:02:00', '上架', 1, 'bal.JPG'),
(29, '棒球 (12入裝)', 60, 'assets/img/rent_product_img/軟式-0.jpg', '1707118424.jpg', '', '', '', '', '', '材質: 天然皮革\n產地: 中國', '球', '均碼', 'MIZUNO', '單一顏色', '硬式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 00:03:00', '上架', 1, 'bal.JPG'),
(30, 'MIZUNO 美津濃 紅線 硬式 棒球 練習用', 40, 'assets/img/rent_product_img/軟式-2.jpg', '1707119020.jpg', '', '', '', '', '', '型號 :1BJBH44600\n\n顏色 : (如圖示)\n\n材質 : 人工皮革\n\n特色 : 硬度一級棒,穩定性高不易變形\n\n表皮防水，不適用發球機。\n\n此款為人工皮革製成之棒球不變形耐打', '球', '均碼', 'MIZUNO', '單一顏色\n', '硬式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 00:04:00', '上架', 1, 'bal.JPG'),
(31, 'Louisville Slugger TPX 壘球 比賽專用球', 700, 'assets/img/rent_product_img/手套-16.jpg', '1707119218.jpg', '', '', '', '', '', '尺寸 : 一般壘球尺寸\n\n顏色 : (如圖示)\n\n材質 : 牛皮.PU.二榔皮材質等', '球', '均碼', 'LouisvilleSlugger', '單一顏色', '硬式', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 09:34:00', '上架', 1, 'bal.JPG'),
(32, 'mizuno || 日製成人硬式白樺木棒', 900, 'assets/img/rent_product_img/手套-15.jpg', 'wooden_bat007.jpg', '', '', '', '', '', '材質- 白樺木\n\n尺寸- 84cm870g直徑ψ64.5m/m\n\n顏色- 火烤x黑色\n\n※TS8-安定握把部設計，確實帶出棒頭長打型設計。 HC5-偏細握把整體喇叭型安打棒型設計。\n\n產地- 日本\n\n上市月份- 2023年 9月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 09:36:00', '上架', 1, 'bat.jpg'),
(33, 'mizuno || 日製成人硬式楓木棒 GLOBAL ELITE', 900, 'assets/img/rent_product_img/手套-7.jpg', 'wooden_bat008.jpg', '', '', '', '', '', '材質- 楓木\n\n尺寸- 84cm870g直徑ψ64.5m/m\n\n顏色- 原木\n\n※SU51-好操控，適合安打也可設定長打用。\n※SU7-安定度高握把，一般打者好發揮的安打棒型。\n\n產地- 日本\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 09:37:00', '上架', 1, 'bat.jpg'),
(34, 'mizuno || 日製成人硬式黃樺木棒 GLOBAL ELITE', 700, 'assets/img/rent_product_img/手套-9.jpg', 'wooden_bat009.jpg', '', '', '', '', '', '材質- 楓木\n\n尺寸- 84cm870g直徑?64m/m\n\n顏色- 赤褐/原木\n\n※TO55-細棒尾形狀以利跟球點，加寬擊球甜蜜區\n※適合長打型。\n\n產地- 日本\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 09:37:00', '上架', 1, 'bat.jpg'),
(35, 'mizuno || 日製教練棒 MIZUNO PRO KNOCK', 700, 'assets/img/rent_product_img/手套-12.jpg', 'wooden_bat010.jpg', '', '', '', '', '', '材質- 朴木+楓木\n\n尺寸- 90cm 約570g 直徑ψ57m/m\n\n顏色- 朴木+楓木\n\n※朴木與楓木合木，兼具輕量與耐用。\n\n產地- 日本\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 09:39:00', '上架', 1, 'bat.jpg'),
(36, 'mizuno || 日製重量訓練棒 PROFESSIONAL W', 600, 'assets/img/rent_product_img/手套-11.jpg', 'wooden_bat011.jpg', '', '', '', '', '', '材質- 木\n\n尺寸- 84cm 約950g 直徑?65m/m\n\n顏色- 黑/紅色\n\n※日本展示會限定顏色，職業選手型。\n\n產地- 越南\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 09:40:00', '上架', 1, 'bat.jpg'),
(37, 'BRETT成人用捕手面罩\n', 2000, 'assets/img/rent_product_img/護具-6.jpg', 'b6r.jpg', 'b6b.jpg', '', '', 'b6bb.jpg', '', '型號：B-M01\n材質：中空鋼\n規格：W28*H29cm', '護具', '均碼', 'BRETT', '單一顏色', '捕手護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 14:05:47', '下架', 1, 'size.jpg'),
(38, '全罩式成人用捕手頭盔', 2500, 'assets/img/rent_product_img/護具-4.jpg', '1707125122.jpg', '', '', '', '', '', '型號：B-CH06\n材質：ABS/鐵\n規格：成人用\n\n附臉頰側調整泡棉片\n經濟部標準檢驗局檢驗合格', '護具', '均碼', 'BRETT', '單一顏色', '捕手護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 23:42:00', '上架', 1, 'size.jpg'),
(39, '流線型調整式捕手頭盔', 3000, 'assets/img/rent_product_img/護具-3.jpg', '1707129961.jfif', '', '', '', '', '', '型號：CH-02/01\n材質：ABS\n- 可調式頭圍 -', '護具', '均碼', 'BRETT', '單一顏色', '捕手護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 23:43:00', '上架', 1, 'size.jpg'),
(40, 'GB5輕量型打擊護肘', 2100, 'assets/img/rent_product_img/護具-8.jpg', '1707130174.jpg', '', '', '', '', '', '型號：EQP-1', '護具', '均碼', 'BRETT', '單一顏色', '打擊護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 23:44:00', '上架', 1, 'size.jpg'),
(41, 'mizuno || 日製成人軟式金屬棒 WILL DRIVE RED', 1900, 'assets/img/rent_product_img/護具-2.jpg', 'metallic_bat001.jpg', '', '', '', '', '', '材質- 超鋁合金\n\n尺寸- 84cm 700g 直徑?68m/m\n\n顏色- 紅色\n\n\n※安打型設計(M BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 越南\n\n上市月份- 2023年 4月', '球棒', '均碼', 'MIZUNO', '單一顏色', '鋁棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 23:45:00', '上架', 1, 'bat.jpg'),
(42, 'mizuno || 日製成人軟式金屬棒 WILL DRIVE BLUE', 2500, 'assets/img/rent_product_img/護具-5.jpg', 'metallic_bat002.jpg', '', '', '', '', '', '材質- ZX70\n\n尺寸- 84cm 580g 直徑?69m/m\n\n顏色- 藍色\n\n\n※安打型設計(T BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 越南\n\n上市月份- 2023年 4月', '球棒', '', 'MIZUNO', '單一顏色', '鋁棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 23:46:00', '上架', 1, 'bat.jpg'),
(43, 'mizuno || 日製成人軟式金屬棒', 2500, 'assets/img/rent_product_img/護具-1.jpg', 'metallic_bat003.jpg', '', '', '', '', '', '材質- 超鋁合金\n\n尺寸- 84cm 700g 直徑ψ68m/m\n\n顏色- 銀色\n\n※安打型設計(M BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 9月', '球棒', 'M', 'MIZUNO', '單一顏色', '鋁棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 23:51:00', '上架', 1, 'bat.jpg'),
(44, 'mizuno || 日製成人軟式金屬棒', 3500, 'assets/img/rent_product_img/護具-0.jpg', 'metallic_bat004.jpg', '', '', '', '', '', '材質- ZX70\n\n尺寸- 84cm 570g 直徑ψ69m/m\n\n顏色- 金色\n\n\n※長打型設計(T BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 9月', '球棒', '均碼', 'MIZUNO', '單一顏色', '鋁棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-02 23:52:00', '上架', 1, 'bat.jpg'),
(45, 'mizuno || 日製成人軟式金屬棒 WILL DRIVERED', 200, 'assets/img/rent_product_img/baseball-cap-navy1.webp', 'metallic_bat005.jpg', '', '', '', '', '', '材質- 超鋁合金\n\n尺寸- 84cm 710g 直徑ψ68m/m\n\n顏色- 紅色\n\n※長打型設計(T BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '鋁棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 08:59:00', '上架', 1, 'bat.jpg'),
(46, 'mizuno || 日製成人軟式金屬棒 WILL DRIVEBLUE', 200, 'assets/img/rent_product_img/baseball-cap-gray.webp', 'metallic_bat006.jpg', '', '', '', '', '', '材質- ZX70\n\n尺寸- 84cm 600g 直徑ψ69m/m\n\n顏色- 藍色\n\n\n※安打型設計(M BALANCE)。\n※日本軟式球新規格M號球對應。\n\n產地- 日本\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '鋁棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:00:00', '上架', 1, 'bat.jpg'),
(47, 'mizuno || 少年軟式金屬棒 WILL DRIVE RED', 200, 'assets/img/rent_product_img/baseball-cap-white.webp', 'metallic_bat007.jpg', '', '', '', '', '', '材質- 超鋁合金\n\n尺寸- 78cm 約540g 直徑ψ66m/m\n\n顏色- 紅色\n\n※安打型設計(M BALANCE)，縱向研磨。\n※日本軟式球新規格J號球對應。\n\n產地- 中國\n\n材質- 超鋁合金\n\n尺寸- 78cm 約540g 直徑ψ66m/m\n\n顏色- 紅色\n\n※安打型設計(M BALANCE)，縱向研磨。\n※日本軟式球新規格J號球對應。\n\n產地- 中國\n\n上市月份- 2023年 3月', '球棒', '均碼', 'MIZUNO', '單一顏色', '鋁棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:01:00', '上架', 1, 'bat.jpg'),
(48, 'Louisville Slugger║ALL-STAR IV 楓木慢壘木棒-深藍25OZ', 250, 'assets/img/rent_product_img/57_DX8621064_p1924657.webp', 'wooden_bat012.jpg', '', '', '', '', '', '●材質：楓木 \n●挖洞：有 \n●長度：34\" \n●重量：25oz', '球棒', '均碼', 'LouisvilleSlugger', '單一顏色', '木棒', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:07:00', '上架', 1, 'bat.jpg'),
(49, 'mizuno || 壘球手套 FRIENDSHIP', 400, 'assets/img/rent_product_img/71huJcpRrbL._AC_SL1500_.jpg', 'baseball_glove002.jpg', '', 'baseball_glove002red.jpg', 'baseball_glove002green.jpg', 'baseball_glove002blue.jpg', 'baseball_glove002yellow.jpg', '材質- \n面,指背/裡:豬皮\n穿帶:牛皮\n\n球擋- CROSS 1\n\n守備位置- 內野手\n\n※耐用全皮仕樣:掌面,內裡,指背採用全豬皮\n※指背採用豬皮，適合初階球友使用，柔軟好上手。\n\n產地- 中國\n\n上市月份- 2023年 3月', '手套', 'S,M,L', 'MIZUNO', '橘', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:09:00', '上架', 1, 'sizehands.jpg'),
(50, 'mizuno || 壘球手套 FRIENDSHIP PRO', 600, 'assets/img/rent_product_img/800x.webp', 'baseball_glove005.jpg', '', 'baseball_glove005purple.jpg', 'baseball_glove005green.jpg', 'baseball_glove005blue.jpg', 'baseball_glove005yellow.jpg', '材質- \n面,指背/裡:豬皮\n穿帶:牛皮\n\n球擋- CROSS 1\n\n守備位置- 內野手\n\n※耐用全皮仕樣:掌面,內裡,指背採用全豬皮\n※指背採用豬皮，適合初階球友使用，柔軟好上手。\n\n產地- 泰國\n\n上市月份- 2023年 9月', '手套', 'M,L', 'MIZUNO', '紅', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:22:00', '上架', 1, 'sizehands.jpg'),
(51, 'mizuno || 壘球手套 MVP', 700, 'assets/img/rent_product_img/800x (1).webp', 'baseball_glove007.jpg', '', '', '', '', '', '材質- \n面:高級牛皮 \n裡:豬皮 \n指背.穿帶:牛皮\n\n球擋- DEEP 1\n\n守備位置- 內野手\n\n※外皮全牛皮，內裏採用厚芯豬皮，舒適性提升。\n※適合慢壘進階球友使用。\n※美規式樣，姆指內側尺寸剛印，指背刺繡MRB logo，更顯質感。\n\n產地- 台灣\n\n上市月份- 2023年 7月', '手套', 'M,L', 'MIZUNO', '紅', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:23:00', '上架', 1, 'sizehands.jpg'),
(52, '日本製 FILA KUBOTA SPECIAL ORDER KSN-L7S 軟式內野手套', 700, 'assets/img/rent_product_img/800x (2).webp', '199.webp', '', '199red.jpg', '199green.jpg', '199blue.jpg', '199yellow.jpg', '日本製 FILA KUBOTA SPECIAL ORDER KSN-L7S 軟式內野手套\n正日製久保田 SPECIAL ORDER，非一般量產手套配色！\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\nSLUGGER 以自家刀模的接球穩定感而聞名，體驗正日製經典就選 SLUGGER！\n產品特點：\n1. 顏色：客製化配色\n2. 尺寸：11.7吋\n3. 重量：550克\n4. 款式：內野 (軟式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本\n7. 附 SLUGGER 手套袋 & 專用紙箱正日製久保田 SPECIAL ORDER，非一般量產手套配色！\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\nSLUGGER 以自家刀模的接球穩定感而聞名，體驗正日製經典就選 SLUGGER！\n產品特點：\n1. 顏色：客製化配色\n2. 尺寸：11.7吋\n3. 重量：550克\n', '手套', 'S,M,L', 'FILA', '白', '右手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:28:00', '上架', 1, 'sizehands.jpg'),
(53, '日本製 FILA  KUBOTA SPECIAL ORDER KSG-L7S 硬式內野手套', 800, 'assets/img/rent_product_img/800x (3).webp', '198.webp', '', '', '', '', '', '日本製 FILA KUBOTA SPECIAL ORDER KSG-L7S 硬式內野手套\n正日製久保田 SPECIAL ORDER，非一般量產手套配色！\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\nSLUGGER 以自家刀模的接球穩定感而聞名，體驗正日製經典就選 SLUGGER！\n產品特點：\n1. 顏色：客製化配色\n2. 尺寸：11.7吋\n3. 重量：550克\n4. 款式：內野 (硬式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本\n7. 附 SLUGGER 手套袋 & 專用紙箱正日製久保田 SPECIAL ORDER，非一般量產手套配色！\n久保田手套為日本擁有長久歷史的手套品牌，日本及台灣均深受廣大球友們喜愛，\n淺村榮斗、中島卓也、鳥谷敬、大和、上本博紀，以上日本職棒球員也為久保田的愛用者！\nSLUGGER 以自家刀模的接球穩定感而聞名，體驗正日製經典就選 SLUGGER！\n產品特點：\n1. 顏色：客製化配色\n2. 尺寸：11.7吋\n3. 重量：550克\n4. 款式：內野 (軟式)\n5. 材質：TOP GRAIN STEERHIDE 高階牛革\n6. 產地：日本\n7. 附 SLUGGER 手套袋 & 專用紙箱', '手套', 'S,M,L', 'FILA', '白', '右手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:35:00', '上架', 1, 'sizehands.jpg'),
(54, 'FILA RAWLINGS PRO PREFERRED CUSTOM ORDER 訂製款 PROS2', 1200, 'assets/img/rent_product_img/SH_11GM243014.jpg', '197.webp', '', '197red.jpg', '197green.jpg', '197blue.jpg', '197yellow.jpg', '美國進口 羅林斯 RAWLINGS PRO PREFERRED CUSTOM ORDER 訂製款 PROS205 硬式投手手套\n', '手套', 'S,M,L', 'FILA', '綠', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:50:00', '上架', 1, 'sizehands.jpg'),
(55, '日本製 OAKLEY NATIONAL LINE 軟式內野手套', 800, 'assets/img/rent_product_img/SH_11GP222109.jpg', '188.webp', '', '188red.jpg', '188green.jpg', '188blue.jpg', '188yellow.jpg', '日本製 OAKLEY NATIONAL LINE 軟式內野手套\n 為日本OAKLEY當地質感出眾的小品牌，皮革及紮實度都還不錯。\n產品特點：\n1. 顏色：黑色\n2. 尺寸：11.25吋\n3. 重量：530克\n4. 款式：內野 (軟式)\n5. 材質：天然皮革\n6. 產地：日本', '手套', 'S,M,L', 'OAKLEY', '黑', '右手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 09:51:00', '上架', 1, 'sizehands.jpg'),
(56, '日本製 OAKLEY 目錄外限定版 軟式內野手套', 1000, 'assets/img/rent_product_img/SH_11GM232614.jpg', '187.webp', '', '187red.jpg', '187green.jpg', '187blue.jpg', '187yellow.jpg', '\n\n日本製 OAKLEY 目錄外限定版 軟式內野手套\nOAKLEY 為日本當地質感出眾的小品牌，皮革及紮實度都還不錯。\n產品特點：\n1. 顏色：橘色\n2. 尺寸：11.8吋\n3. 重量：480克\n4. 款式：內野 (軟式)\n5. 材質：天然皮革\n6. 產地：日本', '手套', 'S,M,L', 'OAKLEY', '橘', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 11:09:00', '上架', 1, 'sizehands.jpg'),
(57, '亮皮六支裝球棒袋', 700, 'assets/img/rent_product_img/2634c6f75a3edf99f212bc4720d8bd85.jpeg', '1707131309.jfif', '', '', '', '', '', '型號：SP-PRO060\n材質：亮皮\n規格：90cm X 24cm X 24cm\n\n可裝六支棒球棒', '裝備', '均碼', 'BRETT', '單一顏色', '球具袋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:35:35', '上架', 1, 'bag1.JPG'),
(58, '可坐式硬殼置球袋', 900, 'assets/img/rent_product_img/tw-11134201-7r98w-lmft4yfubt7dfc.jpeg', '1707131395.jfif', '', '', '', '', '', '型號：SD-00067\n材質：尼龍/塑膠\n規格：90cm X 35cm X 35cm\n\n可裝五打棒球/三打壘球\n硬殼內裏不變型\n可當椅子坐', '裝備', '均碼', 'BRETT', '單一顏色', '球袋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:36:54', '上架', 1, 'bag1.JPG'),
(59, '三支裝球棒袋', 500, 'assets/img/rent_product_img/5e61fb33288bd71c475a1cb6e9cc14ad.jpeg', '1707131446.jfif', '', '', '', '', '', '型號：SP-00055\n材質：聚酯纖維\n規格：38” X 12”\n\n可裝三支棒球棒或四支壘球棒', '裝備', '均碼', 'BRETT', '單一顏色', '球具袋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:37:52', '上架', 1, 'bag1.JPG'),
(60, '日本製 FILA (maxstr) 日本大阪職人手作 硬式最高階 內野手套 棒球手套 壘球手套', 500, 'assets/img/rent_product_img/5bcfe1ab81f38c40bf505d93daa3d265.jpeg', '186.webp', '', '', '', '', '', '日本製 ALEGRIA (?????) 硬式最高階 內野手套 \n日本大阪職人手作 ALEGRIA (?????) 硬式手套，皮革品質及作工細節都秉持著傳統日本製的高要求，\n手口標 & 鋼印 LOGO 等細節透露出巧思美感，紮實耐用度也頗有水準，為整體內外兼具的優質小品牌日製手套。\n產品特點：\n1. 顏色：深藍\n2. 尺寸：11.75吋\n3. 重量：540克\n4. 款式：內野 (硬式)\n5. 材質：天然皮革\n6. 產地：日本大阪', '手套', 'S,M,L', 'FILA', '黑', '裝備袋', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:38:53', '上架', 1, 'sizehands.jpg'),
(61, '日本製 FILA (prov2) 日本大阪職人手作 吉見一起聯名款 硬式最高階 投手手套 棒球手套 ', 400, 'assets/img/rent_product_img/f74df3d73c45682eb78fe36b3142053c.jpeg', '185.webp', '', '', '', '', '', '日本製 ALEGRIA (?????) 吉見一起聯名款 硬式最高階 投手手套 \n日本大阪職人手作 ALEGRIA (?????) 硬式手套，皮革品質及作工細節都秉持著傳統日本製的高要求，\n手口標 & 鋼印 LOGO 等細節透露出巧思美感，紮實耐用度也頗有水準，為整體內外兼具的優質小品牌日製手套。\n*吉見一起聯名款，手口吉見投球剪影刺繡 & 球擋特殊設計。\n產品特點：\n1. 顏色：黑色\n2. 尺寸：12.25吋\n3. 重量：560克\n4. 款式：投手 (硬式)\n5. 材質：天然皮革\n6. 產地：日本大阪', '手套', 'S,M,L', 'FILA', '藍', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:39:52', '上架', 1, 'sizehands.jpg'),
(62, '日本製 FILA (pro) 日本大阪職人手作 硬式最高階 內野手套', 200, 'assets/img/rent_product_img/tw-11134207-7r98s-lmzwnioootjt38.jpeg', '184.webp', '', '', '', '', '', '日本製 ALEGRIA (?????) 硬式最高階 內野手套 \n日本大阪職人手作 ALEGRIA (?????) 硬式手套，皮革品質及作工細節都秉持著傳統日本製的高要求，\n手口標 & 鋼印 LOGO 等細節透露出巧思美感，紮實耐用度也頗有水準，為整體內外兼具的優質小品牌日製手套。\n產品特點：\n1. 顏色：橘色\n2. 尺寸：12吋\n3. 重量：540克\n4. 款式：內野 (硬式)\n5. 材質：天然皮革\n6. 產地：日本大阪', '手套', 'S,M,L', 'FILA', '橘', '右手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:41:02', '上架', 1, 'sizehands.jpg'),
(63, '日本製 ZETT PROSTATUS 小林誠司 JSBB 軟式最高階 BLP3238C 成人用 捕手', 100, 'assets/img/rent_product_img/tw-11134207-7r98t-lqg9288ul3ia17.jpeg', '182.webp', '', '182red.jpg', '182green.jpg', '182blue.jpg', '182yellow.jpg', '日本製 ZETT PROSTATUS 小林誠司 JSBB 軟式最高階 BLP3238C 成人用 捕手', '護具', '均碼', 'ZETT', '藍', '捕手護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:41:58', '上架', 1, 'size.jpg'),
(64, 'NIKE 棒球打擊護腳 右打專用 護脛', 400, 'assets/img/rent_product_img/tw-11134207-7r991-lpdarsm1xeev2e.jpeg', 'nike1.jpg', '', '', '', '', '', '最新款NIKE打擊護脛護腳,堅韌耐用提供防護,符合人體工學穿戴舒適~\n\n\n\n材質：聚乙烯.聚酯纖維.橡膠\n\n\n\n*可調整繫帶,可依個人需求做調整,達到最佳的運動表現\n\n*符合人體工學設計,穿戴方便舒適\n\n*DRI-FIT科技~保持乾爽舒適', '護具', '均碼', 'NIKE', '黑', '打擊護具', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:43:47', '上架', 1, 'size.jpg'),
(65, '日本製 EASTON PRO ORDER 大M金標 Tsuboi 坪井智哉 硬式最高階 外野手套', 700, 'assets/img/rent_product_img/tw-11134207-7qul4-lghfb5xdc46i2e.jpeg', '161.webp', '', '', '', '', '', '材質：透氣網布+TPU 棒球專用釘鞋底 Fresh Foam 一體成型中大底\n', '手套', 'M,L,XL', 'EASTON', '橘', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:44:40', '上架', 1, 'sizehands.jpg'),
(66, 'EASTON FUTURE ELITE 未來之星 即戰力 牛皮 兒童 少年 棒壘手套 ', 200, 'assets/img/rent_product_img/tw-11134201-23030-adyrdqzhaiove3.jpeg', '172.webp', '', '', '', '', '', '型號：FUTURE ELITE\n尺寸 : 約11吋\n款式 : 工字 (如圖示)\n材質 : 即戰力牛皮\n顏色 : 寶藍紅 (如圖示)\n特色 : \n專為十一歲以下青少年球員設計，Future Elite的Flex Notch閉合系統使這款手套易於上手，柔軟舒適的即戰力牛皮，可以隨時調整手套的開闔大小，確保每位球員都能獲得牢固、可控的貼合感。內裡還加入了一層超柔軟的掌心襯裡，能夠承受一次又一次的撞擊。', '手套', 'M,L,XL', 'EASTON', '藍', '右手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-05 13:46:47', '上架', 1, 'sizehands.jpg'),
(67, 'EASTON EMKC-1150RHT 棒壘手套 內野 工字 黑灰', 456, 'assets/img/rent_product_img/1707198977.jfif', '171.webp', '', '', '', '', '', '型號：EMKC-1150RHT\n尺寸 : 約11.5吋\n款式 : 工字 (如圖示)\n材質 : 美國天然牛皮\n顏色 : 黑灰 (如圖示)\n特色 : \nEASTON MAKO COMP系列棒壘手套，採用美國天然牛皮製成，柔軟卻耐用，任何設計都符合人體工學，超柔軟的襯裡，使用更舒適。', '手套', 'XS,M', 'EASTON', '黑', '左手', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2024-02-06 14:03:41', '下架', 0, 'sizehands.jpg'),
(68, '日本製 FILA PRO 日本職棒 NPB 歐力士猛牛', 200, '', '180.webp', '', '', '', '', '', '日本進口 FILA PRO 日本職棒 NPB 歐力士猛牛 T-岡田 親筆簽名 硬式單耳頭盔\nFILA PRO 日本職棒 NPB 單耳打擊頭盔，\n超輕量設計，可蒐藏也可實戰配戴質感遠勝一般台灣頭盔！\n產品特點：\n1. 顏色：消光黑 (如照片)\n2. 尺寸 (頭圍)：M (56 ~ 57 cm)\n3. 重量：355 g\n4. 材質：高強度 ABS 樹脂\n5. 產地：中國', '帽子', 'S,M,L', 'FILA', '黑', '打擊頭盔', '2024-05-17 17:17:55', '2024-05-17 17:17:55', '2024-05-17 17:17:55', '', 0, 'size.jpg'),
(69, 'mizuno || 棒壘球鞋 LIGHTREVO ELITE TPU PRO', 600, '', 'baseball_shoes009.jpg', '', 'baseball_shoes009red.jpg', 'baseball_shoes009green.jpg', 'baseball_shoes009blue.jpg', 'baseball_shoes009yellow.jpg', '材質- \n鞋面：人工皮革\n大底：射出成型大底\n\n重量- 約285g(27.0cm單腳)\n\n產地- 柬埔寨\n\n上市月份- 2023年 1月', '球鞋', '24,25,26,27,28,29,30,31', 'MIZUNO', '白', '跑鞋', '2024-05-17 17:20:32', '2024-05-17 17:20:32', '2024-05-17 17:20:32', '', 0, 'sizeeshoe.JPG'),
(70, 'Mizuno 打擊護腳 護脛', 400, '', 'm1.jpg', '', '', '', '', '', '品名：Mizuno 打擊護腳/護脛  特色：  。快扣設計，穿脫便利  。硬式棒球可用  款式：右/左打通用款  顏色：黑  尺寸/規格：單一尺寸  型號：380149-9090', '護具', '均碼', 'Mizuno ', '黑', '打擊護具', '2024-05-17 17:21:12', '2024-05-17 17:21:12', '2024-05-17 17:21:12', '', 0, 'size.jpg'),
(71, '║EASTON║進口成人捕手頭盔', 800, '', 'e1bk.jpg', '', 'e1r.jpg', '', 'e1b.jpg', '', '★ABS材質多通風孔設計。 ★輕量化、高剛性的護籠提供優異的視野。 ★黑、寶藍、紅', '護具', 'S,M,L', 'EASTON', '黑', '捕手護具', '2024-05-17 17:21:52', '2024-05-17 17:21:52', '2024-05-17 17:21:52', '', 0, 'size.jpg'),
(72, '日本製 UNDER ARMOUR MLB 紅襪隊 吉田正尚 球員版 硬式外野手套', 400, '', '145.webp', '', '', '', '', '', '日本製 UNDER ARMOUR MLB 紅襪隊 吉田正尚 球員版 硬式外野手套', '手套', 'S,M', 'UNDER ARMOUR', '黑', '右手', '2024-05-17 17:21:59', '2024-05-17 17:21:59', '2024-05-17 17:21:59', '', 0, 'sizehands.jpg'),
(73, 'NIKE 打擊護肘', 200, '', 'n1b.jpg', '', '', '', '', '', '尺寸：         成人（長-約17cm)\n\n\n\n材質：聚乙烯.聚酯纖維.橡膠\n\n\n\n特性：\n\n1.舒適及安全符合人體工學設計 Dri-FIT內襯可以幫助你保持乾爽舒適\n\n2.耐用的外殼PE 高硬度護具提供的防護 採用材質輕量 吸汗又速乾 透氣通風 穿\n\n3.戴輕鬆無束縛感 實用耐用保護功能超高 有效保護以免球吻 可調魔鬼', '護具', '均碼', 'Nike', '黑', '打擊護具', '2024-05-18 06:24:28', '2024-05-18 06:24:28', '2024-05-18 06:24:28', '', 0, 'size.jpg'),
(74, '亞瑟士 ASICS 棒壘球打擊護手', 200, '', 'a1r.jpg', '', '', '', '', '', '左右兼用', '護具', '均碼', 'ASICS ', '紅', '打擊護具', '2024-05-18 06:24:58', '2024-05-18 06:24:58', '2024-05-18 06:24:58', '', 0, 'size.jpg'),
(75, 'MIZUNO 美津濃護胸', 700, '', 'm4r.jpg', '', '', '', '', '', '尺寸 : L號 約16吋 (可調設計)  材質：網布+EVA FOAM  特色 : A. 舒適-採用吸震性& 透氣 性佳(DryLite) 內襯材料 B. 頸墊-雙肩  墊，腰部兩側 翼墊，可拆卸自由調整 C. 耐久性佳，輕量化 D. 低反彈科  技護墊 E. 可拆卸式腰部兩側翼墊 (美國專利No.6826786) F. 附尼龍袋 使用  高級材質製造  可提高耐用度  透氣通風  品質超優  高密度泡棉填充物提  供防護 舒適及穿戴具有最佳包覆性  穿戴舒適  通風透氣不黏膩 有效保', '護具', '均碼', 'MIZUNO', '紅', '捕手護具', '2024-05-18 06:25:07', '2024-05-18 06:25:07', '2024-05-18 06:25:07', '', 0, 'size.jpg'),
(76, '美津濃 MIZUNO 成人用硬式棒壘球打擊頭盔', 200, '', 'm2r.jpg', 'm2b.jpg', '', '', 'm2bb.jpg', '', '特性:\n\nA.新設計:表面亮霧雙效特殊處理+流線型帽體設計\nB.透氣性及輕量化提升:較以往品增加透氣孔+重量約減2g\n\nC.耐用性:採用耐衝擊ABS樹酯\n\nD.舒適性:內裝透氣高發泡內墊襯\n\nE.符合美國國家運動用具委員會標準，經濟部標準局檢驗局合格\n\n材質 : ABS強化樹脂 聚脂纖維+ EVA', '帽子', '均碼', 'MIZUNO', '紅', '打擊頭盔', '2024-05-18 06:45:30', '2024-05-18 06:45:30', '2024-05-18 06:45:30', '', 0, 'size.jpg'),
(77, 'BRETT職業用捕手面罩', 600, '', 'b5r.jpg', 'b5b.jpg', '', '', 'b5bb.jpg', '', '型號 :   BLMT-626  尺寸 : FREE (可調設計)  顏色 : 黑、寶藍   材質 : 中空鋼材/EVA海綿/泡棉/聚酯纖維/塑膠/尼龍等材質  特色 : 採用中空合金鋼材  有效降低球擊對捕手的傷害  耐  衝擊輕量化處理  護墊處填充高級緩衝材料  面罩一體成  型  可有效阻擋棒球衝擊  下層墊片內側 同職業用  面具加吸濕排汗布  使用更舒適', '護具', '均碼', 'BRETT', '紅', '捕手護具', '2024-05-18 06:58:06', '2024-05-18 06:58:06', '2024-05-18 06:58:06', '', 0, 'size.jpg'),
(78, 'BRETT 高級輕量捕手面罩', 300, '', 'b1r.jpg', '', '', '', '', '', '●「BRETT」高級輕量捕手面罩。  ●型號：「B-M01」。  ●材質：中空鋼、防震泡棉。  ●重量：約590公克。', '護具', '均碼', 'BRETT', '紅', '捕手護具', '2024-05-18 07:07:51', '2024-05-18 07:07:51', '2024-05-18 07:07:51', '', 0, 'size.jpg'),
(79, 'MIZUNO PRO BASEBALL 打擊護手背', 100, '', 'm1r.jpg', '', '', '', '', '', '1DJPG211 材質:EVA POLY 越南 & 中國製 約45 G', '護具', '均碼', 'MIZUNO', '紅', '打擊護具', '2024-05-18 07:07:57', '2024-05-18 07:07:57', '2024-05-18 07:07:57', '', 0, 'size.jpg'),
(80, 'BRETT捕手護膝墊', 100, '', 'b1b.jpg', '', '', '', '', '', 'Catcher\'s Wedges 型號：EQP-8 材質：PU發泡棉 規格：一對入 / ONE SIZE 訂價：1,260 發泡棉材質可扣環於捕手護膝減輕捕手蹲捕負擔 ', '護具', '均碼', 'BRETT', '藍', '捕手護具', '2024-05-18 07:08:00', '2024-05-18 07:08:00', '2024-05-18 07:08:00', '', 0, 'size.jpg'),
(81, 'Nike 棒壘球捕手護胸 ', 600, '', 'n2b.jpg', '', '', '', '', '', '品牌 Nike 顏色 黑色 狀態 現貨供應 特色 美國進口 / 安全防護 輕便舒適', '護具', '均碼', 'NIKE', '藍', '捕手護具', '2024-05-18 07:08:05', '2024-05-18 07:08:05', '2024-05-18 07:08:05', '', 0, 'size.jpg'),
(82, 'BRETT棒球壘球護具擊球手打者可調整頭盔雙耳成人少年', 500, '', 'b2b.jpg', '', '', '', '', '', '頭盔可調整大小，確保配戴舒適且穩固，有效保護擊球手的安全。適用於各類棒球及壘球比賽及訓練', '護具', '均碼', 'BRETT', '黑', '打擊護具', '2024-05-18 07:08:17', '2024-05-18 07:08:17', '2024-05-18 07:08:17', '', 0, 'size.jpg'),
(83, 'SSK成人硬式全罩式捕手面罩', 800, '', 's2b.jpg', '', '', '', '', '', '', '護具', '均碼', 'SSK', '黑', '捕手護具', '2024-05-18 07:08:22', '2024-05-18 07:08:22', '2024-05-18 07:08:22', '', 0, 'size.jpg'),
(84, 'SSK成人硬式護胸', 800, '', 's3b.jpg', '', '', '', '', '', '', '護具', '均碼', 'SSK', '黑', '捕手護具', '2024-05-18 07:08:26', '2024-05-18 07:08:26', '2024-05-18 07:08:26', '', 0, 'size.jpg'),
(85, 'SSK成人硬式護膝', 700, '', 's4b.jpg', '', '', '', '', '', '', '護具', '均碼', 'SSK', '黑', '捕手護具', '2024-05-18 07:08:33', '2024-05-18 07:08:33', '2024-05-18 07:08:33', '', 0, 'size.jpg'),
(86, '日本製 UNDER ARMOUR (UA) 硬式最高階 反手 投手手套 左投', 800, '', '146.webp', '', '', '', '', '', '日本製 UNDER ARMOUR 硬式最高階 反手 投手手套 日本限定款 UNDER ARMOUR 日製頂級硬式手套， 皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！ 產品特點： 1. 顏色：紅色 2. 尺寸：12.25吋 3. 重量：565克 4. 款式：投手 (反手硬式) 5. 材質：天然皮革 (牛皮) 6. 產地：日本', '手套', 'S,M,L', 'UNDER ARMOUR', '紅', '左手', '2024-05-19 08:24:37', '2024-05-19 08:24:37', '2024-05-19 08:24:37', '', 0, 'sizehands.jpg'),
(87, '日本製 UNDER ARMOUR (UA) 硬式最高階 T字球擋 反手 外野手套 棒球手套 壘球手套', 700, '', '147.webp', '', '', '', '', '', '日本製 UNDER ARMOUR 硬式最高階 反手 外野手套 日本限定款 UNDER ARMOUR 日製頂級硬式手套， 皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！ 產品特點： 1. 顏色：紅色 2. 尺寸：13吋 3. 重量：620克 4. 款式：外野 (反手硬式) 5. 材質：天然皮革 6. 產地：日本', '手套', 'S,M,L', 'UNDER ARMOUR', '紅', '左手', '2024-05-19 08:24:42', '2024-05-19 08:24:42', '2024-05-19 08:24:42', '', 0, 'sizehands.jpg'),
(88, '日本製 UNDER ARMOUR (UA) 硬式最高階 工字球擋 QBB0239 內野手套', 700, '', '148.webp', '', '', '', '', '', '日本製 UNDER ARMOUR 硬式最高階 工字球擋 QBB0239 內野手套 日本限定款 UNDER ARMOUR 日製硬式內野手套， 皮面非常紮實漂亮，搭配 UA 立體刺繡手口標，極致經典！ *早期的 UA 日本製 QBB 系列，目前全新品已稀有難尋。 產品特點： 1. 顏色：橘色 2. 尺寸：11.75吋 3. 重量：570克 4. 款式：內野 (硬式) 5. 材質：天然皮革 6. 產地：日本', '手套', 'M,L', 'UNDER ARMOUR', '橘', '左手', '2024-05-19 08:24:45', '2024-05-19 08:24:45', '2024-05-19 08:24:45', '', 0, 'sizehands.jpg'),
(89, '日本製 UNDER ARMOUR (UA) 硬式最高階 投手手套 棒球手套 壘球手套', 700, '', '149.webp', '', '', '', '', '', '日本製 UNDER ARMOUR 硬式最高階 投手手套 日本限定款 UNDER ARMOUR 日製頂級硬式手套， 皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！ 產品特點： 1. 顏色：紅色 2. 尺寸：12吋 3. 重量：580克 4. 款式：投手 (硬式) 5. 材質：天然皮革 6. 產地：日本 (日本進口)', '手套', 'M,L,XL', 'UNDER ARMOUR', '紅', '左手', '2024-05-19 08:24:49', '2024-05-19 08:24:49', '2024-05-19 08:24:49', '', 0, 'sizehands.jpg'),
(90, '日本製 UNDER ARMOUR (UA) 硬式最高階 T字球擋 外野手套 棒球手套 壘球手套', 700, '', '150.webp', '', '', '', '', '', '日本製 UNDER ARMOUR 硬式最高階 外野手套 日本限定款 UNDER ARMOUR 日製硬式外野手套， 皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！ 產品特點： 1. 顏色：紅色 2. 尺寸：13吋 3. 重量：620克 4. 款式：外野 (硬式) 5. 材質：天然皮革 (牛皮) 6. 產地：日本', '手套', 'M,L', 'UNDER ARMOUR', '紅', '右手', '2024-05-19 08:24:53', '2024-05-19 08:24:53', '2024-05-19 08:24:53', '', 0, 'sizehands.jpg'),
(91, '日本製 UNDER ARMOUR (UA) 金子千尋 硬式最高階 投手手套 棒球手套 壘球手套', 600, '', '151.webp', '', '', '', '', '', '日本製 UNDER ARMOUR 金子千尋 硬式最高階 投手手套 日本限定款 UNDER ARMOUR 日製頂級硬式手套， 皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！ 產品特點： 1. 顏色：紅色 2. 尺寸：12吋 3. 重量：580克 4. 款式：投手 (硬式) 5. 材質：天然皮革 6. 產地：日本', '手套', 'M,L', 'UNDER ARMOUR', '紅', '右手', '2024-05-19 08:24:57', '2024-05-19 08:24:57', '2024-05-19 08:24:57', '', 0, 'sizehands.jpg'),
(92, '日本製 UNDER ARMOUR (UA) 硬式最高階 傳統十字球擋 內野手套 棒球手套 壘球手套', 600, '', '152.webp', '', '', '', '', '', '日本製 UNDER ARMOUR 硬式最高階 內野手套 日本限定款 UNDER ARMOUR 日製硬式內野手套， 皮面紮實漂亮，搭配 UA 立體刺繡金標，經典帥氣！ 產品特點： 1. 顏色：紅色 2. 尺寸：12吋 3. 重量：530克 4. 款式：內野 (硬式) 5. 材質：天然皮革 (牛皮) 6. 產地：日本', '手套', 'M,L,XL', 'UNDER ARMOUR', '紅', '右手', '2024-05-19 08:25:01', '2024-05-19 08:25:01', '2024-05-19 08:25:01', '', 0, 'sizehands.jpg'),
(93, '美國進口 New Balance 大谷翔平 球員版 硬式投手手套 超夢幻蒐藏逸品', 800, '', '153.webp', '', '', '', '', '', '美國進口 New Balance 大谷翔平 球員版 硬式投手手套 超夢幻蒐藏逸品 美國限定發售的 New Balance 大谷翔平球員版手套，也是目前 New Balance 大谷翔平的首款手套， 小指背號 17 刺繡、拇指 NB Logo、手口 NB 球鞋刺繡，低調奢華又特別的 MVP 明星級選擇，同時也極具蒐藏價值。 產品特點： 1. 顏色：原皮 x 黑色 2. 尺寸：12.75吋 3. 重量：660克 4. 款式：投手 (硬式) 5. 材質：高階牛革 6. 產地：日本', '手套', 'M', 'New Balance', '橘', '右手', '2024-05-19 08:25:04', '2024-05-19 08:25:04', '2024-05-19 08:25:04', '', 0, 'sizehands.jpg'),
(94, '║EASTON║Z5 TWO TONE進口打擊頭盔', 600, '', 'b3b.jpg', '', 'b3r.jpg', '', '', '', '★耐用的ABS材質提供絕佳保護避免高衝擊的撞擊。 ★高密度吸汗內襯提供打者安全舒適的防護。 ★符合NOCASE標準之棒壘打擊頭盔。 ★尺寸55cm-61cm', '帽子', '均碼', 'EASTON', '藍', '打擊頭盔', '2024-05-19 08:25:11', '2024-05-19 08:25:11', '2024-05-19 08:25:11', '', 0, 'size.jpg'),
(95, '║EASTON║Z5 GRIP進口打擊頭盔', 600, '', 'e2bk.jpg', '', '', '', '', '', '★耐用的ABS材質提供絕佳保護避免高衝擊的撞擊。 ★高密度吸汗內襯提供打者安全舒適的防護。 ★符合NOCASE標準之棒壘打擊頭盔。 ★尺寸成人加大59.5cm-63.5cm ★霧面設計。', '帽子', '均碼', 'EASTON', '黑', '打擊頭盔', '2024-05-19 08:25:15', '2024-05-19 08:25:15', '2024-05-19 08:25:15', '', 0, 'size.jpg'),
(96, '║ZETT║用打擊護肘', 200, '', 'z2r.jpg', 'z2b.jpg', '', '', '', '', '材質 : PE殼/合成皮革/聚酯纖維 尺寸 : 同一尺寸(左右打同)，長17cm、寬14cm 顏色 : 共兩種(黑、紅)', '護具', '均碼', 'ZETT', '紅', '打擊護具', '2024-05-19 09:17:36', '2024-05-19 09:17:36', '2024-05-19 09:17:36', '', 0, 'size.jpg'),
(97, '║ZETT║捕手連罩式頭盔', 800, '', 'z1b.jpg', '', '', '', 'z1bb.jpg', '', '★材質：ABS樹脂．EVA泡棉．聚脂纖維．橡膠．軟鐵', '護具', '均碼', 'ZETT', '黑', '捕手護具', '2024-05-19 09:17:42', '2024-05-19 09:17:42', '2024-05-19 09:17:42', '', 0, 'size.jpg'),
(98, 'BRETT 布雷特職業級GLADIATOR RS版 全罩式 成人 捕手 頭盔', 800, '', 'b4r.jpg', '', '', '', 'b4bb.jpg', '', 'A. 舒適 透氣性佳 B. 安全-頭頂部位3層EVA 襯墊材料 C. 堅固-面  罩剛材採用鋼合金，耐衝擊佳 經濟部檢驗局檢驗合格 使用高級材質製造    可提高耐用度  透氣通風  品質超優  高密度泡棉填充物提供防護 舒適及穿  戴具有最佳包覆性  穿戴舒適  通風透氣不黏膩 有效保護腳以下 品質與材  質  ', '護具', '均碼', 'BRETT', '紅', '捕手護具', '2024-05-19 09:17:45', '2024-05-19 09:17:45', '2024-05-19 09:17:45', '', 0, 'size.jpg'),
(99, 'Mizuno 棒壘球 打擊護肘', 200, '', 'm1b.jpg', '', '', '', '', '', ' 材質:特多龍、EVA、尼龍、TPU     尺寸:One Size     特性:  A-輕量耐候:彈性TPU本體  B-舒適:Drylite速乾內裡', '護具', '均碼', 'Mizuno ', '黑', '打擊護具', '2024-05-19 09:18:17', '2024-05-19 09:18:17', '2024-05-19 09:18:17', '', 0, 'size.jpg'),
(100, 'Mizuno 硬式用打擊頭盔', 500, '', 'm3b.jpg', '', '', '', '', '', 'A.新設計:表面亮霧雙效特殊處理+流線型帽體設計  B.透氣性及輕量化提升:較以往品增加透氣孔+重量約減2g  C.耐用性:採用耐衝擊ABS樹酯  D.舒適性:內裝透氣高發泡內墊襯  E.符合美國國家運動用具委員會標準，經濟部標準局檢驗局合格檢驗', '帽子', '均碼', 'Mizuno ', '黑', '打擊頭盔', '2024-05-19 09:18:23', '2024-05-19 09:18:23', '2024-05-19 09:18:23', '', 0, 'size.jpg');

-- --------------------------------------------------------

--
-- 資料表結構 `teacher`
--

CREATE TABLE `teacher` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `teacher_id` int(3) NOT NULL,
  `photo` varchar(255) NOT NULL,
  `description` varchar(1000) NOT NULL,
  `valid` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `teacher`
--

INSERT INTO `teacher` (`id`, `name`, `teacher_id`, `photo`, `description`, `valid`) VALUES
(1, '郭岱琦', 1, 'Kanas_Kociang.jpg\n', '前中職統一7-ELEVEn獅隊  球員<br>現任中崙高中棒球隊  總教練  ', 1),
(2, '李藍浩', 2, 'Li_Lanhao.jpg', '前 桃源國小少棒隊 教練<br>現任國泰國小棒球隊 主教練', 0),
(3, '許聖杰', 3, 'Xu_Shengjie.jpg', '前 中職和信鯨 球員<br>\n前 中職統一7-ELEVEn獅隊 首席教練<br>\n現任新竹明新科技大學棒球隊  總教練', 1),
(4, '黃文博', 4, 'Huang_Wenbo.jpg', '前 中職味全龍 球員<br>\n前 中職和信鯨 球員<br>\n前 巴塞隆納奧運 中華代表隊成員<br>\n中職總冠軍MVP<br>\n前中職 台鋼雄鷹 客座投手教練<br>\n現任 好棒河馬棒球俱樂部 教練', 1),
(5, '李品叡', 5, 'Li_Pinrui.jpg', '前中職統一7-ELEVEn獅隊  球員<br>\n現任竹林小飛熊棒球隊  教練<br>\n現任 好棒河馬棒球俱樂部 教練', 1),
(6, '林璿增', 6, 'Lin_Xuzeng.jpg', '前 崇越隼鷹棒球隊 球員<br>\n前 台中運動家成棒隊 球員<br>\n現任 好棒河馬棒球俱樂部 教練', 1),
(7, '何紹彬', 7, 'Ho_Shaopin.jpg', '前 MiLB 邁阿密馬林魚 球員<br>\n前 獨立聯盟 魁北克首都隊 球員<br>\n現任 帕菲克運動基地 教練', 1),
(8, '李岱祐', 8, 'Li_Daiyou.jpg', '前 三重商工青棒隊 總教練<br>\n前 台北城市科技大學棒球隊 教練<br>\n現任 好棒河馬棒球俱樂部 教練', 1),
(9, '林建宏', 9, 'Lin_Jianhong.jpg', '職棒選手私人體能訓練師<br>\n現任 平鎮高棒青棒隊 體能教練', 1),
(10, '何獻凡', 10, 'He_Xianfan.jpg', '前 中職中信鯨 守備教練<br>\n前 中華成棒U23培訓隊 教練<br>\n現任 好棒河馬棒球俱樂部 總教練', 1),
(11, '黃恩賜', 11, 'Huang_n4.jpg', '前 中職統一7-ELEVEn獅隊 球員<br>\n中職二軍打擊王、安打王<br>\n現任  好棒河馬棒球俱樂部 教練', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `type`
--

CREATE TABLE `type` (
  `id` int(3) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `type`
--

INSERT INTO `type` (`id`, `name`, `img`) VALUES
(1, '所有', 'book-solid.png'),
(2, '投球', 'Vector.png'),
(3, '守備', 'Vector (2).png'),
(4, '體能', 'Vector (3).png'),
(5, '知識', 'brain-solid.png'),
(6, '打擊', 'Vector (1).png');

-- --------------------------------------------------------

--
-- 資料表結構 `user`
--

CREATE TABLE `user` (
  `id` int(3) UNSIGNED NOT NULL,
  `account` varchar(255) DEFAULT NULL,
  `email` varchar(200) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  `phone` varchar(10) DEFAULT NULL,
  `photo` varchar(255) DEFAULT 'm1.jpg',
  `address` varchar(255) DEFAULT NULL,
  `address_city` varchar(255) DEFAULT NULL,
  `address_district` varchar(255) DEFAULT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `name` varchar(255) NOT NULL,
  `google_uid` varchar(200) DEFAULT NULL,
  `line_uid` varchar(200) DEFAULT NULL,
  `line_access_token` varchar(200) DEFAULT NULL,
  `valid` int(3) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `user`
--

INSERT INTO `user` (`id`, `account`, `email`, `password`, `birthday`, `created`, `phone`, `photo`, `address`, `address_city`, `address_district`, `gender`, `name`, `google_uid`, `line_uid`, `line_access_token`, `valid`) VALUES
(1, 'masiwei@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2024-01-01', '2024-01-24 12:08:11', '0970999388', 'm10.jpg', '桃園市龜山區文興路13號', NULL, NULL, 'Male', '馬思維', '', NULL, NULL, 1),
(2, 'psyp@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2024-01-31', '2024-01-24 12:08:00', '0912809316', 'm10.jpg', '花蓮縣吉安鄉永興一街27號', NULL, NULL, 'Male', '楊俊逸', '', NULL, NULL, 1),
(3, 'knowknow@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-05-08', '2024-01-24 11:50:57', '0970072068', 'm9.jpg', '桃園市桃園區榮華街17號', NULL, NULL, 'Male', '丁震', '', NULL, NULL, 1),
(4, 'melo@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-05-06', '2024-01-24 12:08:34', '0970426168', 'm8.jpg', '屏東縣高樹鄉南興路31號', NULL, NULL, 'Male', '謝宇傑', '', NULL, NULL, 1),
(5, 'bambii@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-10-24', '2024-01-24 12:08:56', '0955613340', 'm8.jpg', '臺中市東勢區東關路26號', NULL, NULL, 'Female', '斑比', '', NULL, NULL, 1),
(6, 'tom@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-02-21', '2024-01-24 12:14:25', '0952364565', 'm7.jpg', '南投縣鹿谷鄉中正路25號', NULL, NULL, 'Male', '蔡家豪', '', NULL, NULL, 1),
(7, 'eric@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2022-11-11', '2024-01-24 12:15:04', '0927572161', 'm7.jpg', '彰化縣永靖鄉永坡路14號', NULL, NULL, 'Male', '陳聖家', '', NULL, NULL, 1),
(8, 'luna@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-15', '2024-01-24 12:17:08', '0982603781', 'm6.jpg', '高雄市仁武區名山六街29號', NULL, NULL, 'Male', '林家媛', '', NULL, NULL, 1),
(9, 'emma@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-10-11', '2024-01-24 12:17:08', '0916207259', 'm6.jpg', '新北市泰山區忠孝街4號', NULL, NULL, 'Female', '黃怡婷', '', NULL, NULL, 1),
(10, 'nineone@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-07-18', '2024-01-24 12:20:27', '0916040631', 'm5.jpg', '新北市中和區四維街26號', NULL, NULL, 'Female', '趙馨玥', '', NULL, NULL, 1),
(11, 'ava@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-08', '2024-01-24 12:20:46', '0955452460', 'm5.jpg', '南投縣南投市信義街12號', NULL, NULL, 'Female', '張怡君', '', NULL, NULL, 1),
(12, 'tim@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-22', '2024-01-24 12:20:56', '0939778365', 'm4.jpg', '臺南市下營區中營2號', NULL, NULL, 'Male', '李小名', '', NULL, NULL, 1),
(13, 'sophia@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-30', '2024-01-24 12:21:00', '0928222037', 'm4.jpg', '桃園市桃園區中正一街24號', NULL, NULL, 'Female', '王小美', '', NULL, NULL, 1),
(14, 'vava@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-15', '2024-01-24 12:21:07', '0927049524', 'm3.jpg', '苗栗縣苗栗市建國街10號', NULL, NULL, 'Female', '毛衍七', '', NULL, NULL, 1),
(15, 'emily@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-07-04', '2024-01-24 12:21:10', '0937054249', 'm3.jpg', '臺南市東區龍山街34號', NULL, NULL, 'Female', '吳小芳', '', NULL, NULL, 1),
(16, 'olivia@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-09-27', '2024-01-24 12:21:14', '0970029794', 'm2.jpg', '彰化縣埔心鄉中山路30號', NULL, NULL, 'Female', '劉雅慧', '', NULL, NULL, 1),
(17, 'jason@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-09-25', '2024-01-24 12:21:18', '0912568724', 'm2.jpg', '臺南市安南區智安二街15號', NULL, NULL, 'Male', '許小安', '', NULL, NULL, 1),
(18, 'kevin@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-06-23', '2024-01-24 12:21:22', '0965723841', 'm1.jpg', '屏東縣潮州鎮田新路5號', NULL, NULL, 'Male', '葉家躍', '', NULL, NULL, 1),
(19, 'eric@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2024-01-09', '2024-01-24 12:21:27', '0987568243', 'm1.jpg', '高雄市鳳山區文清街10號', NULL, NULL, 'Male', '楊小華', '', NULL, NULL, 1),
(20, 'amy@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-06-08', '2024-01-24 12:21:32', '0943521687', 'm10.jpg', '雲林縣口湖鄉水尾1號', NULL, NULL, 'Female', '鄭雅婷', '', NULL, NULL, 1),
(21, 'alice@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-11', '2024-01-24 12:21:42', '0958236541', 'm10.jpg', '嘉義縣朴子市朴子工業區一街23號', NULL, NULL, 'Female', '謝雅雯', '', NULL, NULL, 1),
(22, 'david@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-09-20', '2024-01-24 12:21:47', '0998765359', 'm9.jpg', '苗栗縣竹南鎮大埔街16號', NULL, NULL, 'Male', '郭志成', '', NULL, NULL, 1),
(23, 'grace@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-09-29', '2024-01-24 12:21:52', '0975689325', 'm9.jpg', '澎湖縣馬公市中華路25號', NULL, NULL, 'Female', '洪淑惠', '', NULL, NULL, 1),
(24, 'james@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-10-22', '2024-01-24 12:22:15', '0999683215', 'm8.jpg', '南投縣草屯鎮信洋街32號', NULL, NULL, 'Male', '邱志明', '', NULL, NULL, 1),
(25, 'tina@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-03-27', '2024-01-24 12:22:22', '0956874258', 'm8.jpg', '屏東縣屏東市仁愛路22號', NULL, NULL, 'Female', '曾家梅', '', NULL, NULL, 1),
(26, 'alex@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-07-06', '2024-01-24 12:22:27', '0998623354', 'm7.jpg', '臺中市西屯區科園路13號', NULL, NULL, 'Male', '盧承家', '', NULL, NULL, 1),
(27, 'jerry@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-05', '2024-01-24 12:22:31', '0988756324', 'm7.jpg', '雲林縣元長鄉內寮5號', NULL, NULL, 'Male', '尤志偉', '', NULL, NULL, 1),
(28, 'andy@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-07-21', '2024-01-24 12:22:35', '0944365232', 'm6.jpg', '臺中市北屯區南興北一路9號', NULL, NULL, 'Male', '賴志豪', '', NULL, NULL, 1),
(29, 'joyce@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-09-20', '2024-01-24 12:22:38', '0922365985', 'm6.jpg', '新北市三芝區楓林六街11號', NULL, NULL, 'Female', '吳淑芬', '', NULL, NULL, 1),
(30, 'vivian@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-11-04', '2024-01-24 12:22:42', '0993365472', 'm5.jpg', '臺南市南區省躬橫街24號', NULL, NULL, 'Female', '彭家蓉', '', NULL, NULL, 1),
(31, 'cindy@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-10-26', '2024-01-24 12:22:46', '0987652303', 'm5.jpg', '南投縣鹿谷鄉光華巷31號', NULL, NULL, 'Female', '羅小薇', '', NULL, NULL, 1),
(32, 'jack@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-06-26', '2024-01-24 12:22:50', '0986325647', 'm4.jpg', '臺南市南區新仁路1號', NULL, NULL, 'Male', '康小東', '', NULL, NULL, 1),
(33, 'Ivy@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-10-30', '2024-01-24 12:22:55', '0933365258', 'm4.jpg', '高雄市前鎮區興順街3號', NULL, NULL, 'Female', '詹家瓊', '', NULL, NULL, 1),
(34, 'allen@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-05-26', '2024-01-24 12:23:02', '0922354785', 'm3.jpg', '高雄市小港區鳳福路26號', NULL, NULL, 'Male', '徐小凱', '', NULL, NULL, 1),
(35, 'vincent@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-06-09', '2024-01-24 12:23:02', '0966553328', 'm3.jpg', '新竹縣橫山鄉仁愛街10號', NULL, NULL, 'Male', '何小志', '', NULL, NULL, 1),
(36, 'jenny@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-08-06', '2024-01-24 12:23:02', '0922448856', 'm2.jpg', '高雄市前鎮區瑞東二街17號', NULL, NULL, 'Female', '方小惠', '', NULL, NULL, 1),
(37, 'sam@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-07-08', '2024-01-24 12:23:02', '0966325875', 'm2.jpg', '彰化縣伸港鄉大同九街34號', NULL, NULL, 'Male', '廖小妮', '', NULL, NULL, 1),
(38, 'ken@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2024-01-06', '2024-01-24 12:23:02', '0965322365', 'm1.jpg', '高雄市三民區重慶路19號', NULL, NULL, 'Male', '李佑廷', '', NULL, NULL, 1),
(39, 'chris@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2024-01-08', '2024-01-24 12:23:02', '0985236542', 'm1.jpg', '高雄市楠梓區大學五十六街6號', NULL, NULL, 'Male', '呂冠廷', '', NULL, NULL, 1),
(40, 'claire@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-11-21', '2024-01-24 12:23:02', '0953256235', 'm10.jpg', '彰化縣員林市豐年街14號', NULL, NULL, 'Female', '江家嫣', '', NULL, NULL, 1),
(41, 'tony@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-12-07', '2024-01-24 12:23:02', '0985356243', 'm10.jpg', '新竹縣竹北市自強一路30號', NULL, NULL, 'Male', '蕭冠宇', '', NULL, NULL, 1),
(42, 'annie@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-11-01', '2024-01-24 12:23:02', '0985235461', 'm9.jpg', '臺中市西屯區西安街16號', NULL, NULL, 'Female', '莊家歆', '', NULL, NULL, 1),
(43, 'vicky@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-12-01', '2024-01-24 12:23:02', '0928485823', 'm9.jpg', '臺中市后里區福興路16號', NULL, NULL, 'Female', '溫永晴', '', NULL, NULL, 1),
(44, 'jessica@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-12-08', '2024-01-24 12:23:02', '0923585823', 'm8.jpg', '雲林縣臺西鄉民生路12號', NULL, NULL, 'Female', '鄧子晴', '', NULL, NULL, 1),
(45, 'leo@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2023-11-30', '2024-01-24 12:23:02', '0936506696', 'm8.jpg', '臺南市南區健民街2號', NULL, NULL, 'Male', '周家輝', '', NULL, NULL, 1),
(46, 'peggy@example.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2024-01-30', '2024-01-24 12:23:02', '0924031885', 'm7.jpg', '彰化縣大村鄉東美路32號', NULL, NULL, 'Female', '孫家瑤', '', NULL, NULL, 1),
(48, 'test@test.com', NULL, '827ccb0eea8a706c4c34a16891f84e7b', '2024-02-09', '2024-02-03 18:31:20', '0911111111', 'm7.jpg', '111', NULL, NULL, 'Male', '卯咪', '', NULL, NULL, 1),
(49, 'test2@test.com', NULL, '12345', '2024-04-01', '2024-04-23 22:46:30', '0912345678', 'm6.jpg', '11111', NULL, NULL, 'Male', '狗勾', '', NULL, NULL, 1),
(50, 'boy@123.com', NULL, '96e79218965eb72c92a549dd5a330112', '0000-00-00', '2024-04-24 16:58:37', '0912345567', 'm6.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '死神', '', NULL, NULL, 1),
(51, 'bbb@fff.cccc', NULL, 'af15d5fdacd5fdfea300e88a8e253e82', '0000-00-00', '2024-04-25 05:53:32', '0912345678', 'm5.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '匿名', '', NULL, NULL, 1),
(52, 'joe@ddd.com', NULL, '96e79218965eb72c92a549dd5a330112', '0000-00-00', '2024-04-25 05:54:35', '0900000000', 'm5.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '小丑', '', NULL, NULL, 1),
(53, 'joe1@aaa.com', NULL, '670b14728ad9902aecba32e22fa4f6bd', '0000-00-00', '2024-04-25 05:55:33', '0900000000', 'm4.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '日本隊長', '', NULL, NULL, 1),
(54, 'ader@123.com', NULL, 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', '2024-04-25 05:56:10', '0900000000', 'm4.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '台灣隊長', '', NULL, NULL, 1),
(55, 'user1@test.ccccc', NULL, 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', '2024-04-25 05:57:38', '0900000000', 'm3.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '隱形人', '', NULL, NULL, 1),
(56, '13245@test.com', NULL, 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', '2024-04-25 05:58:08', '0900000000', 'm3.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '維志', '', NULL, NULL, 1),
(57, 'ben@123.com', NULL, 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', '2024-04-25 05:58:39', '0900000000', 'm2.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '品潔', '', NULL, NULL, 1),
(58, 'tttt@tttt.tt', NULL, 'e10adc3949ba59abbe56e057f20f883e', '2024-04-04', '2024-04-26 01:21:13', '0912345678', 'm2.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '修竹', '', NULL, NULL, 1),
(59, 'ttt@ttt.tt', NULL, 'e10adc3949ba59abbe56e057f20f883e', '2024-04-02', '2024-04-27 03:19:28', '11111111', 'm10.jpg', '蘆洲', '基隆市', '中山區', 'Female', '王曉明u8', '', NULL, NULL, 1),
(60, 'aaa@aaa.aa', NULL, 'e10adc3949ba59abbe56e057f20f883e', '2024-04-17', '2024-04-27 03:40:13', '0912345677', 'm1.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '宏穎', '', NULL, NULL, 1),
(61, 'boy2285256@gmail.com', NULL, 'e10adc3949ba59abbe56e057f20f883e', '1996-03-09', '2024-04-28 13:44:01', '0912345678', 'm1.jpg', 'undefined', 'undefined', 'undefined', 'undefined', '姿佑', '', NULL, NULL, 1),
(64, NULL, 'xxx@gmail.com', NULL, NULL, NULL, NULL, 'https://lh3.googleusercontent.com/a/xxxxxx', NULL, NULL, NULL, NULL, '柏彣', '100000685961710971999', NULL, NULL, 1),
(65, NULL, 'xxx@gmail.com', NULL, NULL, NULL, NULL, 'https://lh3.googleusercontent.com/a/xxxxxx', NULL, NULL, NULL, NULL, '截尼規', '100000685961710971991', NULL, NULL, 1),
(66, NULL, 'xxx@gmail.com', NULL, NULL, NULL, NULL, 'https://lh3.googleusercontent.com/a/xxxxxx', NULL, NULL, NULL, NULL, '小火龍', '100000685961710971990', NULL, NULL, 1),
(67, NULL, 'xxx@gmail.com', NULL, NULL, NULL, NULL, 'https://lh3.googleusercontent.com/a/xxxxxx', NULL, NULL, NULL, NULL, '皮卡丘', '100000685961710971993', NULL, NULL, 1),
(69, NULL, 'twbaseballteam@gmail.com', NULL, NULL, NULL, NULL, '1715844376207_umpire.png', NULL, NULL, NULL, NULL, '棒球好玩家', '112525581598621432124', NULL, NULL, 1),
(70, 'TzuYu@test.com', 'TzuYu@test.com', 'e10adc3949ba59abbe56e057f20f883e', '2024-04-30', '2024-04-30 02:53:29', '0912345678', 'm1.jpg', '聖德基督', '桃園市', '楊梅區', 'Female', 'TzuYu', NULL, NULL, NULL, 1),
(77, 'WTF@test.com', NULL, 'e10adc3949ba59abbe56e057f20f883e', '2000-05-05', '2024-05-09 06:12:28', '0975395146', 'm1.jpg', '大M3林公園1號', '臺北市', '大安區', 'Male', '王德發', NULL, NULL, NULL, 1),
(78, 'HLS@test.com', NULL, 'e10adc3949ba59abbe56e057f20f883e', '2000-06-06', '2024-05-09 06:13:38', '0978948615', 'm1.jpg', '安平古堡6號', '臺南市', '安平區', 'Male', '后里蟹', NULL, NULL, NULL, 1),
(80, NULL, '', NULL, NULL, NULL, NULL, 'https://profile.line-scdn.net/0hLoYUPM2zE0BkLAMMoktsF1hpHS0TAhUIHE0IL0ElTnZNTAcWC0kMJER7TSRMFAAVCEpbJ0YqS3Yd', NULL, NULL, NULL, NULL, '阿德', NULL, 'Ub22e419c54d40970d6c5e46cc40fcad9', 'eyJhbGciOiJIUzI1NiJ9.hauu1TVhFg-bxGI0ubJFe6yS1FYsjKohMknROtq8_O7yHPv2x3ccC5KxX9hcCE8ji0f5DaPoy5naTakKTWvNTWmIAsdd1yOLeZR6CsOaOa6ZeNF0IFaFlAzucXbThqWarxlgNxEQJCeQ76Km-O0O0O1XHdUkQKxZuiTMFuDaVs8.oFopFV1', 1),
(83, NULL, 'boy2285256@gmail.com', NULL, NULL, NULL, NULL, 'https://lh3.googleusercontent.com/a/ACg8ocIXQGwH-5PJWH32x87XdAYmCq-ntO0VCmpUQ0rQg6MDS2feBg=s96-c', NULL, NULL, NULL, NULL, '蘇偉德（阿德）', '116204341993205137138', NULL, NULL, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `user_coupon`
--

CREATE TABLE `user_coupon` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `coupon_id` int(11) NOT NULL,
  `issue_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `redemption_date` timestamp NULL DEFAULT NULL,
  `is_used` tinyint(1) DEFAULT 0,
  `used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `user_coupon`
--

INSERT INTO `user_coupon` (`id`, `user_id`, `coupon_id`, `issue_date`, `redemption_date`, `is_used`, `used_at`, `created_at`, `updated_at`) VALUES
(1, 1, 12, '2024-04-29 05:57:46', '2024-05-14 14:50:37', 1, NULL, '2024-04-29 05:57:46', '2024-05-14 14:50:37'),
(2, 1, 2, '2024-04-29 05:57:46', NULL, 0, '2022-12-31 16:00:00', '2024-04-29 05:57:46', '2024-05-02 03:45:30'),
(3, 1, 3, '2024-04-29 05:57:46', NULL, 0, NULL, '2024-04-29 05:57:46', '2024-05-02 03:37:32'),
(4, 1, 11, '2024-04-29 05:57:46', NULL, 0, NULL, '2024-04-29 05:57:46', '2024-05-01 05:25:53'),
(5, 1, 12, '2024-04-29 05:57:46', '2024-05-14 14:50:37', 1, '2023-01-31 16:00:00', '2024-04-29 05:57:46', '2024-05-14 14:50:37'),
(6, 1, 21, '2024-04-29 05:57:46', NULL, 0, NULL, '2024-04-29 05:57:46', '2024-05-01 05:26:01'),
(7, 3, 22, '2024-04-29 05:57:46', NULL, 0, NULL, '2024-04-29 05:57:46', '2024-04-29 05:57:46'),
(14, 2, 1, '2024-04-29 05:59:34', NULL, 0, NULL, '2024-04-29 05:59:34', '2024-04-29 05:59:34'),
(15, 2, 20, '2024-04-29 05:59:34', NULL, 1, '2023-01-31 16:00:00', '2024-04-29 05:59:34', '2024-04-29 05:59:34'),
(16, 3, 15, '2024-04-29 05:59:34', NULL, 0, NULL, '2024-04-29 05:59:34', '2024-04-29 05:59:34'),
(17, 3, 14, '2024-04-29 05:59:34', NULL, 0, NULL, '2024-04-29 05:59:34', '2024-04-29 05:59:34'),
(19, 1, 4, '2024-05-02 05:24:21', '2024-05-14 14:51:32', 1, NULL, '2024-05-02 05:24:21', '2024-05-14 14:51:32'),
(20, 1, 7, '2024-05-02 05:26:35', '2024-05-14 14:47:56', 1, NULL, '2024-05-02 05:26:35', '2024-05-14 14:47:56'),
(21, 1, 8, '2024-05-02 05:38:47', '2024-05-14 14:49:56', 1, NULL, '2024-05-02 05:38:47', '2024-05-14 14:49:56'),
(22, 1, 9, '2024-05-02 05:44:55', '2024-05-14 14:49:20', 1, NULL, '2024-05-02 05:44:55', '2024-05-14 14:49:20'),
(23, 1, 10, '2024-05-02 05:46:50', NULL, 0, NULL, '2024-05-02 05:46:50', '2024-05-02 05:46:50'),
(24, 1, 25, '2024-05-02 05:58:45', NULL, 1, NULL, '2024-05-02 05:58:45', '2024-05-02 06:00:36'),
(25, 1, 1, '2024-05-02 08:44:04', NULL, 0, NULL, '2024-05-02 08:44:04', '2024-05-02 08:44:04'),
(26, 1, 20, '2024-05-02 08:45:46', '2024-05-14 09:00:44', 1, NULL, '2024-05-02 08:45:46', '2024-05-14 09:00:44'),
(27, 70, 1, '2024-05-17 07:23:35', '2024-05-17 15:10:00', 1, NULL, '2024-05-17 07:23:35', '2024-05-17 15:10:00'),
(28, 70, 2, '2024-05-17 07:23:44', '2024-05-17 15:14:53', 1, NULL, '2024-05-17 07:23:44', '2024-05-17 15:14:53'),
(29, 70, 3, '2024-05-17 07:27:53', '2024-05-17 14:55:44', 1, NULL, '2024-05-17 07:27:53', '2024-05-17 14:55:44'),
(30, 70, 4, '2024-05-17 07:28:05', '2024-05-17 14:53:15', 1, NULL, '2024-05-17 07:28:05', '2024-05-17 14:53:15'),
(31, 70, 5, '2024-05-17 07:30:20', '2024-05-17 15:10:55', 1, NULL, '2024-05-17 07:30:20', '2024-05-17 15:10:55'),
(32, 70, 6, '2024-05-17 07:30:29', '2024-05-17 09:45:16', 1, NULL, '2024-05-17 07:30:29', '2024-05-17 09:45:16'),
(33, 70, 7, '2024-05-17 07:30:36', '2024-05-17 15:12:42', 1, NULL, '2024-05-17 07:30:36', '2024-05-17 15:12:42'),
(34, 70, 8, '2024-05-17 07:31:24', '2024-05-17 15:18:17', 1, NULL, '2024-05-17 07:31:24', '2024-05-17 15:18:17'),
(35, 70, 9, '2024-05-17 07:31:34', NULL, 0, NULL, '2024-05-17 07:31:34', '2024-05-17 07:31:34'),
(36, 70, 10, '2024-05-17 07:31:43', NULL, 0, NULL, '2024-05-17 07:31:43', '2024-05-17 07:31:43'),
(37, 70, 11, '2024-05-17 07:31:50', '2024-05-17 08:52:04', 1, NULL, '2024-05-17 07:31:50', '2024-05-17 08:52:04'),
(38, 70, 15, '2024-05-17 07:32:12', '2024-05-17 15:14:16', 1, NULL, '2024-05-17 07:32:12', '2024-05-17 15:14:16'),
(39, 70, 16, '2024-05-17 07:32:22', '2024-05-18 04:02:57', 1, NULL, '2024-05-17 07:32:22', '2024-05-18 04:02:57'),
(40, 70, 18, '2024-05-17 07:32:28', '2024-05-17 14:59:51', 1, NULL, '2024-05-17 07:32:28', '2024-05-17 14:59:51'),
(41, 70, 21, '2024-05-17 07:32:36', '2024-05-17 15:01:24', 1, NULL, '2024-05-17 07:32:36', '2024-05-17 15:01:24'),
(42, 70, 25, '2024-05-17 07:32:43', NULL, 0, NULL, '2024-05-17 07:32:43', '2024-05-17 07:32:43'),
(43, 70, 24, '2024-05-17 07:32:49', '2024-05-17 15:08:25', 1, NULL, '2024-05-17 07:32:49', '2024-05-17 15:08:25'),
(44, 70, 23, '2024-05-17 07:32:56', '2024-05-17 14:56:20', 1, NULL, '2024-05-17 07:32:56', '2024-05-17 14:56:20'),
(45, 70, 52, '2024-05-17 07:33:19', NULL, 0, NULL, '2024-05-17 07:33:19', '2024-05-17 07:33:19'),
(46, 70, 55, '2024-05-17 07:33:40', NULL, 0, NULL, '2024-05-17 07:33:40', '2024-05-17 07:33:40'),
(47, 70, 56, '2024-05-17 07:33:47', '2024-05-17 14:54:09', 1, NULL, '2024-05-17 07:33:47', '2024-05-17 14:54:09'),
(48, 70, 57, '2024-05-17 07:33:54', '2024-05-17 15:09:12', 1, NULL, '2024-05-17 07:33:54', '2024-05-17 15:09:12'),
(49, 70, 30, '2024-05-17 07:34:23', '2024-05-17 09:48:10', 1, NULL, '2024-05-17 07:34:23', '2024-05-17 09:48:10'),
(50, 70, 47, '2024-05-17 07:35:37', '2024-05-17 15:03:34', 1, NULL, '2024-05-17 07:35:37', '2024-05-17 15:03:34'),
(51, 70, 20, '2024-05-17 07:36:11', '2024-05-17 15:05:56', 1, NULL, '2024-05-17 07:36:11', '2024-05-17 15:05:56'),
(52, 70, 31, '2024-05-17 15:52:55', '2024-05-18 08:46:26', 1, NULL, '2024-05-17 15:52:55', '2024-05-18 08:46:26'),
(53, 70, 32, '2024-05-17 15:53:50', NULL, 0, NULL, '2024-05-17 15:53:50', '2024-05-17 15:53:50'),
(54, 70, 40, '2024-05-17 15:54:11', NULL, 0, NULL, '2024-05-17 15:54:11', '2024-05-17 15:54:11'),
(55, 70, 12, '2024-05-18 03:58:18', NULL, 0, NULL, '2024-05-18 03:58:18', '2024-05-18 03:58:18'),
(56, 70, 13, '2024-05-18 08:44:48', NULL, 0, NULL, '2024-05-18 08:44:48', '2024-05-18 08:44:48'),
(57, 70, 53, '2024-05-20 02:39:48', '2024-05-20 02:40:58', 1, NULL, '2024-05-20 02:39:48', '2024-05-20 02:40:58');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `article`
--
ALTER TABLE `article`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `course`
--
ALTER TABLE `course`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `favorite`
--
ALTER TABLE `favorite`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `join_team`
--
ALTER TABLE `join_team`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `join_team_user`
--
ALTER TABLE `join_team_user`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `order`
--
ALTER TABLE `order`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `order_detail`
--
ALTER TABLE `order_detail`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `otp`
--
ALTER TABLE `otp`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `product_info`
--
ALTER TABLE `product_info`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `rent`
--
ALTER TABLE `rent`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `teacher`
--
ALTER TABLE `teacher`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `type`
--
ALTER TABLE `type`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user_coupon`
--
ALTER TABLE `user_coupon`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `article`
--
ALTER TABLE `article`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=94;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `cart`
--
ALTER TABLE `cart`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `comment`
--
ALTER TABLE `comment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=125;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupon`
--
ALTER TABLE `coupon`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `course`
--
ALTER TABLE `course`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `favorite`
--
ALTER TABLE `favorite`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `join_team`
--
ALTER TABLE `join_team`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `join_team_user`
--
ALTER TABLE `join_team_user`
  MODIFY `id` int(4) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=108;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order`
--
ALTER TABLE `order`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order_detail`
--
ALTER TABLE `order_detail`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `otp`
--
ALTER TABLE `otp`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=201;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_info`
--
ALTER TABLE `product_info`
  MODIFY `ID` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rent`
--
ALTER TABLE `rent`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `teacher`
--
ALTER TABLE `teacher`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `type`
--
ALTER TABLE `type`
  MODIFY `id` int(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user`
--
ALTER TABLE `user`
  MODIFY `id` int(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user_coupon`
--
ALTER TABLE `user_coupon`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
